{
    "source_pdf": "GATE_2016_CS_SET2.pdf",
    "extracted_text": "GATE 2016 General Aptitude - GA Set-6\n\nQ. 1- Q. 5 carry one mark each.\n\nQ.1\n\nQ.2\n\nQ.3\n\nQ.4\n\nQ.5\n\nThe man who is now Municipal Commissioner worked as\n\n(A) the security guard at a university\n(B) a security guard at the university\n(C) a security guard at university\n\n(D) the security guard at the university\n\nNobody knows how the Indian cricket team is going to cope with the difficult and seamer-friendly\nwickets in Australia.\n\nChoose the option which is closest in meaning to the underlined phrase in the above sentence.\n(A) put up with (B) put in with (C) put down to (D) put up against\nFind the odd one in the following group of words.\n\nmock, deride, praise, jeer\n(A) mock (B) deride (C) praise (D) jeer\nPick the odd one from the following options.\n(A) CADBE (B) JHKIL (C) XVYWZ (D) ONPMQ\n\nIn a quadratic function, the value of the product of the roots (a, B) is 4. Find the value of\n\na\" + Bp”\nart+pu\n\n(A) (B) 4” (Cc) 2 (D) 4\"\n\nQ. 6 — Q. 10 carry two marks each.\n\nQ.6\n\nAmong 150 faculty members in an institute, 55 are connected with each other through Facebook®\nand 85 are connected through WhatsApp®. 30 faculty members do not have Facebook® or\nWhatsApp® accounts. The number of faculty members connected only through Facebook® accounts\nis\n\n(A) 35 (B) 45 (C) 65 (D) 90\n\n1/3\n\n\n--- PAGE 1 ---\n\nQ.7\n\nQ.8\n\nQ.9\n\nGATE 2016 General Aptitude - GA Set-6\n\nComputers were invented for performing only high-end useful computations. However, it is no\nunderstatement that they have taken over our world today. The internet, for example, is ubiquitous.\nMany believe that the internet itself is an unintended consequence of the original invention. With\nthe advent of mobile computing on our phones, a whole new dimension is now enabled. One is left\nwondering if all these developments are good or, more importantly, required.\n\nWhich of the statement(s) below is/are logically valid and can be inferred from the above\nparagraph?\n\n(i) The author believes that computers are not good for us.\n(ii) Mobile computers and the internet are both intended inventions\n(A) () only (B) (ii) only (C) both Gi) and (ii)  (D)_ neither (4) nor (11)\n\nAll hill-stations have a lake. Ooty has two lakes.\n\nWhich of the statement(s) below is/are logically valid and can be inferred from the above\nsentences?\n\n(i) Ooty is not a hill-station.\n(ii) No hill-station can have more than one lake.\n\n(A) (i) only (B) (ii) only\n\n(C) both (i) and (11) (D) neither (i) nor (ii)\n\nIn a 2 x 4 rectangle grid shown below, each cell is a rectangle. How many rectangles can be\nobserved in the grid?\n\n(A) 21 (B) 27 (C) 30 (D) 36\n\n2/3\n\n\n--- PAGE 2 ---\n\nGATE 2016\n\nQ.10 25\n\nI(x)\n\nChoose the correct expression for f(x) given in the graph.\n\n(A) f@)=1-—|x-1| (B) f@)=1+|x-1\n\n(C) fa) =2-|x-1| (D) fx) =2+|x-1|\n\nEND OF THE QUESTION PAPER\n\nGeneral Aptitude - GA Set-6\n\n3/3\n\n\n--- PAGE 3 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ. 1 - Q. 25 carry one mark each.\nQ.1 Consider the following expressions:\n\n(i) false\n(ii) Q\n\n(iii) true\n(iv) PVQ\n(v) “OVP\n\nThe number of expressions given above that are logically implied by P A (P => Q) is\n\nQ.2 Let f(x) be a polynomial and g(x) = f’(x) be its derivative. If the degree of (f(x) + f(—x)) is\n10, then the degree of (g(x) — g(—x)) is\n\nQ.3. The minimum number of colours that is sufficient to vertex-colour any planar graph is\n\nQ.4 Consider the systems, each consisting of m linear equations in variables.\n\nI. If m <n, then all such systems have a solution\nII. If m > n, then none of these systems has a solution\n\nIll. If m =n, then there exists a system which has a solution\n\nWhich one of the following is CORRECT?\n(A) I, II and III are true\n(B) Only II and III are true\n(C) Only III is true\n\n(D) None of them is true\n\nCS(Set B) 1/18\n\n\n--- PAGE 4 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.5 Suppose that a shop has an equal number of LED bulbs of two different types. The probability\nof an LED bulb lasting more than 100 hours given that it is of Type | is 0.7, and given that it\nis of Type 2 is 0.4. The probability that an LED bulb chosen uniformly at random lasts more\nthan 100 hours is\n\nQ.6 Suppose that the eigenvalues of matrix A are 1,2,4. The determinant of (A~!)’ is\n\nQ.7 Consider an eight-bit ripple-carry adder for computing the sum of A and B, where A and B are\nintegers represented in 2’s complement form. If the decimal value of A is one, the decimal\nvalue of B that leads to the longest latency for the sum to stabilize is\n\nQ.8 Let, x1 6x2 x3 Gx4 =O where x1, x2, x3, x4 are Boolean variables, and @ is the XOR operator.\nWhich one of the following must always be TRUE?\n\n(A) x1.x2x3X4 = 0\n\n(B) x1x3+x2 =0\n\n(C) X1 6X3 = Xo BX4\n(D) x1 +x. +%3+%x4 =0\n\nQ.9 Let X be the number of distinct 16-bit integers in 2’s complement representation. Let Y be the\nnumber of distinct 16-bit integers in sign magnitude representation.\nThen X —Y is\n\nQ.10 A processor has 40 distinct instructions and 24 general purpose registers. A 32-bit instruction\nword has an opcode, two register operands and an immediate operand. The number of bits\navailable for the immediate operand field is\n\nCS(Set B) 2/18\n\n\n--- PAGE 5 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.11 Breadth First Search (BFS) is started on a binary tree beginning from the root vertex. There is\na vertex ¢ at a distance four from the root. If f is the n-th vertex in this BFS traversal, then the\nmaximum possible value of 7 is\n\nQ.12 The value printed by the following program is\n\nvoid f(int* p, int m){\nm=m + 5;\n*p = *p + mj;\nreturn;\n\n}\n\nvoid main() {\nint i=5, j=10;\n\n£(&1i, J);\nprintf(\"Sd\", itj);\n\nQ.13 Assume that the algorithms considered here sort the input sequences in ascending order. If the\ninput is already in ascending order, which of the following are TRUE?\nI. Quicksort runs in @(n7) time\nII. Bubblesort runs in @(n7) time\nIII. Mergesort runs in ©(n) time\n\nIV. Insertion sort runs in @(n) time\n\n(A) Land II only\n(B) I and II only\n(C) Land IV only\n(D) [and IV only\n\nCS(Set B) 3/18\n\n\n--- PAGE 6 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.14 The Floyd-Warshall algorithm for all-pair shortest paths computation is based on\n\nQ.15\n\nQ.16\n\nQ.17\n\n(A) Greedy paradigm.\n(B) Divide-and-Conquer paradigm.\n(C) Dynamic Programming paradigm.\n\n(D) neither Greedy nor Divide-and-Conquer nor Dynamic Programming paradigm.\n\nN items are stored in a sorted doubly linked list. For a delete operation, a pointer is provided\nto the record to be deleted. For a decrease-key operation, a pointer is provided to the record on\nwhich the operation is to be performed.\n\nAn algorithm performs the following operations on the list in this order: O(N) delete, O(logN)\ninsert, O(logN) find, and @(N) decrease-key. What is the time complexity of all these\noperations put together?\n\n(A) O(log?N) (B) O(N) (C) O(N?) (WD) O(N? logN)\n\nThe number of states in the minimum sized DFA that accepts the language defined by the\nregular expression\n(0+ 1)*(0+1)(04+1)*\n\nis\n\nLanguage L, is defined by the grammar: S; > aS,ble\nLanguage Ly is defined by the grammar: S27 — abS>|€\n\nConsider the following statements:\n\nP: L, is regular\nQ: Ly is regular\n\nWhich one of the following is TRUE?\n(A) Both P and Q are true\n(B) P is true and Q is false\n(C) Pis false and Q is true\n(D) Both P and Q are false\n\nCS(Set B) 4/18\n\n\n--- PAGE 7 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.18 Consider the following types of languages: L; : Regular, L2 : Context-free, L3 : Recursive,\nL4 : Recursively enumerable. Which of the following is/are TRUE?\nI. L3ULzg is recursively enumerable\nII. L2UL; is recursive\nII. L} Lz is context-free\nIV. L UL? is context-free\n\n(A) IT only\n(B) I and II only\n\n(C) I and IV only\n(D) I, IL and II only\n\nQ.19 Match the following:\n\n(P) Lexical analysis (i) Leftmost derivation\n(Q) Top down parsing (ii) Type checking\n(R) Semantic analysis (iii) Regular expressions\n\n(S) Runtime environments (iv) Activation records\n\n(A) POiQ@SiuROW,S ii\n(B) PSiQSiRGWS siv\n(CC) POUQSii,ROLIS Siv\n(D) PHev,QeiROous oii\n\nQ.20 In which one of the following page replacement algorithms it is possible for the page fault rate\nto increase even when the number of allocated frames increases?\n\n(A) LRU (Least Recently Used)\n\n(B) OPT (Optimal Page Replacement)\n(C) MRU (Most Recently Used)\n\n(D) FIFO (First In First Out)\n\nCS(Set B) 5/18\n\n\n--- PAGE 8 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.21 B+ Trees are considered BALANCED because\n(A) the lengths of the paths from the root to all leaf nodes are all equal.\n\n(B) the lengths of the paths from the root to all leaf nodes differ from each other by at\nmost 1.\n\n(C) the number of children of any two non-leaf sibling nodes differ by at most 1.\n\n(D) the number of records in any two leaf nodes differ by at most 1.\n\nQ.22 Suppose a database schedule S involves transactions 7}, ..., T,. Construct the precedence\ngraph of S with vertices representing the transactions and edges representing the conflicts. If\nS is serializable, which one of the following orderings of the vertices of the precedence graph\nis guaranteed to yield a serial schedule?\n\n(A) Topological order\n(B) Depth-first order\n(C) Breadth-first order\n\n(D) Ascending order of transaction indices\n\nQ.23 Anarkali digitally signs a message and sends it to Salim. Verification of the signature by Salim\nrequires\n\n(A) Anarkali’s public key.\n(B) Salim’s public key.\n(C) Salim’s private key.\n(D) Anarkali’s private key.\n\nQ.24 In an Ethernet local area network, which one of the following statements is TRUE?\n(A) A station stops to sense the channel once it starts transmitting a frame.\n\n(B) The purpose of the jamming signal is to pad the frames that are smaller than the\nminimum frame size.\n\n(C) A station continues to transmit the packet even after the collision is detected.\n\n(D) The exponential backoff mechanism reduces the probability of collision on\nretransmissions.\n\nCS(Set B) 6/18\n\n\n--- PAGE 9 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.25 Identify the correct sequence in which the following packets are transmitted on the network\n\nby a host when a browser requests a webpage from a remote server, assuming that the host has\njust been restarted.\n\n(A) HTTP GET request, DNS query, TCP SYN\n(B) DNS query, HTTP GET request, TCP SYN\n(C) DNS query, TCP SYN, HTTP GET request\n(D) TCP SYN, DNS query, HTTP GET request\n\nQ. 26 - Q. 55 carry two marks each.\n\nQ.26 A binary relation R on N x N is defined as follows: (a,b)R(c,d) if a <c or b < d. Consider\nthe following propositions:\n\nP: R is reflexive\nQ: R is transitive\n\nWhich one of the following statements is TRUE?\n(A) Both P and Q are true.\n(B) P is true and Q is false.\n(C) P is false and Q is true.\n(D) Both P and Q are false.\n\nQ.27_ Which one of the following well-formed formulae in predicate calculus is NOT valid?\n(A) (Vx p(x) = Vxq(x)) = (Axap(x) V Vxq(x))\n\n(B) (Ax p(x) V Axq(x)) = Ax(p(x) V q(x)\n(C) Ax (p(x) A q(x)) = (Axp(x) A Arq(x))\n(D) Vx (p(x) V q(x)) = (Wx p(x) V Vxq(x))\n\nCS(Set B) 7/18\n\n\n--- PAGE 10 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.28 Consider a set U of 23 different compounds in a Chemistry lab. There is a subset S of U of\n\nQ.29\n\nQ.30\n\nQ.31\n\nQ.32\n\n9 compounds, each of which reacts with exactly 3 compounds of U. Consider the following\nstatements:\nI. Each compound in U \\ S reacts with an odd number of compounds.\nII. At least one compound in U \\ S reacts with an odd number of compounds.\n\nIII. Each compound in U \\ S reacts with an even number of compounds.\n\nWhich one of the above statements is ALWAYS TRUE?\n(A) Only I\n(B) Only II\n(C) Only Il\n(D) None\n\nThe value of the expression 13°? (mod 17), in the range 0 to 16, is\n\nSuppose the functions F and G can be computed in 5 and 3 nanoseconds by functional units\nUr and Ug, respectively. Given two instances of Ur and two instances of UG, it is required to\nimplement the computation F (G(X;)) for 1 <i< 10. Ignoring all other delays, the minimum\ntime required to complete this computation is nanoseconds.\n\nConsider a processor with 64 registers and an instruction set of size twelve. Each instruction\nhas five distinct fields, namely, opcode, two source register identifiers, one destination register\nidentifier, and a twelve-bit immediate value. Each instruction must be stored in memory in\na byte-aligned fashion. If a program has 100 instructions, the amount of memory (in bytes)\nconsumed by the program text is\n\nThe width of the physical address on a machine is 40 bits. The width of the tag field in a 512\nKB 8-way set associative cache is bits.\n\nCS(Set B) 8/18\n\n\n--- PAGE 11 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.33 Consider a 3 GHz (gigahertz) processor with a three-stage pipeline and stage latencies 7,\nT, and 73 such that tT, = 3%/4 = 273. If the longest pipeline stage is split into two pipeline\nstages of equal latency, the new frequency is GHz, ignoring delays in the pipeline\nregisters.\n\nQ.34 A complete binary min-heap is made by including each integer in |1, 1023] exactly once.\nThe depth of a node in the heap is the length of the path from the root of the heap to that\nnode. Thus, the root is at depth 0. The maximum depth at which integer 9 can appear is\n\nQ.35 The following function computes X* for positive integers X and Y.\n\nint exp(int X, int Y) {\nint res = 1, a=X, b=/Y;\n\nwhile (b !=0 ){\nif ( b%2 == 0) { a = ata; b = b/2; }\nelse { res = res*a; b = b-l; }\n}\n\nreturn res;\n\n}\n\nWhich one of the following conditions is TRUE before every iteration of the loop?\n(A) x¥ =a?\n(B) (res *a)* =(res*xX)>\n(C) xX’ =resx*a?\n\n(D) XY = (res *a)>\n\nCS(Set B) 9/18\n\n\n--- PAGE 12 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.36 Consider the following New-order strategy for traversing a binary tree:\n\ne Visit the root;\ne Visit the right subtree using New-order;\ne Visit the left subtree using New-order;\n\nThe New-order traversal of the expression tree corresponding to the reverse polish expression\n34* 5-2 °* 67 * 1 + - Is given by:\n\n(A)+-167*2°75-34*%\n(B)-+1*6772-5%*34\n(C)-+1*7672-5%* 43\n(D)176*+2543%*-%*-\n\nQ.37. Consider the following program:\n\nint f(int *p, int n)\n{\n\nif (n <= 1) return 0;\n\nelse return max(f(ptl,n-1),p[0]-p[1]);\n}\n\nint main()\n{\nint a[] = {3,5,2,6,4};\nprintf(\"sd\", £(a,5));\n}\n\nNote: max (x,y) returns the maximum of x and y.\n\nThe value printed by this program is\n\nQ.38 Let A;,A2,A3, and Ay be four matrices of dimensions 10 x 5,5 x 20,20 x 10, and 10 x 5,\nrespectively. The minimum number of scalar multiplications required to find the product\nA A2A3Aq using the basic matrix multiplication method is\n\nCS(Set B) 10/18\n\n\n--- PAGE 13 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.39 The given diagram shows the flowchart for a recursive function A(n). Assume that all\nstatements, except for the recursive calls, have O(1) time complexity. If the worst case time\ncomplexity of this function is O(n), then the least possible value (accurate up to two decimal\npositions) of & is\n\nFlowchart for Recursive Function A()\n\nSY\nStart\n\nStart\na(n/2)\n\n|\na(n/2) a(n/2) b4{ a(n/2)\n\nReturn) —{a(w/2)\n\nQ.40 The number of ways in which the numbers 1, 2, 3, 4, 5, 6, 7 can be inserted in an empty binary\nsearch tree, such that the resulting tree has height 6, is\n\nNote: The height of a tree with a single node is 0.\n\nCS(Set B) 11/18\n\n\n--- PAGE 14 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.41 In an adjacency list representation of an undirected simple graph G = (V,E), each edge (u,v)\nhas two adjacency list entries: [v] in the adjacency list of u, and |v] in the adjacency list of\nv. These are called twins of each other. A twin pointer is a pointer from an adjacency list\nentry to its twin. If |E| = m and |V| =n, and the memory size is not a constraint, what is the\ntime complexity of the most efficient algorithm to set the twin pointer in each entry in each\nadjacency list?\n\n(A) @(n7)\n(B) @(n+m)\n(C) @(m’)\n(D) @(n*)\n\nQ.42 Consider the following two statements:\n\nI. If all states of an NFA are accepting states then the language accepted by the NFA is &*.\nII. There exists a regular language A such that for all languages B, AM B is regular.\n\nWhich one of the following is CORRECT?\n(A) Only Lis true\n(B) Only II is true\n(C) Both I and II are true\n(D) Both I and II are false\n\nQ.43 Consider the following languages:\n\nLy = {a\"b\"c\"™ :m,n> 1}\nLy = {a\"b\"c7\" sn > 1}\nWhich one of the following is TRUE?\n(A) Both L; and L» are context-free.\n(B) L is context-free while L» is not context-free.\n(C) Ly is context-free while L; is not context-free.\n\n(D) Neither L; nor L» is context-free.\n\nCS(Set B) 12/18\n\n\n--- PAGE 15 ---\n\nGATE 2016\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.44 Consider the following languages.\n\nLy\n1B)\nL3\n\n{(M) | M takes at least 2016 steps on some input},\n{(M) | M takes at least 2016 steps on all inputs} and\n{(M) | M accepts €},\n\nwhere for each Turing machine M, (M) denotes a specific encoding of M. Which one of the\nfollowing is TRUE?\n\n(A) Ly is recursive and Ly, Lz are not recursive\n\n(B) Ly is recursive and L;,L3 are not recursive\n\n(C) L,,L, are recursive and Lz is not recursive\n\n(D) L1,L2,L3 are recursive\n\nQ.45 Which one of the following grammars is free from left recursion?\n\n(A) S$\nA\nB\n\n(B) S\n\n(C) $\n\n(D) S\n\n—\n—\n—\n\n{ll tld\n\n{tld\n\nAB\nAa\nCc\n\nAb\nBd\ne\n\nAa\nBb\nd\n\nAa\nBd\nAe\n\nCS(Set B)\n\n13/18\n\n\n--- PAGE 16 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.46 A student wrote two context-free grammars G1 and G2 for generating a single C-like array\ndeclaration. The dimension of the array is at least one. For example,\n\nint a[10] [3];\n\nThe grammars use D as the start symbol, and use six terminal symbols int ; id [ ] num.\n\nGrammar G1 Grammar G2\nD—intL; D— intL;\nL—id|E L—-idE\n\nE — num] E — E(num|\nE > num] |E E — (num|\n\nWhich of the grammars correctly generate the declaration mentioned above?\n(A) Both G1 and G2\n(B) Only G1\n(C) Only G2\n(D) Neither G1 nor G2\n\nQ.47 Consider the following processes, with the arrival time and the length of the CPU burst given\nin milliseconds. The scheduling algorithm used is preemptive shortest remaining-time first.\n\nProcess || Arrival Time | Burst Time\nP, 0 10\nPy 3 6\nP3 7 1\nPy 8 3\nThe average turn around time of these processes is milliseconds.\n\nCS(Set B) 14/18\n\n\n--- PAGE 17 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.48 Consider the following two-process synchronization solution.\n\nProcess 0 Process 1\n\nEntry: loop while (turn == 1); Entry: loop while (turn == 0);\n(critical section) (critical section)\n\nExit: turn = 1; Exit: turn = 0;\n\nThe shared variable turn is initialized to zero. Which one of the following is TRUE?\n(A) This is a correct two-process synchronization solution.\n(B) This solution violates mutual exclusion requirement.\n(C) This solution violates progress requirement.\n\n(D) This solution violates bounded wait requirement.\n\nQ.49 Consider a non-negative counting semaphore S. The operation P(S) decrements S, and V(S)\nincrements S. During an execution, 20 P(S) operations and 12 V(S) operations are issued in\n\nsome order. The largest initial value of S for which at least one P(S) operation will remain\nblocked is ;\n\nCS(Set B) 15/18\n\n\n--- PAGE 18 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.50\n\nQ.51\n\nA file system uses an in-memory cache to cache disk blocks. The miss rate of the cache is\nshown in the figure. The latency to read a block from the cache is | ms and to read a block\nfrom the disk is 10 ms. Assume that the cost of checking whether a block exists in the cache\nis negligible. Available cache sizes are in multiples of 10 MB.\n\n90\n80\n70\n60\n50\n40\n30\n20\n10\n\nMiss rate (%)\n\n0 10 20 30 40 5060 70 80 90\nCache size (MB)\n\nThe smallest cache size required to ensure an average read latency of less than 6 ms is\nMB.\n\nConsider the following database schedule with two transactions, 7) and 7).\nS=12(X); r1(X); r2(¥)s wi (X); m1 (VY); w2(X); ar; a2\n\nwhere r;(Z) denotes a read operation by transaction 7; on a variable Z, w;(Z) denotes a write\noperation by 7; on a variable Z and a; denotes an abort by transaction Tj.\n\nWhich one of the following statements about the above schedule is TRUE?\n\n(A) S is non-recoverable\n\n(B) Sis recoverable, but has a cascading abort\n(C) S does not have a cascading abort\n\n(D) S is strict\n\nCS(Set B) 16/18\n\n\n--- PAGE 19 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.52 Consider the following database table named water_schemes :\n\nQ.53\n\nwater_schemes\nscheme_no | district_name | capacity\n1 Ajmer 20\n1 Bikaner 10\n2 Bikaner 10\n3 Bikaner 20\n1 Churu 10\n2 Churu 20\n1 Dungargarh 10\n\nThe number of tuples returned by the following SQL query is\n\nwith total(name, capacity) as\nselect district_name, sum (capacity)\nfrom water_schemes\ngroup by district_name\nwith total_avg(capacity) as\nselect avg (capacity)\nfrom total\nselect name\nfrom total, total_avg\nwhere total.capacity > total_avg.capacity\n\nA network has a data transmission bandwidth of 20 x 10° bits per second. It uses CSMA/CD\nin the MAC layer. The maximum signal propagation time from one node to another node is\n40 microseconds. The minimum size of a frame in the network is bytes.\n\nCS(Set B) 17/18\n\n\n--- PAGE 20 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.54 For the IEEE 802.11 MAC protocol for wireless communication, which of the following\nstatements is/are TRUE?\nI. At least three non-overlapping channels are available for transmissions.\nII. The RTS-CTS mechanism is used for collision detection.\nIl. Unicast frames are ACKed.\n\n(A) AlLT, U,, and I\n(B) I and II only\n(C) I and III only\n(D) I only\n\nQ.55 Consider a 128 x 10° bits/second satellite communication link with one way propagation delay\nof 150 milliseconds. Selective retransmission (repeat) protocol is used on this link to send\ndata with a frame size of 1 kilobyte. Neglect the transmission time of acknowledgement. The\n\nminimum number of bits required for the sequence number field to achieve 100% utilization\nis\n\nCS(Set B) 18/18\n\n\n--- PAGE 21 ---\n\n"
}