{
    "source_pdf": "GATE_2015_CS_SET2.pdf",
    "extracted_text": "GATE 2015 Examination - CS (Set 2, 7 February, Afternoon Session)\n\nGeneral Aptitude\nQ.1\nWe our fniend’s birthday and we how to\nmake it up to him\n\n(A) completely forgot --- don't just know\n(B) forgot completely --- don’t just know\n(C) completely forgot -—- just don't know\n(D) forgot completely --- just don't know\n\nQ. 2\n\nChoose the statement where underlined word 1s used correctly.\n\n(A) The industrialist had a personnel jet.\n\n(B) I wiite my experience in my personnel diary.\n(C) All personnel are being given the day off.\n(D) Being religious is a personnel aspect.\n\nQ. 3\n\nConsider a function f(x) = 1— |x| on-1 < x <1. The value of x at which the function attains a\nmaximum, and the maximum value of the function are:\n\n(A) 0,-1 (B) -1.0 (C) 0.1 (D) -1.2\nQ. 4\n\nA generic term that includes various items of clothing such as a skirt, a pair of trousers and a shirt is\n(A) fabric (B) textile (C) fibre (D) apparel\n\n\n--- PAGE 1 ---\n\nQ.5\n\nBased on the given statements. select the most appropriate option to solve the given question.\nWhat will be the total weight of 10 poles each of same weight?\n\nStatements:\n(I) One fourth of the weight ofa pole is 5 Kg.\n(II) The total weight of these poles is 160 kg more than the total weight of two poles.\n\n(A) Statement I alone is not sufficient.\n\n(B) Statement I alone is not sufficient.\n\n(C) Either I or Il alone is sufficient.\n\n(D) Both statements I and II together are not sufficient.\n\nQ.6\n\nIf the list of letters, P, R. S. T, U is an arithmetic sequence, which of the following are also in\narithmetic sequence?\n\nL 2P, 2R, 2S, 2T, 2U\n\nIL F-38353. 7-33\n\nIi. Pees Ay\n\n(A) Ionly\n\n(B) land I\n(C) and I\n() Iand I\n\nQ.7\n\nFour branches of a company are located at M, N, O. and P. M is north of N at a distance of 4 km: P\nis south of O at a distance of 2 kmz N is southeast of O by 1 km What is the distance between M\nand P in km?\n\n(A) 5.34 (B) 6.74 (C) 28.5 (D) 45.49\n\n\n--- PAGE 2 ---\n\nQ. 8\n\nIn a triangle PQR. PS is the angle bisector of /QPRand / QPS =60°. What is the length of PS?\n\nQ R\ner\nP\n(q+r)\n(A) ~\nqr\n@) (q+r)\n(C) /(q2 +r?)\n(q+r}*\n(D) ae?\n\nQ.9\n\nIf p, q, r, s are distinct integers such that:\n\nf (p,q, t, s) =max (p, q, r, s)\n\ng (p. q, r,s) =mun (Pp, q, r, s)\n\nh (p, q, r, S) =remainder of (p x q) / (r x s) if (p x q) > (r x s) or remainder of (r x s) / (p x q) if\n(rx s)>(pxq)\n\nAlso a function fgh (p, q, r,s) =f (p, q, r, s) x g (p,q, r, s) x h (p, q, 1, s)\nAlso the same operations are valid with two variable functions of the form f (p, q).\nWhat 1s the value of fg (h (2,5,7,3), 4,6,8)?\n\n\n--- PAGE 3 ---\n\nQ. 10\n\nOut of the following four sentences, select the most suitable sentence with respect to grammar and\nusage:\n\n(A) Since the report lacked needed information, it was of no use to them.\n\n(B) The report was useless to them because there were no needed information in it.\n\n(C) Since the report did not contain the needed information, it was not real useful to them\n(D) Since the report lacked needed information, it would not had been useful to them.\n\nComputer Science and Information Technology\n\nQ.1\n\nConsider the following transaction involving two bank accounts x and y .\n\nread(x); x := x - 50; write(x); read(y); y:= y + 50; write(y)\n\nThe constraint that the sum of the accounts x and y should remain constant is that of\n\n(A) Atomicity (B) Consistency\n(C) Isolation (D) Durability\n\nQ. 2\n\nConsider two decision problems Q,,Q 2 such that Q, reduces in polynomial time to 3-SAT and\n\n3-SAT reduces in polynomial time to Q,. Then which one of the following is consistent with the\nabove statement?\n\n(A) Q, 1s in NP, Q, is NP hard.\n(B) Q, 1s in NP, Q, 1s NP hard.\n(C) Both Q,; and Q> are in NP.\n(D) Both Q; and Q, are NP hard.\n\n\n--- PAGE 4 ---\n\nQ. 3\nConsider the following two statements.\n\nS1: Ifa candidate is known to be corrupt, then he will not be elected\nS§2: If a candidate is kind, he will be elected\n\nWhich one of the following statements follows from $1 and S2 as per sound inference rules of\nlogic?\n\n(A) If a person 1s known to be corrupt, he is kind\n\n(B) If a person 1s not known to be corrupt, he is not kind\n(C) If a person is kind, he is not known to be corrupt\n(D) If a person is not kind, he is not known to be corrupt\n\nQ.4\nA software requirements specification (SRS) document should avoid discussing which one of the\nfollowing?\n\n(A) User interface issues\n\n(B) Non-functional requirements\n\n(C) Design specification\n\n(D) Interfaces with third party software\n\nQ.5\n\n4 5\nThe larger of the two eigenvalues of the matrix ; 1s\n\n\n--- PAGE 5 ---\n\nQ.6\n\nWith reference to the B+ tree index of order 1 shown below, the minimum number of nodes\n(including the Root node) that must be fetched in order to satisfy the following query: \"Get all\nrecords with a search key greater than or equal to 7 and less than 15\" is\n\nThe munimum number of JK flip-flops required to construct a synchronous counter with the count\nsequence (0,0,1,1,2,2,3,3,0,0,...) 1s\n\nQ. 8\nA link has a transmission speed of 10° bits/sec. It uses data packets of size 1000 bytes each.\nAssume that the acknowledgment has negligible transmission delay, and that its propagation delay\nis the same as the data propagation delay. Also assume that the processing delays at nodes are\n\nnegligible. The efficiency of the stop-and-wait protocol in this setup is exactly 25%. The value of\nthe one-way propagation delay (in milliseconds) is\n\nQ.9\n\nThe number of divisors of 2100 is\n\nQ. 10\n\nA binary tree T has 20 leaves. The number of nodes in T having two children is .\n\n\n--- PAGE 6 ---\n\nQ. 11\nConsider the following C function.\n\nint fun(int n) {\nint. x=1,k;\nif (n==1) return x;\nfor (k=1; k<n; ++k)\nx = x + fun(k) * fun(n-k);\nreturn x;\n\n}\n\nThe return value of fun (5) is\n\nQ. 12\n\nConsider the basic COCOMO model where E is the effort applied in person-months, D is the\ndevelopment time in chronological months, KLOC is the estimated number of delivered lines of\ncode (in thousands) and a;,,,c,,d, have their usual meanings. The basic COCOMO equations\nare of the form\n\n(A) E = a, (KLOC) exp(b,),D = cy (E) exp(dy )\n(B) D = a, (KLOC) exp(b,), E = c,(D) exp(dy )\n(C) E = ay exp(b,), D = cy (KLOC) exp(d, )\n(D) E = ay exp(d,), D = cy (KLOC) exp(b,)\n\nQ. 13\n\nWhich one of the following statements is NOT correct about HTTP cookies?\n\n(A) A cookie is a piece of code that has the potential to compromise the security of an Internet user\n(B) A cookie gains entry to the user’s work area through an HTTP header\n\n(C) A cookie has an expiry date and time\n\n(D) Cookies can be used to track the browsing pattern of a user at a particular site\n\n\n--- PAGE 7 ---\n\nQ. 14\n\nIn the context of abstract-syntax-tree (AST) and control-flow-graph (CFG), which one of the\nfollowing is TRUE?\n\n(A) In both AST and CFG, let node N be the successor of node Nj. In the input program, the code\ncorresponding to N) is present after the code corresponding to Nj\n\n(B) For any input program, neither AST nor CFG will contain a cycle\n\n(C) The maximum number of successors of a node in an AST and a CFG depends on the input\nprogram\n\n(D) Each node in AST and CFG corresponds to at most one statement in the input program\n\nQ. 15\nConsider the following function written in the C programming language.\n\nvoid foo(char *a) {\nif ( *a && *a != * *‘j{\nfoo (atl);\nputchar (*a);\n\n}\n\nThe output of the above function on input “ABCD EFGH” is\n(A) ABCD EFGH  (B) ABCD (C) HGFE DCBA  (D) DCBA\n\nQ. 16\n\nLet R be the relation on the set of positive integers such that aRb if and only if a and b are distinct\nand have a common divisor other than 1. Which one of the following statements about F 1s true?\n\n(A) R is symmetric and reflexive but not transitive\n\n(B) R is reflexive but not symmetric and not transitive\n(C) R is transitive but not reflexive and not symmetric\n(D) R is symmetric but not reflexive and not transitive\n\nQ.17\n\nConsider a complete binary tree where the left and the nght subtrees of the root are max-heaps. The\nlower bound for the number of operations to convert the tree to a heap is\n\n(A) N(log n) (B) A(n) (C) A(nlogn) (D) O(n?)\n\n\n--- PAGE 8 ---\n\nQ. 18\n\nThe cardinality of the power set of { 0,1, 2, ..., 10 } is\n\nQ. 19\nMatch the following:\nP_ Lexical analysis 1. Graph coloring\nQ. Parsing 2. DFA nunimization\nR. Register allocation 3. Post-order traversal\nS. Expression evaluation 4. Production tree\n(A) P-2,Q-3,R-1,S-4 (B) P-2,Q-1,R-4,S-3\n(C) P-2,Q4, R-1, $-3 (D) P-2,Q-3,R-4, S-1\nQ. 20\n\nIdentify the correct order in which a server process must invoke the function calls accept,\nbind, listen, and recv according to UNIX socket API.\n\n(A) listen, accept, bind, recv (B) bind, listen, accept, reev\n(C) bind, accept, listen, reev (D) accept, listen, bind, recv\nQ. 21\n\nConsider the following statements.\n\nL The complement of every Turing decidable language is Turmg decidable\nI. There exists some language which 1s in NP but is not Turing decidable\nTil. If L is a language in NP, L is Turing decidable\n\nWhich of the above statements is/are true?\n(A) Only II (B) Only II (C) Only I and I (D) Only I and II\n\n\n--- PAGE 9 ---\n\nQ. 22\n\nAn unordered list contains 7 distinct elements. The number of comparisons to find an element in\nthis list that is neither maximum nor minimum 1s\n\n(A) O(n log n) (B) @(n) (C) O(log n) (D) (2)\n\nQ. 23\n\nA system has 6 identical resources and N processes competing for them. Each process can request\natmost 2 resources. Which one of the following values of N could lead to a deadlock?\n\n(A) 1 (B) 2 (C) 3 (D) 4\n\nQ. 24\n\nAssume that for a certain processor, a read request takes 50 nanoseconds on a cache miss and 5\nnanoseconds on a cache hit. Suppose while running a program, it was observed that 80% of the\nprocessor's read requests result in a cache hit. The average read access time im nanoseconds 1s\n\nQ. 25\n\nA computer system implements a 40-bit virtual address, page size of 8 kilobytes, and a 128-entry\ntranslation look-aside buffer (TLB) organized into 32 sets each having four ways. Assume that the\nTLB tag does not store any process id. The minimum length of the TLB tag in bits is P\n\nQ. 26\n\nLet f(x) = x-@/ 3) and A denote the area of the region bounded by f(x) and the X-axis, when x\nvaries from —1 to 1. Which of the following statements is/are TRUE?\n\nI) f 1s continuous in [—1, 1]\nII) f is not bounded in [—1, 1]\nIll) Ais nonzero and finite\n\n(A) I only (B) I only\n(C) I and II only (D) L Mand I\n\n\n--- PAGE 10 ---\n\nQ. 27\n\n4\nPerform the following operations on the matrix | 7 9 105).\n2\n\n3\n\n13\n\n(i) Add the third row to the second row\n(11) Subtract the third column from the first column.\n\nThe determinant of the resultant matrix is\n\nQ. 28\n\nA graph is self-complementary if it is isomorphic to its complement. For all self-complementary\ngraphs on 7 vertices, m 1s\n\n(A) A multiple of 4\n\n(B) Even\n(C) Odd\n\n(D) Congruent to 0 mod 4, or, 1 mod 4.\n\nQ. 29\n\nConsider the intermediate code given below.\n\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\n(7)\n(8)\n(9)\n(10)\n(11)\n\ni=\n\nj =1\n\ntl=5 *i\n\nt2 = tl + j\n\nt3 = 4+ t2\nt4 = t3\na[t4] = -1\n\n, 4 FS\n\nif j<=5 goto (3)\ni=itl\n\nif i<5 goto (2)\n\nThe number of nodes and edges in the control-flow-graph constructed for the above code,\nrespectively, are\n\n(A) Sand7\n\n(B) 6and7 (C) Sand 5 (D) 7and8\n\n\n--- PAGE 11 ---\n\nQ. 30\n\nConsider six memory partitions of sizes 200 KB, 400 KB, 600 KB, 500 KB, 300 KB and 250 KB,\nwhere KB refers to kilobyte. These partitions need to be allotted to four processes of sizes 357 KB,\n210 KB, 468 KB and 491 KB in that order. If the best fit algorithm is used, which partitions are\nNOT allotted to any process?\n\n(A) 200 KB and 300 KB (B) 200 KB and 250 KB\n(C) 250 KB and 300 KB (D) 300 KB and 400 KB\nQ. 31\n\nA Young tableau is a 2D array of integers increasing from left to right and from top to bottom. Any\nunfilled entries are marked with 0, and hence there cannot be any entry to the nght of, or below a\noo. The following Young tableau consists of unique entries.\n\nWhen an element is removed from a Young tableau, other elements should be moved into its place\nso that the resulting table is still a Young tableau (unfilled entries may be filled in with a ©). The\nminimum number of entries (other than 1) to be shifted, to remove 1 from the given Young tableau\nis ,\n\nQ. 32\n\nConsider two relations R;(A.B) with the tuples (1,5), (3,7) and Ro(A,C) = (1,7), (4,9). Assume that\nR(A.B.C) 1s the full natural outer jom of R; and R2. Consider the following tuples of the form\n(A,.B.C): a = (1,5,null), b = (1,null,7), c = (3, null, 9), d = (4,7,null), e = (1,5,7), f= G,7,null), g =\n(4,null,9). Which one of the following statements 1s correct?\n\n(A) R contains a, b, e, f g but not c, d.\n(B) R contains all of a, b, c, d, e, f g.\n(C) R contains e, f g but not a, D.\n\n(D) R contains e but not f g.\n\n\n--- PAGE 12 ---\n\nQ. 33\n\nWhich one of the following hash functions on integers will distribute keys most uniformly over 10\nbuckets numbered 0 to 9 for i ranging from 0 to 2020?\n\n(A) h(i) = i? mod 10\n\n(B) h(i) = i> mod 10\n\n(C) h(i) = (11 « i?) mod 10\n(D) h(i) = (12 * i) mod 10\n\nQ. 34\n\nAssume that the bandwidth for a TCP connection is 1048560 bits /sec. Let ao be the value of RTT in\nmilliseconds (rounded off to the nearest integer) after which the TCP window scale option is\nneeded. Let B be the maximum possible window size with window scale option. Then the values of\na and B are\n\n(A) 63 milliseconds, 65535 x 2’4\n(B) 63 milliseconds, 65535 x 2'°\n(C) 500 milliseconds, 65535 x 24\n(D) 500 milliseconds, 65535 x 21°\n\nQ. 35\n\nConsider the alphabet ¥ = {0, 1}, the null/empty string / and the sets of strings Xo, X1, and X2\ngenerated by the corresponding non-terminals of a regular grammar. Xo, Xi, and X2 are related as\nfollows.\n\nXo = 1 Xj\nX; =0 X;+1X\nX2=0 Xi + {A}\n\nWhich one of the following choices precisely represents the strings in Xp?\n\n(A) 10(0* + (10)*)1 (B) 10(0* + (10)*)*1\n(C) 1(0 + 10)*1 (D) 10(0 + 10)*1 + 110(0 + 10)*1\n\n\n--- PAGE 13 ---\n\nQ. 36\n\nGiven below are some algorithms, and some algorithm design paradigms.\n\n1. Dijkstra’s Shortest Path 1. Divide and Conquer\n\n2. Floyd-Warshall algorithm to compute all ul. Dynamic Programming\npairs shortest path\n\n3. Binary search on a sorted array ui. Greedy design\n\n4. Backtracking search on a graph iv. Depth-first search\n\nv. Breadth-first search\n\nMatch the above algorithms on the left to the corresponding design paradigm they follow.\n(A) 1-4, 2-11, 3-1, 4-v.\n\n(B) 1-111, 2-111, 3-1, 4-v.\n\n(C) lan, 2-11, 3-1, 4-1v.\n\n(D) 1-11, 2-11, 3-1, 4-v-\n\nQ. 37\nThe number of min-terms after minimuzing the following Boolean expression is\n\n[D + AB +AC+ACD + A'C'D]'\n\n\n--- PAGE 14 ---\n\nQ. 38\nConsider the C program below.\n\n#include <stdio.h>\nint *A, stkTop;\n\nint stkFunc(int opcode, int val)\n\n{\n\nstatic int size=0, stkTop=0;\n\nswitch (opcode) {\ncase -l1: size = val; break;\ncase 0: if (stkTop < size) A[stkTopt++] = val; break;\ndefault: if (stkTop) return A[--stkTop];\n\n}\n\nreturn -1;\n\n}\n\nint main()\n\n{\nint B[20]; A = B; stkTop = -1;\n\nstkFunc (-1, 10);\n\nstkFunc (0, 5);\n\nstkFunc ( 0, 10);\n\nprintf (\"Sd\\n\", stkFunc(1, 0) + stkFunc(1, 0));\n}\n\nThe value printed by the above program is\n\n\n--- PAGE 15 ---\n\nQ. 39\n\nThe secant method is used to find the root of an equation f(x) = 0. It is started from two distinct\nestimates x, and x, for the root. It is an iterative procedure involving linear interpolation to a root.\nThe iteration stops if f(x;,) is very small and then x;, 1s the solution. The procedure is given below.\n\nObserve that there is an expression which is missing and is marked by ?. Which is the suitable\nexpression that is to be put in place of ? so that it follows all steps of the secant method?\n\nSecant\nInitialize: Xa, Xp, &, N // & = convergence indicator\n// N = maximum no. of iterations\nfp = £ (Xp)\ni=0\nwhile (i < Nand |f| > 8) do\nb= iti // update counter\nXe = ? // missing expression for\n// intermediate value\nCc ep // reset x,\nXp = Xt // reset xp\nf, = £ (xp) // function value at new x,\nend while\nif |fl > «s then // loop is terminated with i=N\nwrite “Non-convergence”\nelse\nwrite “return x,”\nend if\n\n(Apmis (Ee) ) fis tea)\n(B)x, — (fa-f(xa)) fa / (Xp-Xa)\nGC) xie= (eet) 7 (fe-F (ey)\n(D) xa — (Xp-Xa) fa / (fp-f (xa) )\n\nQ. 40\n\nThe number of onto functions (surjective functions) from set ¥ = {1,2,3,4} to set Y = {a,b,c} is\n\n\n--- PAGE 16 ---\n\nQ. 41\n\nConsider the following routing table at an IP router:\n\n128.96.170.0 255.255.254.0\n128.96.168.0 255.255.254.0 Interface 1\n\n128.96.166.0 255.255.254.0\n128.96.164.0 255.255.252.0\n0.0.0.0 Default\n\nFor each IP address in Group I identify the correct choice of the next hop from Group II using the\nentries from the routing table above.\n\nGroup I Group II\n\ni) 128.96.171.92 a) Interface 0\n\nii) 128.96.167.151 b) Interface 1\n\niit) 128.96.163.151 c) R2\n\niv) 128.96.165.121 d) R3\n\ne) R4\n(A) 1-a, i1-c, in1-e, iv-d (B) 1-a, 11-d, in1-b, iv-e\n(C) 1-b, i1-c, 11-d, 1v-e (D) 1-b, 11-c, 111-e, 1v-d\nQ. 42\n\nConsider a processor with byte-addressable memory. Assume that all registers, including Program\nCounter (PC) and Program Status Word (PSW), are of size 2 bytes. A stack in the main memory is\nunplemented from memory location (0100)16 and it grows upward. The stack pointer (SP) points to\nthe top element of the stack. The current value of SP is (016E) 16. The CALL instruction is of two\n\nwords, the first word is the op-code and the second word is the starting address of the subroutine\n(one word = 2 bytes). The CALL instruction is implemented as follows:\n\ne Store the current value of PC in the stack\ne Store the value of PSW register in the stack\ne Load the starting address of the subroutine in PC\n\nThe content of PC just before the fetch of a CALL instruction is (SFAO) 16. After execution of the\nCALL instruction, the value of the stack pointer is\n\n(A) (016A) 16 (B) (016C) 16 (C) (0170) 16 (D) (0172) 16\n\n\n--- PAGE 17 ---\n\nQ. 43\n\nWhich one of the following assertions conceming code inspection and code walkthrough 1s true?\n\n(A) Code inspection is carried out once the code has been unit tested\n\n(B) Code inspection and code walkthrough are synonyms\n\n(C) Adherence to coding standards is checked during code inspection\n(D) Code walkthrough is usually carried out by an independent test team\n\nQ. 44\nConsider the sequence of machine instructions given below:\n\nMUL R5,RO,R1\nDIV _—R6, R23\nADD R7,R5,R6\nSUB _R8,R7,R4\n\nIn the above sequence, RO to R8 are general purpose registers. In the instructions shown, the first\nregister stores the result of the operation performed on the second and the third registers. This\nsequence of instructions is to be executed in a pipelined instruction processor with the following 4\nstages: (1) Instruction Fetch and Decode (IF), (2) Operand Fetch (OF), (3) Perform Operation (PO)\nand (4) Write back the result (WB). The IF, OF and WB stages take 1 clock cycle each for any\ninstruction. The PO stage takes 1 clock cycle for ADD or SUB instruction, 3 clock cycles for MUL\ninstruction and 5 clock cycles for DIV imstruction. The pipelined processor uses operand\nforwarding from the PO stage to the OF stage. The number of clock cycles taken for the execution\nof the above sequence of instructions is\n\n\n--- PAGE 18 ---\n\nQ. 45\nSuppose you are provided with the following function declaration in the C programmung language.\nint partition(int a[], int n);\n\nThe function treats the first element of a[] as a pivot, and rearranges the array so that all elements\nless than or equal to the pivot is in the left part of the array, and all elements greater than the pivot\nis in the right part. In addition, it moves the pivot so that the pivot is the last element of the left part.\nThe return value is the number of elements in the left part.\n\nThe following partially given function in the C programming language is used to find the k*\"\nsmallest element in an array a[] of size n using the partition function. We assume k = n.\n\nint kth_smallest(int a[], int n, int k)\n\n{\nint left_end = partition(a,n);\n\nif ( left_end+l == k ){\nreturn a[left_end];\n}\n\nif ( left_endt+tl > k ){\n\nreturn kth_smallest ( i\n} else {\n\nreturn kth_smallest ( Fe\n\n}\n}\n\nThe missing argument lists are respectively\n\n(A) (a, left_end, k) and (atleft_end+1, n-left_end-1, k-left_end-1)\n(B) (a, left_end, k) and (a, n-left_end-1, k-left_end-1)\n(C) (atleft_end+1, n-left_end-1, k-left_end-1) and (a, left_end, k)\n(D) (a, n-left_end-1, k-left_end-1) and (a, left_end, k)\n\nQ. 46\n\nConsider a simple checkpointing protocol and the following set of operations in the log.\n\n(start, T4); (write, T4, y, 2, 3); (start, T1); (commit, T4); (write, T1, z, 5, 7);\n(checkpoint);\n(start, T2): (write, T2, x, 1, 9): (commit, T2); (start, T3), (write, T3, z, 7, 2);\n\nIf a crash happens now and the system tries to recover using both undo and redo operations, what\nare the contents of the undo list and the redo list?\n\n(A) Undo: T3, T1; Redo: T2 (B) Undo: T3, T1; Redo: T2, T4\n(C) Undo: none; Redo: T2, T4, T3, T1 (D) Undo: T3, T1, T4; Redo: T2\n\n\n--- PAGE 19 ---\n\nQ. 47\n\nA computer system implements 8 kilobyte pages and a 32-bit physical address space. Each page\ntable entry contams a valid bit, a dirty bit, three permission bits, and the translation. If the\nmaxunum size of the page table of a process is 24 megabytes, the length of the virtual address\nsupported by the system is bits.\n\nQ. 48\n\nA half adder is implemented with XOR and AND gates. A full adder is implemented with two half\nadders and one OR gate. The propagation delay of an XOR gate is twice that of an AND/OR gate.\nThe propagation delay of an AND/OR gate is 1.2 microseconds. A 4-bit npple-carry binary adder is\n\nimplemented by using four full adders. The total propagation time of this 4-bit binary adder in\nmicroseconds 1s\n\nQ. 49\n\nConsider a typical disk that rotates at 15000 rotations per minute (RPM) and has a transfer rate of\n50x10 bytes/sec. If the average seek time of the disk is twice the average rotational delay and the\n\ncontroller’s transfer time is 10 tumes the disk transfer time, the average time (in milliseconds) to\nread or write a 512-byte sector of the disk is .\n\nQ. 50\nIn a connected graph, a bridge is an edge whose removal disconnects a graph. Which one of the\nfollowing statements is true?\n\n(A) A tree has no bridges\n\n(B) A bridge cannot be part of a simple cycle\n\n(C) Every edge of a clique with size > 3 is a bridge (A clique is any complete subgraph of a graph)\n(D) A graph with bridges cannot have a cycle\n\nQ.51\nWhich of the following languages is/are regular?\ni fwxw\"y w, x € {a, b}* and fw), \\x| > 0}, wis the reverse of string w\n\nL,: fab\" |men and m, n> 0}\nLz: {a b'c’ | p, q, r= 0}\n\n(A) L; and L; only (B) L, only (C) L,andL;only (D) L; only\n\n\n--- PAGE 20 ---\n\nQ. 52\n\nHost A sends a UDP datagram containing 8880 bytes of user data to host B over an Ethernet LAN.\nEthemet frames may carry data up to 1500 bytes (i.e. MTU=1500 bytes). Size of UDP header is 8\nbytes and size of IP header is 20 bytes. There is no option field in IP header. How many total\nnumber of IP fragments will be transmitted and what will be the contents of offset field in the last\nfragment?\n\n(A) 6 and 925\n\n(B) 6 and 7400\n(C) 7 and 1110\n(D) 7 and 8880\n\nQ. 53\n\nThe number of states in the minimal deterministic finite automaton corresponding to the regular\nexpression (0 + 1)*(10) 1s\n\nQ. 54\n\nLet X and Y denote the sets containing 2 and 20 distinct objects respectively and Fdenote the set of\nall possible functions defined from X to Y. Let f be randomly chosen from F. The probability of f\nbeing one-to-one is\n\nQ. 55\n\nWhich one of the following well formed formulae is a tautology?\n\n(A) Vx dy R(x, y) @ dy Vx R(x, y)\n\n(B) (Vx [Ay R(x, y) > S(x, y)]) > Vxdy S(x,y)\n\n(C) [Vx dy (P(x, y) — R(x, y)] @ [Wx dy (3 P(x, y) V R(x, y)]\n(D) Vx Vy P(x,y) > Wx Vy PCy, x)\n\n\n--- PAGE 21 ---\n\n"
}