{
    "source_pdf": "GATE_2016_CS_SET1.pdf",
    "extracted_text": "GATE 2016 General Aptitude - GA Set-5\n\nQ. 1- Q. 5 carry one mark each.\n\nQ.1\n\nQ.2\n\nQ.3\n\nQ.4\n\nQ.5\n\nOut of the following four sentences, select the most suitable sentence with respect to grammar and\nusage.\n\n(A) I will not leave the place until the minister does not meet me.\n(B) I will not leave the place until the minister doesn’t meet me.\n(C) Iwill not leave the place until the minister meet me.\n\n(D) I will not leave the place until the minister meets me.\n\nA rewording of something written or spoken is a\n\n(A) paraphrase (B) paradox (C) paradigm (D) paraffin\n\nArchimedes said, “Give me a lever long enough and a fulcrum on which to place it, and I will move\nthe world.”\n\nThe sentence above is an example of a statement.\n(A) figurative (B) collateral\n(C) literal (D) figurine\n\nIf ‘relftaga’ means carefree, ‘otaga’ means careful and ‘fertaga’ means careless, which of the\nfollowing could mean ‘aftercare’?\n\n(A) zentaga (B) tagafer (C) tagazen (D) relffer\n\nA cube is built using 64 cubic blocks of side one unit. After it is built, one cubic block is removed\nfrom every corner of the cube. The resulting surface area of the body (in square units) after the\nremoval is\n\n(A) 56 (B) 64 (C) 72 (D) 96\n\n1/3\n\n\n--- PAGE 1 ---\n\nGATE 2016 General Aptitude - GA Set-5\n\nQ. 6 — Q. 10 carry two marks each.\n\nQ.6\n\nQ.7\n\nQ.8\n\nQ.9\n\nA shaving set company sells 4 different types of razors, Elegance, Smooth, Soft and Executive.\nElegance sells at Rs. 48, Smooth at Rs. 63, Soft at Rs. 78 and Executive at Rs. 173 per piece. The\ntable below shows the numbers of each razor sold in each quarter of a year.\n\nQuarter \\ Product | Elegance Smooth Soft Executive\nQl 27300 20009 17602 9999\nQ2 25222 19392 18445 8942\nQ3 28976 22429 19544 10234\n\nQ4 21012 18229 16595 10109\n\nWhich product contributes the greatest fraction to the revenue of the company in that year?\n\n(A) Elegance (B) Executive (C) Smooth (D) Soft\nIndian currency notes show the denomination indicated in at least seventeen languages. If this is not\nan indication of the nation’s diversity, nothing else is.\n\nWhich of the following can be logically inferred from the above sentences?\n\n(A) India is a country of exactly seventeen languages.\n(B) Linguistic pluralism is the only indicator of a nation’s diversity.\n(C) Indian currency notes have sufficient space for all the Indian languages.\n\n(D) Linguistic pluralism is strong evidence of India’s diversity.\n\nConsider the following statements relating to the level of poker play of four players P, Q, R and S.\n\n1 P always beats Q\nIl. R always beats S\nIl. S loses to P only sometimes\n\nIV. R always loses to Q\nWhich of the following can be logically inferred from the above statements?\n\n(i) P is likely to beat all the three other players\n(ii) S is the absolute worst player in the set\n\n(A) () only (B) (ii) only (C) () and (ii) (D) neither (1) nor (ii)\n\nIf f(x) = 2x7 + 3x —5, which of the following is a factor of f(x)?\n(A) (+8) (B) (x1) (C) (2x-5) (D) (+l)\n\n2/3\n\n\n--- PAGE 2 ---\n\nQ.10\n\nGATE 2016 General Aptitude - GA Set-5\n\nIn a process, the number of cycles to failure decreases exponentially with an increase in load. At a\nload of 80 units, it takes 100 cycles for failure. When the load is halved, it takes 10000 cycles for\nfailure. The load for which the failure will happen in 5000 cycles is .\n\n(A) 40.00 (B) 46.02 (C) 60.01 (D) 92.02\n\nEND OF THE QUESTION PAPER\n\n3/3\n\n\n--- PAGE 3 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ. 1 - Q. 25 carry one mark each.\n\nQ.1 Let p,g,7,s represent the following propositions.\n\np: x € {8,9, 10,11, 12}\nq: xis a composite number\nr: x 1s a perfect square\n\nSs: x 1S a prime number\n\nThe integer x > 2 which satisfies =((p => q) A (—=rvV -s)) is\n\nQ.2 Let a, be the number of n-bit strings that do NOT contain two consecutive 1s. Which one of\nthe following is the recurrence relation for a,,?\n\n(A) an = An—1 +2ap_2\n(B) dy = an—-1 + An-2\n(C) dy = 2dy—1 + Gn—2\n(D) ay = 2dn—| +2an_2\n\nQ.3\nsin(x — 4)\n\nx94 x—-4\n\nQ.4_ A probability density function on the interval [a,1] is given by 1/x” and outside this interval\nthe value of the function is zero. The value of a is\n\nQ.5 Two eigenvalues of a 3 x 3 real matrix P are (2+ /—1) and 3. The determinant of P is\n\nCS(Set A) 1/17\n\n\n--- PAGE 4 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.6 Consider the Boolean operator # with the following properties:\n\nQ.7\n\nQ.8\n\nQ.9\n\nQ.10\n\nx#0 =x, x#1 =X, x#x =0 and x#x = 1. Then x#y is equivalent to\n(A) xy +xy\n(B) xy+xy\n(C) xy +xy\n(D) xy +xy\n\nThe 16-bit 2’s complement representation of an integer is 1111 1111 1111 0101; its decimal\nrepresentation is\n\nWe want to design a synchronous counter that counts the sequence 0-1-0-2-0-3 and then\nrepeats. The minimum number of J-K flip-flops required to implement this counter is\n\nA processor can support a maximum memory of 4 GB, where the memory is word-addressable\n(a word consists of two bytes). The size of the address bus of the processor is at least\nbits.\n\nA queue is implemented using an array such that ENQUEUE and DEQUEUE operations are\nperformed efficiently. Which one of the following statements is CORRECT (x refers to the\nnumber of items in the queue)?\n\n(A) Both operations can be performed in O(1) time\n\n(B) At most one operation can be performed in O(1) time but the worst case time for\nthe other operation will be Q(n)\n\n(C) The worst case time complexity for both operations will be Q(n)\n\n(D) Worst case time complexity for both operations will be Q(logn)\n\nCS(Set A) 2/17\n\n\n--- PAGE 5 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.11 Consider the following directed graph:\n\nThe number of different topological orderings of the vertices of the graph is\n\nQ.12 Consider the following C program.\n\nvoid f(int, short);\nvoid main()\n{\n\nint i = 100;\n\nshort s = 12;\n\nshort *p = &s;\n\ni // call to £()\n\n}\n\nWhich one of the following expressions, when placed in the blank above, will NOT result in\na type checking error?\n\n(A) f(s,*s)\n(B) i = f(i,s)\n(C) f(i,*s)\n(D) £ (i, *p)\n\nCS(Set A) 3/17\n\n\n--- PAGE 6 ---\n\nGATE 2016\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.13 The worst case running times of Insertion sort, Merge sort and Quick sort, respectively, are:\n\n(A) @(nlogn), O(nlogn), and @(n7)\n\n(B) @(n’), O(n7), and @(nlogn)\n(C) @(n’), O(nlogn), and @(nlogn)\n(D) @(n), O(nlogn), and O(n\")\n\nQ.14 Let G be a weighted connected undirected graph with distinct positive edge weights. If every\n\nedge weight is increased by the same value, then which of the following statements is/are\nTRUE?\n\nP:\nQ:\n\nMinimum spanning tree of G does not change\n\nShortest path between any pair of vertices does not change\n(A) P only\n\n(B) Q only\n\n(C) Neither P nor Q\n\n(D) Both P and Q\n\nCS(Set A)\n\nA/17\n\n\n--- PAGE 7 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.15 Consider the following C program.\n\n#include<stdio.h>\nvoid mystery(int *ptra, int *ptrb) {\n\nint *temp;\n\ntemp = ptrb;\nptrb = ptra;\nptra = temp;\n\n}\nint main() {\nint a=2016, b=0, c=4, d=42;\nmystery(&a, &b);\nif (a < c)\nmystery(&c, &a);\nmystery(&a, &d);\nprintf (\"Sd\\n\", a);\n}\n\nThe output of the program is\n\nQ.16 Which of the following languages is generated by the given grammar?\nS —> aS|bS\\e\n\n(A) {a\"b” | n,m > 0}\n\n(B) {w € {a,b}* | whas equal number of a’s and b’s }\n(C) {a\" |n>O0}U{b\" | n>0}U {a\"b\" | n> 0}\n\n(D) {a,b}*\n\nCS(Set A) 5/17\n\n\n--- PAGE 8 ---\n\nGATE 2016\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.17_ Which of the following decision problems are undecidable?\n\nI. Given NFAs Nj and No, is L(N,) OL(N2) = &?\nII. Given a CFG G = (N,z,P,S) and a string x € X*, does x € L(G)?\nIII. Given CFGs G, and Go, is L(G) = L(G2)?\nIV. Given a TM M, is L(M) = ®?\n\n(A) Land IV only\n(B) I and III only\n(C) I and IV only\n(D) I and IV only\n\nQ.18 Which one of the following regular expressions represents the language: the set of all binary\nstrings having two consecutive Os and two consecutive 1s?\n\n(A) (0+1)*0011(0+ 1)* + (0+ 1)*1100(0+4 1)*\n(B) (0+ 1)*(00(0+1)*11 + 11(0+ 1)*00)(0+ 1)*\n(C) (0+ 1)*00(0+ 1)* + (0+ 1)*11(0+1)*\n\n(D) 00(0+ 1)*11+11(0+1)*00\n\nQ.19 Consider the following code segment.\n\n<q XN EX\nI\nx tx KX G\n\nty\nVi\nW;\nZi\nYr\n\nThe minimum number of total variables required to convert the above code segment to static\n\nsingle assignment form is\n\nCS(Set A)\n\n6/17\n\n\n--- PAGE 9 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.20 Consider an arbitrary set of CPU-bound processes with unequal CPU burst lengths\nsubmitted at the same time to a computer system. Which one of the following process\nscheduling algorithms would minimize the average waiting time in the ready queue?\n\n(A) Shortest remaining time first\n(B) Round-robin with time quantum less than the shortest CPU burst\n\n(C) Uniform random\n\n(D) Highest priority first with priority proportional to CPU burst length\n\nQ.21 Which of the following is NOT a superkey in a relational schema with attributes\nV,W, X,Y, Z and primary key V Y?\n\n(A) VXYZ\n(B) VWXZ\n(C) VWXY\n(D) VWXYZ\n\nQ.22 Which one of the following is NOT a part of the ACID properties of database transactions?\n(A) Atomicity\n(B) Consistency\n(C) Isolation\n(D) Deadlock-freedom\n\nCS(Set A) TNT\n\n\n--- PAGE 10 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.23 A database of research articles in a journal uses the following schema.\n(VOLUME, NUMBER, STARTPAGE, ENDPAGE, TITLE, YEAR, PRICE)\n\nThe primary key is (VOLUME, NUMBER, STARTPAGE, ENDPAGE) and the following\nfunctional dependencies exist in the schema.\n\n(VOLUME, NUMBER, STARTPAGE, ENDPAGE) —> TITLE\n(VOLUME, NUMBER) —+ YEAR\n(VOLUME, NUMBER, STARTPAGE, ENDPAGE) -— > PRICE\n\nThe database is redesigned to use the following schemas.\n\n(VOLUME, NUMBER, STARTPAGE, ENDPAGE, TITLE, PRICE)\n(VOLUME, NUMBER, YEAR)\n\nWhich is the weakest normal form that the new database satisfies, but the old one does not?\n(A) INF\n(B) 2NF\n(C) 3NF\n(D) BCNF\n\nQ.24 Which one of the following protocols is NOT used to resolve one form of address to another\none?\n\n(A) DNS\n(B) ARP\n(C) DHCP\n(D) RARP\n\nQ.25 Which of the following is/are example(s) of stateful application layer protocols?\n(i) HTTP\n(ii) FTP\n(iii) TCP\n(iv) POP3\n\n(A) (i) and (i1) only\n(B) (ii) and (itt) only\n(C) (ii) and (iv) only\n(D) (iv) only\n\nCS(Set A) 8/17\n\n\n--- PAGE 11 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ. 26 - Q. 55 carry two marks each.\n\nQ.26\n\nQ.27\n\nQ.28\n\nQ.29\n\nThe coefficient of x!? in (x° +x4++2° +x©+---)? is\n\nConsider the recurrence relation a, = 8, a, = 6n? +2n+a,_,. Let agg = K x 10+. The value\nof K is\n\nA function f : Nt — N*, defined on the set of positive integers N*, satisfies the following\nproperties:\n\nf(n) =f(n/2) — ifnis even\nf(n) =f(n+5)  ifnis odd\n\nLet R= {i|4j: f(j) =i} be the set of distinct values that f takes. The maximum possible size\nof Ris\n\nConsider the following experiment.\n\nStep 1. Flip a fair coin twice.\nStep 2. If the outcomes are (TAILS, HEADS) then output Y and stop.\n\nStep 3. If the outcomes are either (HEADS, HEADS) or (HEADS, TAILS), then output N and\nstop.\n\nStep 4. If the outcomes are (TAILS, TAILS), then go to Step 1.\n\nThe probability that the output of the experiment is Y is (up to two decimal places)\n\nCS(Set A) 9/17\n\n\n--- PAGE 12 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.30 Consider the two cascaded 2-to-1 multiplexers as shown in the figure.\n\nThe minimal sum of products form of the output X is\n(A) PO+POR\n(B) PO+OR\n(C) PQ+POR\n(D) OR+POR\n\nQ.31 The size of the data count register of a DMA controller is 16 bits. The processor needs to\ntransfer a file of 29,154 kilobytes from disk to main memory. The memory is byte addressable.\nThe minimum number of times the DMA controller needs to get the control of the system bus\nfrom the processor to transfer the file from the disk to main memory is\n\nQ.32 The stage delays in a 4-stage pipeline are 800, 500, 400 and 300 picoseconds. The first\nstage (with delay 800 picoseconds) is replaced with a functionally equivalent design involving\ntwo stages with respective delays 600 and 350 picoseconds. The throughput increase of the\npipeline is percent.\n\nQ.33 Consider a carry lookahead adder for adding two n-bit integers, built using gates of fan-in at\nmost two. The time to perform addition using this adder is\n\n(A) O(1)\n\n(B) O(log(n))\n(C) O( Vn)\n(D) O(n)\n\nCS(Set A) 10/17\n\n\n--- PAGE 13 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.34 The following function computes the maximum value contained in an integer array p[] of size\nn (n >= 1).\n\nint max(int *p, int n) {\nint a=0, b=n-1;\n\nwhile ( ) {\nif (p[a] <= p[b]) { a = atl; }\nelse { b = b-1; }\n\n}\n\nreturn p[al];\n\n}\n\nThe missing loop condition is\n\n(A) a !=n\n(B) b != 0\n(C) b > (a + 1)\n(D) b !=a\n\nQ.35 What will be the output of the following C program?\n\nvoid count (int n) {\nstatic int d=1;\n\nprintf(\"%d \", n);\nprintf(\"%d \", d);\nd+t+;\nif(n>1) count (n-1);\nprintf(\"%d \", d);\n\n}\n\nvoid main() {\ncount (3);\n\n}\n(A) 312213444\n(B) 312111222\n(C) 3122134\n(D) 3121112\n\nCS(Set A) 11/17\n\n\n--- PAGE 14 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.36\n\nQ.37\n\nQ.38\n\nQ.39\n\nWhat will be the output of the following pseudo-code when parameters are passed by reference\nand dynamic scoping is assumed?\n\na=3;\n\nvoid n(x) {x = x * a; print(x);}\n\nvoid m(y) {a =1; a=y - a; n(a); print(a);}\nvoid main() {m(a);}\n\n(A) 6, 2\n\n(B) 6, 6\n\n(C) 4,2\n\n(D) 4,4\n\nAn operator delete(i) for a binary heap data structure is to be designed to delete the item in\nthe i-th node. Assume that the heap is implemented in an array and i refers to the i-th index\nof the array. If the heap tree has depth d (number of edges on the path from the root to the\nfarthest leaf), then what is the time complexity to re-fix the heap efficiently after the removal\nof the element?\n\n(A) O(1)\n\n(B) O(d) but not O(1)\n(C) O(2¢) but not O(d)\n(D) O(d 2) but not O(27)\n\nConsider the weighted undirected graph with 4 vertices, where the weight of edge {i,j} is\ngiven by the entry Wj; in the matrix W.\n\nNoNnN ©\nanon\nx ON\nor OM\n\nThe largest possible integer value of x, for which at least one shortest path between some pair\nof vertices will contain the edge with weight x is\n\nLet G be a complete undirected graph on 4 vertices, having 6 edges with weights being 1, 2,\n3, 4, 5, and 6. The maximum possible weight that a minimum weight spanning tree of G can\nhave is\n\nCS(Set A) 12/17\n\n\n--- PAGE 15 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.40 G= (V,E) is an undirected simple graph in which each edge has a distinct weight, and e is a\n\nQ.41\n\nQ.42\n\nparticular edge of G. Which of the following statements about the minimum spanning trees\n(MSTs) of G is/are TRUE?\n\nI. If e is the lightest edge of some cycle in G, then every MST of G includes e\n\nII. If e is the heaviest edge of some cycle in G, then every MST of G excludes e\n\n(A) Ionly (B) Ilonly (C) bothIandII (D) neither I nor I\n\nLet Q denote a queue containing sixteen numbers and S be an empty stack. Head(Q) returns\nthe element at the head of the queue Q without removing it from Q. Similarly Top(S) returns\nthe element at the top of S without removing it from S. Consider the algorithm given below.\n\nwhile QO is not Empty do\n\nif S is Empty OR Top(S) < Head(Q) then\nx := Dequeue(Q);\n\nPush(S,x);\n\nelse\n\nx := Pop(S);\n\nEnqueue(Q,x);\n\nend\nend\n\nThe maximum possible number of iterations of the while loop in the algorithm is\n\nConsider the following context-free grammars:\nG,: S— aS|B, B > b\\bB\nG2: S— aA|bB, A > aA|B\\e, B > bBle\nWhich one of the following pairs of languages is generated by G; and Go, respectively?\n(A) {a\"b\"|m > 0 orn > 0} and {a’\"b\"|m > 0 and n > 0}\n(B) {a’\"b\"|m > 0 and n > 0} and {a’\"b\"|m > 0 or n > 0}\n(C) {a’\"b\"|m > 0 orn > 0} and {a\"b\"|m > 0 and n > 0}\n(D) {a\"b\"|m > 0 and n > 0} and {a\"b\"|m > 0 orn > O}\n\nCS(Set A) 13/17\n\n\n--- PAGE 16 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.43 Consider the transition diagram of a PDA given below with input alphabet © = {a,b} and\nstack alphabet [ = {X,Z}. Z is the initial stack symbol. Let L denote the language accepted\nby the PDA.\n\na,X /XX\na,Z/XZ b,X/e\n\n_ b,X /é se €,Z/Z ©)\n\nWhich one of the following is TRUE?\n(A) L= {a\"b\"|n > 0} and is not accepted by any finite automata\n(B) L= {a\"|n>0}U {a\"b\"|n > 0} and is not accepted by any deterministic PDA\n(C) Lis not accepted by any Turing machine that halts on every input\n\n(D) L= {a\"|n > 0}U{a\"b\"|n > 0} and is deterministic context-free\n\nQ.44 Let X be a recursive language and Y be a recursively enumerable but not recursive language.\nLet W and Z be two languages such that Y reduces to W, and Z reduces to X (reduction means\nthe standard many-one reduction). Which one of the following statements is TRUE?\n\n(A) W can be recursively enumerable and Z is recursive.\n(B) W can be recursive and Z is recursively enumerable.\n(C) W is not recursively enumerable and Z is recursive.\n\n(D) W is not recursively enumerable and Z is not recursive.\n\nQ.45 The attributes of three arithmetic operators in some programming language are given below.\n\nOperator Precedence Associativity Arity\n\n+ High Left Binary\n— Medium Right Binary\n* Low Left Binary\n\nThe value of the expression 2 —5-+ 1—7 «3 in this language is\n\nCS(Set A) 14/17\n\n\n--- PAGE 17 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.46\n\nQ.47\n\nQ.48\n\nQ.49\n\nConsider the following Syntax Directed Translation Scheme (SDTS), with non-terminals\n{S, A} and terminals {a, b}.\n\nS — aA _ {print l }\n\nSs — a { print 2 }\n\nA — Sb { print3 }\n\nUsing the above SDTS, the output printed by a bottom-up parser, for the input aab is:\n(A) 132\n(B) 223\n(C) 231\n\n(D) syntax error\n\nConsider a computer system with 40-bit virtual addressing and page size of sixteen\nkilobytes. If the computer system has a one-level page table per process and each page table\nentry requires 48 bits, then the size of the per-process page table is megabytes.\n\nConsider a disk queue with requests for I/O to blocks on cylinders 47, 38, 121, 191, 87, 11,\n92, 10. The C-LOOK scheduling algorithm is used. The head is initially at cylinder number\n63, moving towards larger cylinder numbers on its servicing pass. The cylinders are numbered\nfrom 0 to 199. The total head movement (in number of cylinders) incurred while servicing\nthese requests is\n\nConsider a computer system with ten physical page frames. The system is provided with\nan access sequence (d1,d2,...,420,41,42,---,420), where each qj; is a distinct virtual page\nnumber. The difference in the number of page faults between the last-in-first-out page\nreplacement policy and the optimal page replacement policy is\n\nCS(Set A) 15/17\n\n\n--- PAGE 18 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.50 Consider the following proposed solution for the critical section problem. There are n\nprocesses: Po...P,-;. In the code, function pmax returns an integer not smaller than any\nof its arguments. For all 7, t [i] is initialized to zero.\n\nCode for P;:\n\ndo {\nc[iJ=l; tli] = pmax(t[0],...,t{n-1])+1; c[i]=0;\nfor every j # i in {0,...,n-1} {\n\nwhile (c[j]);\n\nwhile (t[j] != 0 && t[j]<=t[i]);\n\n}\n\nCritical Section;\n\nt[i]=0;\n\nRemainder Section;\n} while (true);\n\nWhich one of the following is TRUE about the above solution?\n(A) At most one process can be in the critical section at any time\n(B) The bounded wait condition is satisfied\n(C) The progress condition is satisfied\n\n(D) It cannot cause a deadlock\n\nQ.51 Consider the following two phase locking protocol. Suppose a transaction T accesses (for\n\nread or write operations), a certain set of objects {O1,...,O}. This is done in the following\nmanner:\nStep 1. T acquires exclusive locks to O;, ..., O, in increasing order of their addresses.\n\nStep 2. The required operations are performed.\n\nStep 3. All locks are released.\n\nThis protocol will\n(A) guarantee serializability and deadlock-freedom\n(B) guarantee neither serializability nor deadlock-freedom\n(C) guarantee serializability but not deadlock-freedom\n\n(D) guarantee deadlock-freedom but not serializability\n\nCS(Set A) 16/17\n\n\n--- PAGE 19 ---\n\nGATE 2016 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.52\n\nQ.53\n\nQ.54\n\nQ.55\n\nConsider that B wants to send a message m that is digitally signed to A. Let the pair of private\nand public keys for A and B be denoted by K, and K{ for x = A,B, respectively. Let K,(m)\nrepresent the operation of encrypting m with a key K, and H(m) represent the message digest.\nWhich one of the following indicates the CORRECT way of sending the message m along\nwith the digital signature to A?\n\n(A) {m,Kgz (H(m))} (B) {m,Kg(H(m))}  (C) {m,Kq(H(m))} (D) {m,K{(m)}\n\nAn IP datagram of size 1000 bytes arrives at a router. The router has to forward this packet on\na link whose MTU (maximum transmission unit) is 100 bytes. Assume that the size of the IP\nheader is 20 bytes.\n\nThe number of fragments that the IP datagram will be divided into for transmission is\n\nFor a host machine that uses the token bucket algorithm for congestion control, the token\nbucket has a capacity of 1 megabyte and the maximum output rate is 20 megabytes per second.\nTokens arrive at a rate to sustain output at a rate of 10 megabytes per second. The token bucket\nis currently full and the machine needs to send 12 megabytes of data. The minimum time\nrequired to transmit the data is seconds.\n\nA sender uses the Stop-and-Wait ARQ protocol for reliable transmission of frames. Frames\nare of size 1000 bytes and the transmission rate at the sender is 80 Kbps (1Kbps = 1000\nbits/second). Size of an acknowledgement is 100 bytes and the transmission rate at the receiver\nis 8 Kbps. The one-way propagation delay is 100 milliseconds.\n\nAssuming no frame is lost, the sender throughput is bytes/second.\n\nCS(Set A) 17/17\n\n\n--- PAGE 20 ---\n\n"
}