{
    "source_pdf": "GATE_2014_CS_SET3.pdf",
    "extracted_text": "GATE 2014: General Instructions during Examination\n\n1. Total duration of the GATE examination is 180 minutes.\n\n2. The clock will be set at the server. The countdown timer at the top right corner of\nscreen will display the remaining time available for you to complete the examination.\nWhen the timer reaches zero, the examination will end by itself. You need not\nterminate the examination or submit your paper.\n\n3. Any useful data required for your paper can be viewed by clicking on the Useful\nCommon Data button that appears on the screen.\n\n4. Use the scribble pad provided to you for any rough work. Submit the scribble pad at\nthe end of the examination.\n\n5. You are allowed to use a non-programmable type calculator, however, sharing of\ncalculators is not allowed.\n\n6. The Question Palette displayed on the right side of screen will show the status of\neach question using one of the following symbols:\n\n1 | You have not visited the question yet.\nYou have not answered the question.\na You have answered the question.\n@ You have NOT answered the question, but have marked the question for review.\n\nal\n© You have answered the question, but marked it for review.\n\nThe Marked for Review status for a question simply indicates that you would like to look at\nthat question again. If a question is answered, but marked for review, then the answer will\nbe considered for evaluation unless the status is modified by the candidate.\n\nNavigating to a Question :\n\n7. To answer a question, do the following:\n\na. Click on the question number in the Question Palette to go to that question\ndirectly.\n\nb. Select an answer for a multiple choice type question by clicking on the bubble\nplaced before the 4 choices, namely A, B, C and D. Use the virtual numeric\nkeypad to enter a number as answer for a numerical type question.\n\nc. Click on Save & Next to save your answer for the current question and then go\nto the next question.\n\nd. Click on Mark for Review & Next to save your answer for the current question\nand also mark it for review, and then go to the next question.\n\n\n--- PAGE 1 ---\n\nCaution: Note that your answer for the current question will not be saved, if you navigate\nto another question directly by clicking on a question number without saving the answer to\nthe previous question.\n\nYou can view all the questions by clicking on the Question Paper button. This feature is\nprovided, so that if you want you can just see the entire question paper at a glance.\n\nAnswering a Question :\n\n8. Procedure for answering a multiple choice (MCQ) type question:\na. Choose one answer from the 4 options (A,B,C,D) given below the question,\nclick on the bubble placed before the chosen option.\nb. To deselect your chosen answer, click on the bubble of the chosen option again\nor click on the Clear Response button.\nc. To change your chosen answer, click on the bubble of another option.\nd. To save your answer, you MUST click on the Save & Next button.\n\n9. Procedure for answering a numerical answer type question:\na. To enter a number as your answer, use the virtual numerical keypad.\nb. A fraction (e.g. -0.3 or -.3) can be entered as an answer with or without '0'\nbefore the decimal point. As many as four decimal points, e.g. 12.5435 or\n0.003 or -932.6711 or 12.82 can be entered.\nc. Toclear your answer, click on the Clear Response button.\nd. To save your answer, you MUST click on the Save & Next button\n10. To mark a question for review, click on the Mark for Review & Next button. /f an\n\nanswer is selected (for MCQ) or entered (for numerical answer type) for a question\nthat is Marked for Review, that answer will be considered in the evaluation unless\nthe status is modified by the candidate.\n\n11. To change your answer to a question that has already been answered, first select\nthat question for answering and then follow the procedure for answering that type of\nquestion.\n\n12. Note that ONLY Questions for which answers are saved or marked for review after\nanswering will be considered for evaluation.\n\nChoosing a Section :\n\n13. Sections in this question paper are displayed on the top bar of the screen. Questions\nin a Section can be viewed by clicking on the name of that Section. The Section you\nare currently viewing will be highlighted.\n\n14. A checkbox is displayed for every optional Section, if any, in the Question Paper. To\nselect the optional Section for answering, click on the checkbox for that Section.\n\n15. If the checkbox for an optional Section is not selected, the Save & Next button and\nthe Mark for Review & Next button will NOT be enabled for that Section. You will\n\n\n--- PAGE 2 ---\n\nonly be able to see questions in this Section, but you will not be able to answer\nquestions in the Section.\n\n16. After clicking the Save & Next button for the last question in a Section, you will\nautomatically be taken to the first question of the next Section in sequence.\n\n17. You can move the mouse cursor over the name of a Section to view the answering\nstatus for that Section.\n\nChanging the Optional Section :\n\n18. After answering the chosen optional Section, partially or completely, you can change\nthe optional Section by selecting the checkbox for a new Section that you want to\nattempt. A warning message will appear along with a table showing the number of\nquestions answered in each of the previously chosen optional Sections and a\ncheckbox against each of these Sections. Click on a checkbox against a Section that\nyou want to reset and then click on the RESET button. Note that RESETTING a Section\nwill DELETE all the answers for questions in that Section. Hence, if you think that you\nmay want to select this Section again later, you will have to note down your answers\nfor questions in that Section. If you do not want to reset the Section and want to\ncontinue answering the previously chosen optional Section, then click on the BACK\nbutton.\n\n19. If you deselect the checkbox for an optional Section in the top bar, the following\nwarning message will appear: \"Deselecting the checkbox will DELETE all the answers\nfor questions in this Section. Do you want to deselect this Section?” If you want to\ndeselect, click on the RESET button. If you do not want to deselect, click on the BACK\nbutton.\n\n20. You can shuffle between different Sections or change the optional Sections any\nnumber of times.\n\n\n--- PAGE 3 ---\n\nGATE 2014 Examination\n\nCS: Computer Science & Information Technology\n\nDuration: 180 minutes Maximum Marks: 100\n\nRead the following instructions carefully.\n\n10.\n\n11.\n\n12.\n13.\n\nTo login, enter your Registration Number and password provided to you. Kindly go through the various\nsymbols used in the test and understand their meaning before you start the examination.\n\nOnce you login and after the start of the examination, you can view all the questions in the question\npaper, by clicking on the View All Questions button in the screen.\n\nThis question paper consists of 2 sections, General Aptitude (GA) for 15 marks and the subject\nspecific GATE paper for 85 marks. Both these sections are compulsory.\n\nThe GA section consists of 10 questions. Question numbers | to 5 are of 1-mark each, while question\nnumbers 6 to 10 are of 2-mark each.\n\nThe subject specific GATE paper section consists of 55 questions, out of which question numbers 1 to\n25 are of 1-mark each, while question numbers 26 to 55 are of 2-mark each.\n\nDepending upon the GATE paper, there may be useful common data that may be required for\nanswering the questions. If the paper has such useful data, the same can be viewed by clicking on the\nUseful Common Data button that appears at the top, right hand side of the screen.\n\nThe computer allotted to you at the examination center runs specialized software that permits only one\nanswer to be selected for multiple-choice questions using a mouse and to enter a suitable number for\nthe numerical answer type questions using the virtual keyboard and mouse.\n\nYour answers shall be updated and saved on a server periodically and also at the end of the\nexamination. The examination will stop automatically at the end of 180 minutes.\n\nIn each paper a candidate can answer a total of 65 questions carrying 100 marks.\n\nThe question paper may consist of questions of multiple choice type (MCQ) and numerical answer\ntype.\n\nMultiple choice type questions will have four choices against A, B, C, D, out of which only ONE is the\ncorrect answer. The candidate has to choose the correct answer by clicking on the bubble (©) placed\nbefore the choice.\n\nFor numerical answer type questions, each question will have a numerical answer and there will not be\nany choices. For these questions, the answer should be enteredby using the virtual keyboard that\nappears on the monitor and the mouse.\n\nAll questions that are not attempted will result in zero marks. However, wrong answers for multiple\nchoice type questions (MCQ) will result in NEGATIVE marks. For all MCQ questions a wrong\nanswer will result in deduction of 4 marks for a 1-mark question and % marks for a 2-mark question.\nThere is NO NEGATIVE MARKING for questions of NUMERICAL ANSWER TYPE.\n\nNon-programmable type Calculator is allowed. Charts, graph sheets, and mathematical tables are NOT\nallowed in the Examination Hall. You must use the Scribble pad provided to you at the examination\ncentre for all your rough work. The Scribble Pad has to be returned at the end of the examination.\n\nDeclaration by the candidate:\n\n“I have read and understood all the above instructions. I have also read and understood clearly the\ninstructions given on the admit card and shall follow the same. I also understand that in case I am found to\nviolate any of these instructions, my candidature is liable to be cancelled. I also confirm that at the start of\nthe examination all the computer hardware allotted to me are in proper working condition’.\n\n\n--- PAGE 4 ---\n\nGATE 2014 SET- 9 General Aptitude -GA\n\nQ. 1-Q. 5 carry one mark each.\n\nQ.1\n\nQ.2\n\nQ.3\n\nQ.4\n\nQ.5\n\nWhile trying to collect an envelope from under the table, Mr. X fell down and\n\nI II sagt\nwas losing consciousness.\nIV\nWhich one of the above underlined parts of the sentence is NOT appropriate?\n(A) I (B) II (C) Ill (D) IV\nIf she how to calibrate the instrument, she done the\nexperiment.\n(A) knows, will have (B) knew, had\n(C) had known, could have (D) should have known, would have\n\nChoose the word that is opposite in meaning to the word “coherent”.\n\n(A) sticky (B) well-connected (C) rambling (D) friendly\nWhich number does not belong in the series below?\n\n2,5, 10, 17, 26, 37, 50, 64\n\n(A) 17 (B) 37 (C) 64 (D) 26\n\nThe table below has question-wise data on the performance of students in an examination. The\nmarks for each question are also listed. There is ‘no negative.or partial marking in the examination.\n\nNot\nQNo. Attempted\n1\n2\n3\n\nWhat is the average of the marks obtained by the class in the examination?\n\n(A) 1.34 (B) 1.74 (C) 3.02 (D) 3.91\n\nQ. 6 - Q. 10 carry two.marks each.\n\nQ.6\n\nGA\n\nA dance programme is scheduled for 10.00 a.m. Some students are participating in the programme\nand they,meed to come an hour earlier than the start of the event. These students should be\naccompanied by a parent. Other students and parents should come in time for the programme. The\ninstruction you think that is appropriate for this is\n\n(A),“Students should come at 9.00 a.m. and parents should come at 10.00 a.m.\n\n(B) Participating students should come at 9.00 a.m. accompanied by a parent, and other parents\nand students should come by 10.00 a.m.\n\n(C) Students who are not participating should come by 10.00 a.m. and they should not bring their\nparents. Participating students should come at 9.00 a.m.\n\n(D) Participating students should come before 9.00 a.m. Parents who accompany them should\ncome at 9.00 a.m. All others should come at 10.00 a.m.\n\n1/2\n\n\n--- PAGE 5 ---\n\nGATE 2014 SET- 9 General Aptitude -GA\n\nQ.7\n\nQ.8\n\nQ.9\n\nBy the beginning of the 20\" century, several hypotheses were being proposed, suggesting a\nparadigm shift in our understanding of the universe. However, the clinching evidence was provided\nby experimental measurements of the position of a star which was directly behind our sun.\n\nWhich of the following inference(s) may be drawn from the above passage?\n\n(i) Our understanding of the universe changes based on the positions of stars\n(ii) Paradigm shifts usually occur at the beginning of centuries\n\n(iii) Stars are important objects in the universe\n\n(iv) Experimental evidence was important in confirming this paradigm shift\n\n(A) (i), (ai) and (iv) (B) (iit) only (C) (i) and (iv) (D) (iv) only\n\nThe Gross Domestic Product (GDP) in Rupees grew at 7% during 2012-2013. For international\ncomparison, the GDP is compared in US Dollars (USD) after conversion{based ony the, market\nexchange rate. During the period 2012-2013 the exchange rate for the: USD increased from\nRs. 50/ USD to Rs. 60/ USD. India’s GDP in USD during the period 2012-2013\n\n(A) increased by 5 % (B) decreased by 43%\n(C) decreased by 20% (D) decreased by 11%\n\nThe ratio of male to female students in a college for five,years is plotted in the following line graph.\nIf the number of female students in 2011 and 2012 is equal; what is the ratio of male students in\n2012 to male students in 2011?\n\n\\\n\non\n~~\n=\na\na\n=\n~\nwe\na\nLis\n=\na\nPra\noO\n_\nAJ\no\n&\n+\no\n#\n—_\nLy\n=\n\n2008 2009 2010 2011\n\n(A) 1:1 (B) 2:1 (C) 1.5:1 (D) 2.5:1\n\nQ.10 Consider the equation: (7526)g — (Y)s = (4364)g , where (X)n stands for X to the base N. Find Y.\n\nGA\n\n(A) 1634 (B) 1737 (C) 3142 (D) 3162\n\nEND OF THE QUESTION PAPER\n\n2/2\n\n\n--- PAGE 6 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ. 1 - Q. 25 carry one mark each.\n\nQ.1\n\nQ.2\n\nQ3\n\nQ.4\n\nCS\n\nConsider the following statements:\n\nP: Good mobile phones are not cheap\nQ: Cheap mobile phones are not good\n\nL: P implies Q\nM: Q implies P\nN: P is equivalent to Q\n\nWhich one of the following about L, M, and N is CORRECT?\n\n(A) Only L is TRUE.\n(B) Only M is TRUE.\n(C) Only N is TRUE.\n(D) L, M and N are TRUE.\n\nLet X and Y be finite sets and f:X — Y be a functions Which one of the following statements is\nTRUE?\n\n(A) For any subsets A and B of X, |f(AU B)| =|fF(AI +4 |F@B)|\n\n(B) For any subsets A and B of X, f(AN B) = f(A) n f(B)\n\n(C) For any subsets A and B of X, |f (A MB)| = min {| f(A)|, |F(B) |}\n(D) For any subsets S and T of Y, f-1(S AT) = f-1(S)n f-1(T)\n\nLet G be a group with 15 elements. Let L/be a subgroup of G. It is known that L + G and that the\nsize of L is at least 4. The size of Lis\n\nWhich one of the following statements is TRUE about every n Xn matrix with only real\neigenvalues?\n\n(A) If the trace of the matrix is positive and the determinant of the matrix is negative, at least one\nof its eigenvalues is negative.\n\n(B)xIf the trace of the matrix is positive, all its eigenvalues are positive.\n\n(C) If the determinant of the matrix is positive, all its eigenvalues are positive.\n\n(D) If the product of the trace and determinant of the matrix is positive, all its eigenvalues are\n\npositive.\n\n1/14\n\n\n--- PAGE 7 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.5 If V; and V are 4-dimensional subspaces of a 6-dimensional vector space V, then the smallest\npossible dimension of V;M V> is\n\nQ6 If i\" |x sinx| dx = kr, then the value of k is equal to\n\nQ.7 Consider the following minterm expression for F:\nF (P,Q,R,S) = >, 0, 2,5, 7,8, 10, 13,15\nThe minterms 2, 7, 8 and 13 are ‘do not care’ terms. The minimal sum-of-products formfor F is\n\n(A) QS +0S\n(B) 05+ QS\n(C) ORS + ORS + QRS + QRS\n(D) POS + Pas + PQS + POS\n\nQ.8 Consider the following combinational function block involving four Boolean variables x, y, a,\nb where x, a, Db are inputs and y is the output.\n\n£ (x, y, a, b)\n\n{\nif (x is 1) y =a;\nelse y = Db;\n\n}\n\nWhich one of the following digital logic blocks is the most suitable for implementing this function?\n\n(A) Full adder (B) Priority encoder (C) Multiplexor (D) Flip-flop\n\nQ.9 Consider the,following processors (ns stands for nanoseconds). Assume that the pipeline registers\nhave zero latency.\n\nP1: Four-stage pipeline with stage latencies | ns, 2 ns, 2 ns, | ns.\n\nP2: Four-stage pipeline with stage latencies | ns, 1.5 ns, 1.5 ns, 1.5 ns.\n\nP37 Five-stage pipeline with stage latencies 0.5 ns, 1 ns, | ns, 0.6 ns, 1 ns.\nP4: Five-stage pipeline with stage latencies 0.5 ns, 0.5 ns, 1 ns, 1 ns, 1.1 ns.\nWhich processor has the highest peak clock frequency?\n\n(A) PI (B) P2 (C) P3 (D) P4\n\nCS 2/14\n\n\n--- PAGE 8 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.10 Let A be a square matrix of size n X n. Consider the following pseudocode. What is the expected\n\noutput?\nC = 100;\nfor i= 1 ton do\nfor j = 1 ton do\n{\n\nTemp = A[i][j] + C;\nAli] [j]l= Aljl] fil;\nA[j] [il = Temp - C;\n\n}\n\nfor i= 1 ton do\nfor j = 1 ton do\noutput (A[i] [j]);\n\n(A) The matrix A itself\n\n(B) Transpose of the matrix A\n\n(C) Adding 100 to the upper diagonal elements and subtracting 100.from lower diagonal elements\nof A\n\n(D) None of the above\n\nQ.11 The minimum number of arithmetic operations required to evaluate the polynomial\nP(X) = X°+4X?+4 6X+45 for a given value of X, using only one temporary variable is\n\nQ.12 Consider the following rooted tree with the vertex labeled P as the root:\n\nP\n\nThe order in which the nodes are visited during an in-order traversal of the tree is\n\n(A) SQPTRWUV\n(B) SQPTUWRV\n(C) SQPTWUVR\n(D) SQPTRUWV\n\nCS 3/14\n\n\n--- PAGE 9 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.13 Suppose depth first search is executed on the graph below starting at some unknown vertex.\nAssume that a recursive call to visit a vertex is made only after first checking that the vertex\nhas not been visited earlier. Then the maximum possible recursion depth (including the\ninitial call) is\n\nQ.14 You have an array of n elements. Suppose you implement quicksortby always choosing the central\nelement of the array as the pivot. Then the tightest upper bound /for the worsticase performance is\n\n(A) O(n) (B) O(nlogn) (C) O(n log n) (D) O(n?)\n\nQ.15 The length of the shortest string NOT in the language\\(over X = {a,b}) of the following regular\nexpression is .\n\na*b*(ba)*a*\n\nQ.16 Let = be a finite non-empty alphabet and let 2 be the power set of £*. Which one of the\nfollowing is TRUE?\n\n(A) Both 22° and 2* arecountable (B) 22 is countable and =* is uncountable\n\n(C) 2% is uncountable and =* is countable  (D) Both 2” and d* are uncountable\n\nQ.17 One ofthe purposes of using intermediate code in compilers is to\n(A) makeparsing and semantic analysis simpler.\n(B) improve error recovery and error reporting.\n(C) increase the chances of reusing the machine-independent code optimizer in other compilers.\n\n(D) improve the register allocation.\n\nCS 4/14\n\n\n--- PAGE 10 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.18\n\nQ.19\n\nQ.20\n\nQ.21\n\nQ.22\n\nCS\n\nWhich of the following statements are CORRECT?\n\n1) Static allocation of all data areas by a compiler makes it impossible to implement recursion.\n2) Automatic garbage collection is essential to implement recursion.\n\n3) Dynamic allocation of activation records is essential to implement recursion.\n\n4) Both heap and stack are essential to implement recursion.\n\n(A) 1 and 2 only (B) 2 and 3 only (C) 3 and 4 only (D) 1 and 3 only\n\nIn the context of modular software design, which one of the following combinations is desirable?\n\n(A) High cohesion and high coupling\n(B) High cohesion and low coupling\n(C) Low cohesion and high coupling\n\n(D) Low cohesion and low coupling\n\nA system uses 3 page frames for storing process pages in main memory. It uses the Least Recently\nUsed (LRU) page replacement policy. Assume that all the page frames are initially empty. What is\nthe total number of page faults that will occur while processing the page reference string given\nbelow?\n\n4, 7, 6, 1, 7,6, 1.2, 7, 2\n\nWhat is the optimized version ofsthe relation algebra expression 144 (142(0r1(Or2(1T)))), where\nA1, Az2 are sets of attributes in‘r with Ad CA2 and F1,F2 are Boolean expressions based on the\nattributes in r?\n\n(A) a1 (O(e1r2) (7)\n(B) 141 (Orive2)(r))\n(C) Taz (O(F1)F2) (r))\n(D) ta2 (O@ivr2)@))\n\nAvprime attribute of a relation scheme R is an attribute that appears\n\n(A) im all candidate keys of R.\n(B) insome candidate key of R.\n(C) ina foreign key of R.\n\n(D) only in the primary key of R.\n\n5/14\n\n\n--- PAGE 11 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.23\n\nQ.24\n\nQ.25\n\nIn the following pairs of OSI protocol layer/sub-layer and its functionality, the INCORRECT pair\nis\n\n(A) Network layer and Routing\n(B) Data Link Layer and Bit synchronization\n(C) Transport layer and End-to-end process communication\n\n(D) Medium Access Control sub-layer and Channel sharing\n\nA bit-stuffing based framing protocol uses an 8-bit delimiter pattern of 01111110. Ifthe output\nbit-string after stuffing is 01111100101, then the input bit-string is\n\n(A) 0111110100\n(B) 0111110101\n(C) O111111101\n(D) O1L1111111\n\nHost A (on TCP/IP v4 network A) sends an IP datagram D to host B (also on TCP/IP v4 network\nB). Assume that no error occurred during the transmission,of D. When D reaches B, which of the\nfollowing IP header field(s) may be different fromshat of the original datagram D?\n\n(i) TTL (ii) Checksum (iii) Fragment Offset\n\n(A) (i) only\n\n(B) (i) and (ii) only\n(C) (ai) and (111) only\n(D) (i), (ii) and (iii)\n\nQ. 26 — Q. 55 carry'two marks each.\n\nQ.26\n\nCS\n\nAn IP routeriamplementing Classless Inter-domain Routing (CIDR) receives a packet with address\n131.239151.76. The router’s routing table has the following entries:\n\n; Output Interface\nPrefix Identifier\n131.16.0.0/ 12 3\n\n131.28.0.0/ 14 5\n131.19.0.0/ 16 2\n\n131.22.0.0/ 15 1\n\nThe identifier of the output interface on which this packet will be forwarded is\n\n6/14\n\n\n--- PAGE 12 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.27 Every host in an IPv4 network has a 1-second resolution real-time clock with battery backup. Each\nhost needs to generate up to 1000 unique identifiers per second. Assume that each host has a\nglobally unique IPv4 address. Design a 50-bit globally unique ID for this purpose. After what\nperiod (in seconds) will the identifiers generated by a host wrap around?\n\nQ.28 An IP router with a Maximum Transmission Unit (MTU) of 1500 bytes has received an IP packet\nof size 4404 bytes with an IP header of length 20 bytes. The values of the relevant fields in the\nheader of the third IP fragment generated by the router for this packet are\n\n(A) MF bit: 0, Datagram Length: 1444; Offset: 370\n(B) MF bit: 1, Datagram Length: 1424; Offset: 185\n(C) MF bit: 1, Datagram Length: 1500; Offset: 370\n(D) MF bit: 0, Datagram Length: 1424; Offset: 2960\n\nQ.29 Consider the transactions TL, T2, and T3 and the schedules S1 and $2 given below.\n\nTl: r1(X); r1(Z); wl (X); wl(Z)\nT2: r2(Y¥); £2(Z); w2(Z)\nT3: r3(¥); r3(X); w3(Y)\n\nSl: r1(X); r3(¥); £3 (X); 12 (Y) 7 12 (Z) 5 w3 (¥) pow (Z) 5 v1 (Z) ; wl (X) ; wl (Z)\nS2: r1(X); r3(¥); r2(Y); 23 (X); rl (Z) 5 v2 (2); w3 (YX) ; wl (X) 5 w2 (Z) ; wl (Z)\nWhich one of the following statements aboutithe schedules is TRUE?\n\n(A) Only $1 is conflict-serializable.\n\n(B) Only S2 is conflict-serializable.\n\n(C) Both $1 and $2 are conflict-serializable.\n\n(D) Neither $1 nor S2 is conflict-serializable.\n\nQ.30 Consider the relational schema given below, where eId of the relation dependent is a foreign\nkey referring to empIdrof the relation employee. Assume that every employee has at least one\nassociated dependent in the dependent relation.\n\nemployee (empiId, empName, empAge)\ndependent (depId, eId, depName, depAge)\n\nConsider the following relational algebra query:\nNempta (employee) - Nempra (employeem (empId = eID)A(empAge < depAge) dependent)\n\nThe above query evaluates to the set of empIds of employees whose age is greater than that of\n(A) — some dependent.\n\n(B) all dependents.\n\n(C) — some of his/her dependents.\n\n(D) all of his/her dependents.\n\nCS TN4\n\n\n--- PAGE 13 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.31\n\nQ.32\n\nQ.33\n\nQ.34\n\nQ.35\n\nCS\n\nA system contains three programs and each requires three tape units for its operation. The\nminimum number of tape units which the system must have such that deadlocks never arise\nis\n\nAn operating system uses shortest remaining time first scheduling algorithm for pre-emptive\nscheduling of processes. Consider the following set of processes with their arrival times and CPU\nburst times (in milliseconds):\n\nProcess | Arrival Time | Burst Time\n\nPl 12\nP2 4\nP3 6\nP4 5\n\nThe average waiting time (in milliseconds) of the processes is\n\nConsider a paging hardware with a TLB. Assume that the entire page table and all the pages are in\nthe physical memory. It takes 10 milliseconds to search the TLB and 80 milliseconds to access the\nphysical memory. If the TLB hit ratio is 0.6, the effective memory access time (in milliseconds) is\n\nConsider the basic block given below.\n\na=b+ete\nc=atd\nd=bete\ne=d-b\na=e+t+b\n\nThe minimum number of,nodes and edges present in the DAG representation of the above basic\nblock respectively are\n\n(A) Gand 6 (B) 8 and 10 (C) 9 and 12 (D) 4 and 4\n\nWhich onef the following problems is undecidable?\n\n(A) Deciding if a given context-free grammar is ambiguous.\n\n(B) Deciding if a given string is generated by a given context-free grammar.\n\n(C) Deciding if the language generated by a given context-free grammar is empty.\n\n(D) Deciding if the language generated by a given context-free grammar is finite.\n\n8/14\n\n\n--- PAGE 14 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.36 Consider the following languages over the alphabet & = {0,1, c}:\n\nL, ={0\"1\"|n > 0}\nLy = {wew’ |w € {0,1}*}\nL3 = {ww' |w € {0,1}*}\n\nHere, w\" is the reverse of the string w. Which of these languages are deterministic Context-free\nlanguages?\n\n(A) None of the languages\n\n(B) Only L,\n\n(C) Only L, and L,\n\n(D) All the three languages\n\nQ.37 Suppose you want to move from 0 to 100 on the number line. In each step, you either\nmove right by a unit distance or you take a shortcut. A shortcutas»simply apre-specified\npair of integers i,j with i <j. Given a shortcut i,j if you are at position i on the number\nline, you may directly move to 7. Suppose T(k) denotes the smallest number of steps\nneeded to move from k to 100. Suppose further that there is at most 1 shortcut involving\nany number, and in particular from 9 there is a shortcut to 15. Let y and z be such that\nT(9) = 1 + min(T(y),T(z)). Then the value of the product yz is .\n\nQ.38 Consider the decision problem 2CNFSAT defined as follows:\n{ ® | Gis a satisfiable propositional formula in CNF with at most two literals per clause }\nFor example, @ = (x1 v Xz)A(XyX3)A(%2 V X4) is a Boolean formula and it is in 2CNFSAT.\n\nThe decision problenn2CNFSAT is\n\n(A) NP-Complete.\n(B) solvablein polynomial time by reduction to directed graph reachability.\n(C) | solvablein constant time since any input instance is satisfiable.\n\n(D) NP-hard, but not NP-complete.\n\nQ.39 Suppose we have a balanced binary search tree T holding n numbers. We are given two\nnumbers ZL and H and wish to sum up all the numbers in T that lie between L and H.\nSuppose there are m such numbers in T. If the tightest upper bound on the time to\ncompute the sum is O(n“ log? n + m* log“ n), the value of a + 10b + 100c + 1000d is\n\nCS 9/14\n\n\n--- PAGE 15 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.40 Consider a hash table with 100 slots. Collisions are resolved using chaining. Assuming simple\nuniform hashing, what is the probability that the first 3 slots are unfilled after the first 3 insertions?\n\n(A) (97 x 97 x 97)/1003 (B) (99 x 98 x 97)/1003\n(C) (97 x 96 x 95)/1003 (D) (97 x 96 x 95)/(3! x 1003)\n\nQ.41 Consider the pseudocode given below. The function DoSomething() takes as argument a\npointer to the root of an arbitrary tree represented by the leftMostChild-rightSibling representation.\nEach node of the tree is of type treeNode.\ntypedef struct treeNode* treeptr;\n\nstruct treeNode\n\n{\ntreeptr leftMostChild, rightSibling;\n};\nint DoSomething (treeptr tree)\n{\nint value=0;\nif (tree != NULL) {\nif (tree->leftMostChild == NULL)\nvalue = 1;\nelse\nvalue = DoSomething(tree->leftMostChild) ;\nvalue = value + DoSomething(tree->rightSibling) ;\n}\nreturn (value) ;\n}\n\nWhen the pointer to the root of a tree is passed as the argument to DoSomething, the value\nreturned by the function corresponds to the\n\n(A) number of internal nodes inthe tree.\n(B) height of the tree.\n(C) number of nodes.without a right sibling in the tree.\n\n(D) number of leaf nodes in the tree.\n\nCS 10/14\n\n\n--- PAGE 16 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.42 Consider the C function given below. Assume that the array listA contains n (> 0) elements,\n\nQ.43\n\nQ.44\n\nCS\n\nsorted in ascending order.\n\nint ProcessArray(int *listA, int x, int n)\n\n{\nint i, j, k;\ni = 0;\nj = n-1;\ndo {\nk = (i+j)/2;\nif (x <= listA[k] )\nj = k-1;\nif (listA[k] <= x)\ni = k+1;\n}while (i <= j);\nif (listA[k] == x)\nreturn (k) ;\nelse\nreturn -1;\n}\n\nWhich one of the following statements about the functionProcessArray is CORRECT?\n\n(A) It will run into an infinite loop when x is notin lista.\n(B) It is an implementation of binary search:\n(C) It will always find the maximum element in lista.\n\n(D) It will return —1 even when x is presentin lista.\n\nAn instruction pipeline has five stages, namely, instruction fetch (IF), instruction decode and\nregister fetch (ID/RF), instruction,execution (EX), memory access (MEM), and register writeback\n(WB) with stage latencies bh ns, 2.2 ns, 2 ns, 1 ns, and 0.75 ns, respectively (ns stands for\nnanoseconds). To gain in termsjof frequency, the designers have decided to split the ID/RF stage\ninto three stages (ID, RF1, RF2) each’of latency 2.2/3 ns. Also, the EX stage is split into two stages\n(EX1, EX2) each ‘of latency 1 ns. The new design has a total of eight pipeline stages. A program\nhas 20% branch instructions which execute in the EX stage and produce the next instruction pointer\nat the end of the EX stage in the old design and at the end of the EX2 stage in the new design. The\nIF stage stalls after fetching a branch instruction until the next instruction pointer is computed. All\ninstructions other than the branch instruction have an average CPI of one in both the designs. The\nexecution times of this program on the old and the new design are P and Q nanoseconds,\nrespectively. The value of P/Q is\n\nThe*memory access time is | nanosecond for a read operation with a hit in cache, 5 nanoseconds\nfor a read operation with a miss in cache, 2 nanoseconds for a write operation with a hit in cache\nand 10 nanoseconds for a write operation with a miss in cache. Execution of a sequence of\ninstructions involves 100 instruction fetch operations, 60 memory operand read operations and 40\nmemory operand write operations. The cache hit-ratio is 0.9. The average memory access time (in\nnanoseconds) in executing the sequence of instructions is\n\n11/14\n\n\n--- PAGE 17 ---\n\nGATE 2014\n\nSET-3 COMPUTER — CS\n\nQ.45\n\nQ.46\n\nQ.47\n\nQ.48\n\nThe above synchronous sequential circuit built using JK flip-flops is, initialized with\nQ2Q1Q9 = 000. The state sequence for this circuit for the next 3 clock cycles is\n\n(A) 001, 010, 011\n(B) 111, 110, 101\n(C) 100, 110, 111\n(D) 100, 011, 001\n\n. . . oe b\nWith respect to the numerical evaluation of the definite integral, K = J, x* dx, where a and b are\n\ngiven, which of the following statements is/are TRUE?\n\n1)\n\nID\n\n(A) Ionly\n\nThe value of K obtained using the trapezoidal rule is always greater than or equal to the\nexact value of the definite integral.\n\nThe value of K,obtained using the Simpson’s rule is always equal to the exact value of\nthe definite integral.\n\n(B) ILonly (C) Both I and II (D) Neither I nor II\n\nThe value of'theuntegral given below is\n\n(A) -21\n\nTw\ni) x? cosx dx\n0\n\n(B) (C) -1 (D) 2\n\nLet S be a sample space and two mutually exclusive events A and B be such that AUB =S. If\nP(-) denotes the probability of the event, the maximum value of P(A)P(B) is\n\nCS\n\n12/14\n\n\n--- PAGE 18 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.49 Consider the set of all functions f: {0,1, ...,2014} > {0,1, ...,2014} such that f(f() = i,\n\nQ.50\n\nQ.51\n\nQ.52\n\nCS\n\nfor allO <i < 2014. Consider the following statements:\n\nP. For each such function it must be the case that for every i, f() = i.\nQ. For each such function it must be the case that for some i, f(i) = i.\nR. Each such function must be onto.\n\nWhich one of the following is CORRECT?\n\n(A) P, Q and R are true\n\n(B) Only Q and R are true\n\n(C) Only P and Q are true\n\n(D) Only R is true\n\nThere are two elements x, y in a group (G,*) such that every element in the group can be\nwritten as a product of some number of x's and y'sin some order. It is known that\n\nX*¥XH=SVFYVHXKVHX VY Sy tKXeyex =e\n\nwhere e is the identity element. The maximum number of elements in such a group is\n\nIf G is a forest with n verticesand k connected components, how many edges does G have?\n\n(A) [n/k] (B) [n/k] (C) n-k (D) n-k+1\n\nLet 6.denote the minimum degree of a vertex in a graph. For all planar graphs on n vertices with\n6 = 3, which one of the following is TRUE?\n\nn\n(A) In.any planar embedding, the number of faces is at least 3 +2\nn\n(B) dn any planar embedding, the number of faces is less than 3 +2\n\nn\n(C) There is a planar embedding in which the number of faces is less than 3 +2\n\n(D) There is a planar embedding in which the number of faces is at most S41\n\n13/14\n\n\n--- PAGE 19 ---\n\nGATE 2014 SET-3 COMPUTER — CS\n\nQ.53\n\nQ.54\n\nQ.55\n\nCS\n\nThe CORRECT formula for the sentence, “not all rainy days are cold” is\n(A) Wd (Rainy(d) A~Cold(d))\n\n(B) Vd (~Rainy(d) — Cold(d))\n\n(C) Ad (~Rainy(d) — Cold(d))\n\n(D) Jd (Rainy(d) ~~Cold(d))\n\nConsider the following relational schema:\n\nemployee (empiId, empName, empDept)\ncustomer (custId,custName, salesRepId, rating)\n\nsalesRepId is a foreign key referring to empId of the employee relation. Assume that each\nemployee makes a sale to at least one customer. What does the following query return?\n\nSELECT empName\n\nFROM employee E\n\nWHERE NOT EXISTS (SELECT custId\nFROM customer C\nWHERE C.salesRepId = E.empIid\nAND C.rating <> ‘GOOD’ );\n\n(A) Names of all the employees with at least’oneof their customers having a ‘GOOD?’ rating.\n(B) Names of all the employees with at most one of their customers having a ‘GOOD?’ rating.\n(C) Names of all the employees with none of their customers having a ‘GOOD?’ rating.\n\n(D) Names of all the employees with all their customers having a ‘GOOD?’ rating.\n\nLet © denote the Exclusive OR,(XOR) operation. Let ‘1’ and ‘0’ denote the binary constants.\nConsider the following Boolean expression for F over two variables P and Q:\n\nF(P,Q) = ((14@P)@(P@Q)) @ ((P@Q)G(QG0))\n\nThe equivalent expression for F is\n\n(A) P+Q (B) P+Q (C) P®Q (D) P\n\n©\nc~)\n\nEND OF THE QUESTION PAPER\n\n14/14\n\n\n--- PAGE 20 ---\n\n"
}