{
    "source_pdf": "GATE_2013_CS.pdf",
    "extracted_text": "2013 Question Booklet Code ——>\nCS : COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\nDuration: Three Hours Maximum Marks: 100\n\nRead the following instructions carefully.\n\n1.\n2.\n\n10.\n11.\n\n12.\n\nDo not open the seal of the Question Booklet until you are asked to do so by the invigilator.\n\nTake out the Optical Response Sheet (ORS) from this Question Booklet without breaking the seal\n\nand read the instructions printed on the ORS carefully. If you find that either\n\na. The Question Booklet Code printed at the right hand top corner of this page does not match with\nthe Question Booklet Code at the right hand top corner of the ORS or\n\nb. The Question Paper Code preceding the Registration number on the ORS is not CS,\n\nthen exchange the booklet immediately with a new sealed Question Booklet.\n\nOn the right hand side of the ORS, using ONLY a black ink ballpoint pen, (i) darken the appropriate\nbubble under each digit of your registration number and (ii) write your registration number, your name\nand name of the examination centre and put your signature at the specified location.\n\nThis Question Booklet contains 20 pages including blank pages for rough work. After you are\npermitted to open the seal, check all pages and report discrepancies, if any, to the invigilator.\n\nThere are a total of 65 questions carrying 100 marks. All these questions are of objective type. Each\nquestion has only one correct answer. Questions must be answered on the left hand side of the ORS\nby darkening the appropriate bubble (marked A, B, C, D) using ONLY a black ink ballpoint pen\nagainst the question number. For each question darken the bubble of the correct answer. More\nthan one answer bubbled against a question will be treated as an incorrect response.\n\nSince bubbles darkened by the black ink ballpoint pen cannot be erased, candidates should darken the\nbubbles in the ORS very carefully.\n\nQuestions Q.1 — Q.25 carry 1 mark each. Questions Q.26 — Q.55 carry 2 marks each. The 2 marks\nquestions include two pairs of common data questions and two pairs of linked answer questions. The\nanswer to the second question of the linked answer questions depends on the answer to the first\nquestion of the pair. If the first question in the linked pair is wrongly answered or is not attempted,\nthen the answer to the second question in the pair will not be evaluated.\n\nQuestions Q.56 — Q.65 belong to General Aptitude (GA) section and carry a total of 15 marks.\nQuestions Q.56 — Q.60 carry | mark each, and questions Q.61 — Q.65 carry 2 marks each.\n\nQuestions not attempted will result in zero mark and wrong answers will result in NEGATIVE\nmarks. For all 1 mark questions, % mark will be deducted for each wrong answer. For all 2 marks\nquestions, % mark will be deducted for each wrong answer. However, in the case of the linked\nanswer question pair, there will be negative marks only for wrong answer to the first question and no\nnegative marks for wrong answer to the second question.\n\nCalculator is allowed whereas charts, graph sheets or tables are NOT allowed in the examination hall.\n\nRough work can be done on the Question Booklet itself. Blank pages are provided at the end of the\nQuestion Booklet for rough work.\n\nBefore the start of the examination, write your name and registration number in the space provided\nbelow using a black ink ballpoint pen.\n\nName\n\nRegistration Number\n\nCS-A\n\n1/20\n\n\n--- PAGE 1 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.1 to Q.25 carry one mark each.\n\nQ.1\n\nQ.2\n\nQ3\n\nQ.4\n\nQ.5\n\nQ.6\n\nQ.7\n\nCS-A\n\nA binary operation ® on a set of integers is defined as x® y=x” + y?. Which one of the following\nstatements is TRUE about @?\n\n(A) Commutative but not associative (B) Both commutative and associative\n(C) Associative but not commutative (D) Neither commutative nor associative\n\nSuppose p is the number of cars per minute passing through a certain road junction between 5 PM\nand 6 PM, and p has a Poisson distribution with mean 3. What is the probability of observing fewer\nthan 3 cars during any given minute in this interval?\n\n(A) 8/(2e*) (B) 9/(2e°) (C) 17/(2e*) (D) 26/(2e°)\nlx x?\nWhich one of the following does NOT equal [ly y7|?\n1 z 2\n1 x(x+1) x41 1 x41 x7 41\n(A) |l y(y+l) y+l (B) |1 y+l y? 41\n1 z(z+1) zt+l 1 z+l 2 +]\nO x-y x? y? 2 x+y x+y?\n(C) JO y-z y?=-2? (D) 22 yt+z yr+e?\n1 ¢ Zz 1 z 2\n\nThe smallest integer that can be represented by an 8-bit number in 2’s complement form is\n(A) -256 (B) -128 (C) -127 (D) 0\n\nIn the following truth table, V = 1 if and only if the input is valid.\n\nWhat function does the truth table represent?\n\n(A) Priority encoder (B) Decoder\n(C) Multiplexer (D) Demultiplexer\n\nWhich one of the following is the tightest upper bound that represents the number of swaps\nrequired to sort n numbers using selection sort?\n\n(A) O(log n) (B) OW) (C) O(n log n) (D) O(n’)\n\nWhich one of the following is the tightest upper bound that represents the time complexity of\ninserting an object into a binary search tree of n nodes?\n\n(A) O(1) (B) Odog n) (C) O(n) (D) O(a log n)\n\n2/20\n\n\n--- PAGE 2 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.8\n\nQ.9\n\nQ.10\n\nQ.11\n\nQ.12\n\nQ.13\n\nCS-A\n\nConsider the languages L,=® and L,={a}. Which one of the following represents L, UL, ?\n(A) {e} (B) ® (C) a* (D) {e, a}\n\nWhat is the maximum number of reduce moves that can be taken by a bottom-up parser for a\ngrammar with no epsilon- and unit-production (i.e., of type A — e€ and A — a) to parse a string\nwith n tokens?\n\n(A) n/2 (B) n-1 (C) 2n-1 (D) 2”\n\nA scheduling algorithm assigns priority proportional to the waiting time of a process. Every process\nstarts with priority zero (the lowest priority). The scheduler re-evaluates the process priorities every\nT time units and decides the next process to schedule. Which one of the following is TRUE if the\nprocesses have no I/O operations and all arrive at time zero?\n\n(A) This algorithm is equivalent to the first-come-first-serve algorithm.\n\n(B) This algorithm is equivalent to the round-robin algorithm.\n\n(C) This algorithm is equivalent to the shortest-job-first algorithm.\n\n(D) This algorithm is equivalent to the shortest-remaining-time-first algorithm.\n\nMatch the problem domains in GROUP I with the solution technologies in GROUP II.\n\nGROUP I GROUP II\n(P) Service oriented computing (1) Interoperability\n(Q) Heterogeneous communicating systems (2) BPMN\n(R) Information representation (3) Publish-find-bind\n(S) Process description (4) XML\n(A) P-1, Q-2, R-3, S-4 (B) P-3, Q-4, R-2, S-1\n(C) P-3, Q-1, R-4, S-2 (D) P-4, Q-3, R-2, S-1\n\nThe transport layer protocols used for real time multimedia, file transfer, DNS and email,\nrespectively are\n\n(A) TCP, UDP, UDP and TCP\n(B) UDP, TCP, TCP and UDP\n(C) UDP, TCP, UDP and TCP\n(D) TCP, UDP, TCP and UDP\n\nUsing public key cryptography, X adds a digital signature o to message M, encrypts <M, o>, and\nsends it to Y, where it is decrypted. Which one of the following sequences of keys is used for the\noperations?\n\n(A) Encryption: X’s private key followed by Y’s private key; Decryption: X’s public key followed\nby Y’s public key\n\n(B) Encryption: X’s private key followed by Y’s public key; Decryption: X’s public key followed\nby Y’s private key\n\n(C) Encryption: X’s public key followed by Y’s private key; Decryption: Y’s public key followed\nby X’s private key\n\n(D) Encryption: X’s private key followed by Y’s public key; Decryption: Y’s private key followed\nby X’s public key\n\n3/20\n\n\n--- PAGE 3 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.14\n\nQ.15\n\nQ.16\n\nQ.17\n\nQ.18\n\nCS-A\n\nAssume that source S and destination D are connected through two intermediate routers labeled R.\nDetermine how many times each packet has to visit the network layer and the data link layer during\na transmission from S to D.\n\n(A) Network layer — 4 times and Data link layer — 4 times\n(B) Network layer — 4 times and Data link layer — 3 times\n(C) Network layer — 4 times and Data link layer — 6 times\n(D) Network layer — 2 times and Data link layer — 6 times\n\nAn index is clustered, if\n\n(A) it is on a set of fields that form a candidate key.\n\n(B) it is on a set of fields that include the primary key.\n\n(C) the data records of the file are organized in the same order as the data entries of the index.\n(D) the data records of the file are organized not in the same order as the data entries of the index.\n\nThree concurrent processes X, Y, and Z execute three different code segments that access and\nupdate certain shared variables. Process X executes the P operation (i.e., wait) on semaphores\na, b and c; process Y executes the P operation on semaphores b, c and d; process Z executes the\nP operation on semaphores c, d, and a before entering the respective code segments. After\ncompleting the execution of its code segment, each process invokes the V operation (i.e., signal) on\nits three semaphores. All semaphores are binary semaphores initialized to one. Which one of the\nfollowing represents a deadlock-free order of invoking the P operations by the processes?\n\n(A) X: P(a)P(b)P(c) -Y: P(b)P(c)P(d)_—«Z: P(c)P(d)P(a)\n(B) X: P(b)P(a)P(c) ‘YY: P(b)P(c)P(d)_—-Z: P(a)P(c)P(d)\n(C) X: P(b)P(a)P(c) ‘YY: P(c)P(b)P(d)_—-Z: P(a)P(c)P(d)\n(D) X: P(a)P(b)P(c) YY: P(c)P(b)P(d) —-Z:: P(c)P(d)P(a)\n\nWhich of the following statements is/are FALSE?\n\n1. For every non-deterministic Turing machine, there exists an equivalent deterministic\nTuring machine.\n\n2. Turing recognizable languages are closed under union and complementation.\n\n3. Turing decidable languages are closed under intersection and complementation.\n\n4. Turing recognizable languages are closed under union and intersection.\n\n(A) 1 and 4 only (B) 1 and 3 only (C) 2 only (D) 3 only\n\nWhich of the following statements are TRUE?\n1. | The problem of determining whether there exists a cycle in an undirected graph is in P.\n2. The problem of determining whether there exists a cycle in an undirected graph is in NP.\n3. Ifa problem A is NP-Complete, there exists a non-deterministic polynomial time algorithm\nto solve A.\n\n(A) 1, 2 and 3 (B) 1 and 2 only (C) 2 and 3 only (D) 1 and 3 only\n\n4/20\n\n\n--- PAGE 4 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.19\n\nQ.20\n\nQ.21\n\nQ.22\n\nQ.23\n\nQ.24\n\nQ.25\n\nCS-A\n\nWhat is the time complexity of Bellman-Ford single-source shortest path algorithm on a complete\ngraph of 1 vertices?\n\n(A) 07’) (B) O@n'log n) (C) O(n’) (D) O(n'log n)\nIn a k-way set associative cache, the cache is divided into v sets, each of which consists of k lines.\nThe lines of a set are placed in sequence one after another. The lines in set s are sequenced before\n\nthe lines in set (s+1). The main memory blocks are numbered 0 onwards. The main memory block\nnumbered j must be mapped to any one of the cache lines from\n\n(A) (j mod v) *k to (j mod v) *k + (k-1) (B) (j mod v) to (j mod v) + (k-1)\n(C) (j mod k) to (j mod k) + (v-1) (D) (j mod k) * y to (j mod k) * v + (v-1)\n\nWhich one of the following expressions does NOT represent exclusive NOR of x and y?\n\n(A) xyt+x'y’ (B) x®y’ (C) x’@y (D) x’@y’\n\nWhich one of the following functions is continuous at x = 3?\n\n2, if x=3 4, if x=3\n; B =\n\n(A) f(x)=ix-1, if x>3 (B) f£() trey if x#3\n\nx43 if x3\n\n3\n\nx+3 if x3 1\nCc - , D x)= , if x #3\n© fayaf re OS ©) f=\n\nFunction f is known at the following points:\n\nx 0 0.3 0.6 0.9 1.2 1.5 1.8 2.1 2.4 2.7 3.0\nIx) 0 0.09 | 0.36 [0.81 | 144 | 2.25 | 3.24 | 441 | 5.76 | 7.29 | 9.00\n\n3\nThe value of x) dx computed using the trapezoidal rule is\n0 p g p\n\n(A) 8.983 (B) 9.003 (C) 9.017 (D) 9.045\n\nConsider an undirected random graph of eight vertices. The probability that there is an edge\nbetween a pair of vertices is 1/2. What is the expected number of unordered cycles of length three?\n(A) 1/8 (B) 1 (C) 7 (D) 8\n\nWhich of the following statements is/are TRUE for undirected graphs?\n\nP: Number of odd degree vertices is even.\nQ: Sum of degrees of all vertices is even.\n\n(A) P only (B) Q only (C) Both P and Q (D) Neither P nor Q\n\n5/20\n\n\n--- PAGE 5 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.26 to Q.55 carry two marks each.\n\nQ.26\n\nQ.27\n\nQ.28\n\nQ.29\n\nQ.30\n\nCS-A\n\nThe line graph L(G) of a simple graph G is defined as follows:\n\ne There is exactly one vertex v(e) in L(G) for each edge e in G.\ne For any two edges e and e'in G, L(G) has an edge between v(e) and v(e’), if and only if e and e'\nare incident with the same vertex in G.\n\nWhich of the following statements is/are TRUE?\n\n(P) The line graph of a cycle is a cycle.\n\n(Q) The line graph of a clique is a clique.\n\n(R) The line graph of a planar graph is planar.\n(S) The line graph of a tree is a tree.\n\n(A) P only (B) P and R only\n(C) R only (D) P, Q and S only\n\nWhat is the logical translation of the following statement?\n\n“None of my friends are perfect.”\n(A) Sx(F(x)AaP(x)) (B) Sx(AF (x)A P(x)\n(C) dx (AF (x)AP(x)) (D) Ad x(F(x)a P(x))\n\nConsider the following sequence of micro-operations.\n\nMBR < PC\nMAR < X\n\nPC «+ Y\n\nMemory <- MBR\n\nWhich one of the following is a possible operation performed by this sequence?\n\n(A) Instruction fetch (B) Operand fetch\n(C) Conditional branch (D) Initiation of interrupt service\n\nConsider a hard disk with 16 recording surfaces (0-15) having 16384 cylinders (O0-16383) and each\ncylinder contains 64 sectors (0-63). Data storage capacity in each sector is 512 bytes. Data are\norganized cylinder-wise and the addressing format is <cylinder no., surface no., sector no.>. A file\nof size 42797 KB is stored in the disk and the starting disk location of the file is <1200, 9, 40>.\nWhat is the cylinder number of the last sector of the file, if it is stored in a contiguous manner?\n\n(A) 1281 (B) 1282 (C) 1283 (D) 1284\n\nThe number of elements that can be sorted in O(log n) time using heap sort is\n\nlogn\n(A) @(1) (B) @(Jiog n) (C) © ae] (D) O(log n)\n\n6/20\n\n\n--- PAGE 6 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.31\n\nQ.32\n\nQ.33\n\nQ.34\n\nCS-A\n\nConsider the following function:\n\nint unknown(int n) {\nint i, j, k=0;\nfor (i=n/2; i<=n; itt)\nfor (j=2; j<=n; j=j*2)\nk =k + n/2;\nreturn (k);\n\n}\nThe return value of the function is\n(A) @(n’) (B) @(n’log n) (C) @(n’) (D) @(n*logn)\n\nConsider the following languages.\n\nL,={0? 120\" |p.q.r = Oo}\n\nL, ={0” 170° |p,q,r= 0, per}\n\nWhich one of the following statements is FALSE?\n\n(A) Ly is context-free.\n\n(B) L,M Ly is context-free.\n\n(C) Complement of L, is recursive.\n\n(D) Complement of L; is context-free but not regular.\n\nConsider the DFA A given below.\n\nWhich of the following are FALSE?\n\n1. Complement of L(A) is context-free.\n\n2. L(A) = L((11*0+0)(0 + 1)*0*1*)\n\n3. For the language accepted by A, A is the minimal DFA.\n4. A accepts all strings over {0, 1} of length at least 2.\n\n(A) 1 and 3 only (B) 2 and 4 only (C) 2 and 3 only (D) 3 and 4 only\n\nA shared variable x, initialized to zero, is operated on by four concurrent processes W, X, Y, Z as\nfollows. Each of the processes W and X reads x from memory, increments by one, stores it to\nmemory, and then terminates. Each of the processes Y and Z reads x from memory, decrements by\ntwo, stores it to memory, and then terminates. Each process before reading x invokes the P\noperation (i.e., wait) on a counting semaphore S and invokes the V operation (i.e., signal) on the\nsemaphore S after storing x to memory. Semaphore S is initialized to two. What is the maximum\n\npossible value of x after all processes complete execution?\n\n(A) -2 (B) -l (C) 1 (D) 2\n\n7/120\n\n\n--- PAGE 7 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.35\n\nQ.36\n\nQ.37\n\nQ.38\n\nCS-A\n\nConsider the following relational schema.\n\nStudents(rolno: integer, sname: string)\nCourses(courseno: integer, cname: string)\n\nRegistration(rollno: integer, courseno: integer, percent: real)\n\nWhich of the following queries are equivalent to this query in English?\n“Find the distinct names of all students who score more than 90% in the course numbered 107”\n\n() SELECT DISTINCT S.sname\nFROM Students as S, Registration as R\nWHERE R.rollno=S.rollno AND R.courseno=107 AND R.percent >90\n\n(I) []sname(Scourseno=107 A percent>90 (Registration >< Students))\n\n(Il) {T | 4Se Students, SRE Registration ( S.rollno=R.rollno A\n\nR.courseno=107 A R.percent>90 AT.sname=S.sname) }\n\n(IV) {<Sy> | SSRARp ( <Sp, Sn>€ Students A <Sp, 107, Rp>€ Registration A Rp>90)}\n\n(A) I, II, HI and IV (B) I, I and III only\n(C) I, Il and IV only (D) II, III and IV only\n\nDetermine the maximum length of the cable (in km) for transmitting data at a rate of 500 Mbps in\nan Ethernet LAN with frames of size 10,000 bits. Assume the signal speed in the cable to be\n2,00,000 km/s.\n\n(A) | (B) 2 (C) 2.5 (D) 5\n\nIn an IPv4 datagram, the M bit is 0, the value of HLEN is 10, the value of total length is 400 and\nthe fragment offset value is 300. The position of the datagram, the sequence numbers of the first\nand the last bytes of the payload, respectively are\n\n(A) Last fragment, 2400 and 2789\n(B) First fragment, 2400 and 2759\n(C) Last fragment, 2400 and 2759\n(D) Middle fragment, 300 and 689\n\nThe following figure represents access graphs of two modules M1 and M2. The filled circles\nrepresent methods and the unfilled circles represent attributes. If method m is moved to module M2\nkeeping the attributes where they are, what can we say about the average cohesion and coupling\nbetween modules in the system of two modules?\n\nModule M1 Module M2\n\n(A) There is no change.\n\n(B) Average cohesion goes up but coupling is reduced.\n\n(C) Average cohesion goes down and coupling also reduces.\n(D) Average cohesion and coupling increase.\n\n8/20\n\n\n--- PAGE 8 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\nQ.39 A certain computation generates two arrays a and b such that a[i]=f£(i)for0 <i<n and\nb[i] = g (a[i] )for 0 <i < n. Suppose this computation is decomposed into two concurrent processes\nX and Y such that X computes the array a and Y computes the array b. The processes employ two\nbinary semaphores R and S, both initialized to zero. The array a is shared by the two processes. The\nstructures of the processes are shown below.\nProcess X: Process Y:\nprivate i; private i;\nfor (i=0; ix<n; i++) { for (i=0; ixn; i++) {\na[i] = £(1); EntryY(R, S);\nExitX(R, S); b[i] = g(ali]l);\n} }\nWhich one of the following represents the CORRECT implementations of ExitX and Ent ryY?\n(A) ExitX(R, S) { (B) ExitX(R, S) {\nP(R); V(R);\nV(S); V(S);\n} }\nEntryY(R, S) { EntryY(R, S) {\nP(S); P(R);\nV(R); P(S);\n} }\n(C) ExitX(R, S) { (D) ExitX(R, S) {\nP(S); V(R);\nV(R); P(S);\n} }\nEntryY(R, S) { EntryY(R, S) {\nV(S); V(S);\nP(R); P(R);\n} }\nQ.40 Consider the following two sets of LR(1) items of an LR(1) grammar.\nX > c.X, c/d X > c.X, $\nX > .cX, c/d X > .cX, $\nX — .d, c/d X — .d,$\nWhich of the following statements related to merging of the two sets in the corresponding LALR\nparser is/are FALSE?\n1. Cannot be merged since look aheads are different.\n2. Can be merged but will result in S-R conflict.\n3. Can be merged but will result in R-R conflict.\n4. Cannot be merged since goto on c will lead to two different sets.\n(A) 1 only (B) 2 only (C) 1 and 4 only (D) 1, 2,3 and 4\nQ.41 Which of the following is/are undecidable?\n\nCS-A\n\n1. GisaCFG. Is L(G) = ®?\n\n2. GisaCFG. Is L(G)=>?\n\n3. Misa Turing machine. Is L(V) regular?\n\n4. Aisa DFA and Nis an NFA. Is L(A) = L(N)?\n\n(A) 3 only (B) 3 and 4 only (C) 1, 2 and 3 only (D) 2 and 3 only\n9/20\n\n\n--- PAGE 9 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.42\n\nQ.43\n\nQ.44\n\nQ.45\n\nQ.46\n\nQ.47\n\nCS-A\n\nWhat is the return value of f (p, p), if the value of p is initialized to 5 before the call? Note that\nthe first parameter is passed by reference, whereas the second parameter is passed by value.\n\nint £ (int &x, int c) {\n\nc=c-1;\nif (c==0) return 1;\nx =xd+ 1;\nreturn f£(x,c) * x;\n}\n(A) 3024 (B) 6561 (C) 55440 (D) 161051\n\nThe preorder traversal sequence of a binary search tree is 30, 20, 10, 15, 25, 23, 39, 35, 42. Which\none of the following is the postorder traversal sequence of the same tree?\n\n(A) 10, 20, 15, 23, 25, 35, 42, 39, 30 (B) 15, 10, 25, 23, 20, 42, 35, 39, 30\n(C) 15, 20, 10, 23, 25, 42, 35, 39, 30 (D) 15, 10, 23, 25, 20, 35, 42, 39, 30\n\nConsider the following operation along with Enqueue and Dequeue operations on queues, where\nk is a global parameter.\n\nMult iDequeue (Q) {\nm= k\nwhile (Q is not empty) and (m > 0) {\nDequeue (Q)\nm=m-it1\n}\n}\n\nWhat is the worst case time complexity of a sequence of n queue operations on an initially empty\nqueue?\n\n(A) O(n) (B) O(n + k) (C) O(nk) (D) O(n’)\n\nConsider an instruction pipeline with five stages without any branch prediction: Fetch Instruction\n(FI), Decode Instruction (DI), Fetch Operand (FO), Execute Instruction (EI) and Write Operand\n(WO). The stage delays for FI, DI, FO, EI and WO are 5 ns, 7 ns, 10 ns, 8 ns and 6 ns, respectively.\nThere are intermediate storage buffers after each stage and the delay of each buffer is 1 ns. A\nprogram consisting of 12 instructions I, lL, kl, ..., I2 is executed in this pipelined processor.\n\nInstruction I, is the only branch instruction and its branch target is Ig. If the branch is taken during\nthe execution of this program, the time (in ns) needed to complete the program is\n\n(A) 132 (B) 165 (C) 176 (D) 328\n\nA RAM chip has a capacity of 1024 words of 8 bits each (1K x 8). The number of 2 x 4 decoders\nwith enable line needed to construct a 16K x 16 RAM from 1K x 8 RAM is\n\n(A) 4 (B)5 (C) 6 (D) 7\nWhich one of the following is NOT logically equivalent to 44x (V y (a)Avz (B ))?\n\n(A) V x(4z(4)>V y(a)) (B) Vx(V¥ 2(B)> 3 y(na@))\n(C) Vx(V y(@)>32(48)) (D) Vx(Ay(na)>3z(48))\n\n10/20\n\n\n--- PAGE 10 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\n\nCommon Data Questions\n\nCommon Data for Questions 48 and 49:\n\nThe following code segment is executed on a processor which allows only register operands in its\ninstructions. Each instruction can have atmost two source operands and one destination operand. Assume\nthat all variables are dead after this code segment.\n\nc=at b;\nd=c* a;\ne=cta;\nxX = Cc * CG;\nif (x >a) {\nyua* a;\n}\nelse {\nd=d*d;\ne=e*e;\n\nQ.48 Suppose the instruction set architecture of the processor has only two registers. The only allowed\ncompiler optimization is code motion, which moves statements from one place to another while\npreserving correctness. What is the minimum number of spills to memory in the compiled code?\n\n(A) 0 (B) 1 (C) 2 (D) 3\n\nQ.49 What is the minimum number of registers needed in the instruction set architecture of the processor\nto compile this code segment without any spill to memory? Do not apply any optimization other\nthan optimizing register allocation.\n\n(A) 3 (B) 4 (C)5 (D) 6\n\nCommon Data for Questions 50 and 51:\nThe procedure given below is required to find and replace certain characters inside an input character string\nsupplied in array A. The characters to be replaced are supplied in array oldc, while their respective\nreplacement characters are supplied in array newc. Array A has a fixed length of five characters, while\narrays oldc and newc contain three characters each. However, the procedure is flawed.\nvoid find_and_replace (char *A, char *oldc, char *newc) {\n\nfor (int i=0; i<5; i++)\n\nfor (int j=0; j<3; jtt)\n\nif (A[i] == oldc[j]) Ali] = newc[j];\n}\nThe procedure is tested with the following four test cases.\n(1) oldc = “abc”, newc = “dab” (2) oldc = “cde”, newc = “bcd”\n(3) oldc = “bca”, newc = “cda” (4) oldc = “abc”, newc = “bac”\n\nQ.50 The tester now tests the program on all input strings of length five consisting of characters ‘a’,\n*b’, *c’, ‘d’ and ‘e’ with duplicates allowed. If the tester carries out this testing with the four\ntest cases given above, how many test cases will be able to capture the flaw?\n\n(A) Only one (B) Only two (C) Only three (D) All four\n\nQ.51 If array A is made to hold the string “abcde”, which of the above four test cases will be successful\n\nin exposing the flaw in this procedure?\n(A) None (B) 2 only\n(C) 3 and 4 only (D) 4 only\n\nCS-A 11/20\n\n\n--- PAGE 11 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\n\nLinked Answer Questions\nStatement for Linked Answer Questions 52 and 53:\n\nA computer uses 46-bit virtual address, 32-bit physical address, and a three-level paged page table\norganization. The page table base register stores the base address of the first-level table (77), which\noccupies exactly one page. Each entry of T; stores the base address of a page of the second-level table (7>).\nEach entry of T> stores the base address of a page of the third-level table (73). Each entry of T; stores a page\ntable entry (PTE). The PTE is 32 bits in size. The processor used in the computer has a 1 MB 16-way set\nassociative virtually indexed physically tagged cache. The cache block size is 64 bytes.\n\nQ.52 What is the size of a page in KB in this computer?\n(A) 2 (B) 4 (C)8 (D) 16\n\nQ.53 What is the minimum number of page colours needed to guarantee that no two synonyms map to\ndifferent sets in the processor cache of this computer?\n\n(A) 2 (B) 4 (C) 8 (D) 16\nStatement for Linked Answer Questions 54 and 55:\nRelation R has eight attributes ABCDEFGH. Fields of R contain only atomic values.\n\nF={CH-G, A—BC, B—CFH, E-A, F-EG} is a set of functional dependencies (FDs) so that F* is\nexactly the set of FDs that hold for R.\n\nQ.54 How many candidate keys does the relation R have?\n(A) 3 (B) 4 (C)5 (D) 6\n\nQ.55 The relation R is\n\n(A) in INF, but not in 2NF. (B) in 2NF, but not in 3NF.\n(C) in 3NF, but not in BCNF. (D) in BCNF.\n\nCS-A 12/20\n\n\n--- PAGE 12 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. -\n\nCS\n\nGeneral Aptitude (GA) Questions\n\nQ.56 to Q.60 carry one mark each.\n\nQ.56\n\nQ.57\n\nQ.58\n\nQ.59\n\nQ.60\n\nWhich one of the following options is the closest in meaning to the word given below?\n\nNadir\n(A) Highest (B) Lowest (C) Medium\n\nComplete the sentence:\nUniversalism is to particularism as diffuseness is to\n\n(A) specificity (B) neutrality (C) generality\n\nWhat will be the maximum sum of 44, 42, 40, ...... ?\n\n(A) 502 (B) 504 (C) 506\nWere you a bird, you in the sky.\n(A) would fly (B) shall fly (C) should fly\n\nChoose the grammatically INCORRECT sentence:\n\n(A) He is of Asian origin.\n\n(B) They belonged to Africa.\n\n(C) She is an European.\n\n(D) They migrated from India to Australia.\n\nQ.61 to Q.65 carry two marks each.\n\nQ.61\n\nQ.62\n\nCS-A\n\nFind the sum of the expression\n\n1 1 1 1\na sn a od\nVitv2 V¥24+V3 V34+V4 V80 +81\n(A)7 (B) 8\n(C) 9 (D) 10\n\n(D) Integration\n\n(D) adaptation\n\n(D) 500\n\n(D) shall have flown\n\nOut of all the 2-digit integers between 1 and 100, a 2-digit number has to be selected at random.\n\nWhat is the probability that the selected number is not divisible by 7?\n\n(A) 13/90 (B) 12/90 (C) 78/90\n\n(D) 77/90\n\n13/20\n\n\n--- PAGE 13 ---\n\n2013\n\nCOMPUTER SCIENCE & INFORMATION TECH. - CS\n\nQ.63\n\nQ.64\n\nQ.65\n\nCS-A\n\nAfter several defeats in wars, Robert Bruce went in exile and wanted to commit suicide. Just before\ncommitting suicide, he came across a spider attempting tirelessly to have its net. Time and again,\nthe spider failed but that did not deter it to refrain from making attempts. Such attempts by the\nspider made Bruce curious. Thus, Bruce started observing the near-impossible goal of the spider to\nhave the net. Ultimately, the spider succeeded in having its net despite several failures. Such act of\nthe spider encouraged Bruce not to commit suicide. And then, Bruce went back again and won\nmany a battle, and the rest is history.\n\nWhich one of the following assertions is best supported by the above information?\n\n(A) Failure is the pillar of success.\n\n(B) Honesty is the best policy.\n\n(C) Life begins and ends with adventures.\n(D) No adversity justifies giving up hope.\n\nA tourist covers half of his journey by train at 60 km/h, half of the remainder by bus at 30 km/h and\nthe rest by cycle at 10 km/h. The average speed of the tourist in km/h during his entire journey is\n(A) 36 (B) 30 (C) 24 (D) 18\n\nThe current erection cost of a structure is Rs. 13,200. If the labour wages per day increase by 1/5 of\n\nthe current wages and the working hours decrease by 1/24 of the current period, then the new cost\nof erection in Rs. is\n\n(A) 16,500 (B) 15,180 (C) 11,000 (D) 10,120\n\nEND OF THE QUESTION PAPER\n\n14/20\n\n\n--- PAGE 14 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\n\nSpace for Rough Work\n\nCS-A 15/20\n\n\n--- PAGE 15 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\n\nSpace for Rough Work\n\nCS-A 16/20\n\n\n--- PAGE 16 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\n\nSpace for Rough Work\n\nCS-A 17/20\n\n\n--- PAGE 17 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\n\nSpace for Rough Work\n\nCS-A 18/20\n\n\n--- PAGE 18 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\n\nSpace for Rough Work\n\nCS-A 19/20\n\n\n--- PAGE 19 ---\n\n2013 COMPUTER SCIENCE & INFORMATION TECH. - CS\n\nSpace for Rough Work\n\nCS-A 20/20\n\n\n--- PAGE 20 ---\n\n"
}