{
    "source_pdf": "GATE_2011_CS.pdf",
    "extracted_text": "2011 Question Booklet Code—> A\nCS : COMPUTER SCIENCE & INFORMATION TECHNOLOGY\nDuration: Three Hours Maximum Marks: 100\n\nRead the following instructions carefully.\n\n1.\n2.\n\n10.\n\n11.\n12.\n\nCS-A\n\nDo not open the seal of the Question Booklet until you are asked to do so by the invigilator.\n\nTake out the Optical Response Sheet (ORS) from this Question Booklet without breaking the seal.\nIf you find that the Question Booklet Code printed at the right hand top corner of this page does not\nmatch with the Booklet Code on the ORS, exchange the booklet immediately with a new sealed\nQuestion Booklet.\n\nWrite your registration number, your name and name of the examination centre at the specified\nlocations on the right half of the ORS. Also, using HB pencil, darken the appropriate bubble under\neach digit of your registration number and the letters corresponding to your test paper code (CS).\n\nWrite your name and registration number in the space provided at the bottom of this page.\n\nThis Booklet contains 20 pages including blank pages for rough work. After opening the seal at the\nspecified time, please check all pages and report discrepancy, if any.\n\nThere are a total of 65 questions carrying 100 marks. All these questions are of objective type.\nQuestions must be answered on the left hand side of the ORS by darkening the appropriate bubble\n(marked A, B, C, D) using HB pencil against the question number. For each question darken the\nbubble of the correct answer. In case you wish to change an answer, erase the old answer\ncompletely. More than one answer bubbled against a question will be treated as an incorrect response.\n\nQuestions Q.1 — Q.25 carry 1-mark each, and questions Q.26 — Q.55 carry 2-marks each.\n\nQuestions Q.48 — Q.51 (2 pairs) are common data questions and question pairs (Q.52, Q.53) and\n(Q.54, Q.55) are linked answer questions. The answer to the second question of the linked answer\nquestions depends on the answer to the first question of the pair. If the first question in the linked pair\nis wrongly answered or is unattempted, then the answer to the second question in the pair will not be\nevaluated.\n\nQuestions Q.56 — Q.65 belong to General Aptitude (GA). Questions Q.56 — Q.60 carry 1-mark each,\nand questions Q.61 — Q.65 carry 2-marks each. The GA questions begin on a fresh page starting from\npage 16.\n\nUnattempted questions will result in zero mark and wrong answers will result in NEGATIVE marks.\nFor Q.1 — Q.25 and Q.56 — Q.60, % mark will be deducted for each wrong answer. For Q.26 — Q.51\nand Q.61 — Q.65, % mark will be deducted for each wrong answer. The question pairs (Q.52, Q.53),\nand (Q.54, Q.55) are questions with linked answers. There will be negative marks only for wrong\nanswer to the first question of the linked answer question pair, i.e. for Q.52 and Q.54, % mark will be\ndeducted for each wrong answer. There is no negative marking for Q.53 and Q.55.\n\nCalculator is allowed whereas charts, graph sheets or tables are NOT allowed in the examination hall.\n\nRough work can be done on the question paper itself. Additionally, blank pages are provided at the\nend of the question paper for rough work.\n\na\n\n1/20\n\n\n--- PAGE 1 ---\n\n2011\n\nCS\n\nQ. 1 - Q. 25 carry one mark each.\n\nQl\n\nQ.2\n\nQ.3\n\nQ.4\n\nQ.5\n\nQ.6\n\nIn a compiler, keywords of a language are recognized during\n\n(A) parsing of the program (B) the code generation\n(C) the lexical analysis of the program (D) dataflow analysis\n\nA layer-4 firewall (a device that can look at all protocol headers up to the transport layer) CANNOT\n\n(A) block entire HTTP traffic during 9:00PM and 5:00AM\n\n(B)_ block all ICMP traffic\n\n(C) stop incoming traffic from a specific IP address but allow outgoing traffic to the same IP\naddress\n\n(D) block TCP traffic from a specific user on a multi-user system during 9:00PM and 5:00AM\n\nIf two fair coins are flipped and at least one of the outcomes is known to be a head, what is the\nprobability that both outcomes are heads?\n\n(A) 1/3 (B) 1/4 (C) 1/2 (D) 2/3\nConsider different activities related to email.\n\nm1: Send an email from a mail client to a mail server\nm2: Download an email from mailbox server to a mail client\nm3: Checking email in a web browser\n\nWhich is the application level protocol used in each activity?\n\n(A)ml: HTTP m2:SMTP- m3: POP\n\n(B)ml: SMTP m2: FTP m3: HTTP\n(C)ml: SMTP m2: POP m3: HTTP\n(D) m1: POP m2: SMTP m3: IMAP\n\nA company needs to develop a strategy for software product development for which it has a choice\nof two programming languages L1 and L2. The number of lines of code (LOC) developed using L2\nis estimated to be twice the LOC developed with L1. The product will have to be maintained for\nfive years. Various parameters for the company are given in the table below.\n\nMan years needed for development LOC/10000 LOC/10000\n\nDevelopment Cost per man year = 10,00,000 F 7,50,000\n\nMaintenance time 5 years 5 years\n\nCost of maintenance per year F 1,00,000 t 50,000\n\nTotal cost of the project includes cost of development and maintenance. What is the LOC for L1 for\nwhich the cost of the project using L1 is equal to the cost of the project using L2?\n\n(A) 4000 © (B) 5000 (C) 4333 (D) 4667\nLet the time taken to switch between user and kernel modes of execution be t; while the time taken\n\nto switch between two processes be t2. Which of the following is TRUE?\n\n(A) t) >b\n(B) t)=h\n(C) t) <t\n(D) nothing can be said about the relation between f, and f5\n\nCS-A\n\n2/20\n\n\n--- PAGE 2 ---\n\n2011\n\nQ.7\n\nQ.8\n\nQ.9\n\nQ.10\n\nQ.11\n\nCS-A\n\ncs\nA company needs to develop digital signal processing software for one of its newest inventions. The\n\nsoftware is expected to have 40000 lines of code. The company needs to determine the effort in\nperson-months needed to develop this software using the basic COCOMO model. The multiplicative\nfactor for this model is given as 2.8 for the software development on embedded systems, while the\nexponentiation factor is given as 1.20. What is the estimated effort in person -months?\n\n(A) 234.25 (B) 932.50 (C) 287.80 (D) 122.40\n\nWhich of the following pairs have DIFFERENT expressive power?\n\n(A) Deterministic finite automata (DFA) and Non-deterministic finite automata (NFA)\n\n(B) Deterministic push down automata (DPDA) and Non-deterministic push down automata\n(NPDA)\n\n(C) Deterministic single-tape Turing machine and Non-deterministic single-tape Turing machine\n\n(D) Single-tape Turing machine and multi-tape Turing machine\n\nHTML (HyperText Markup Language) has language elements which permit certain actions other\nthan describing the structure of the web document. Which one of the following actions is NOT\nsupported by pure HTML (without any server or client side scripting) pages?\n\n(A) Embed web objects from different sites into the same page\n(B) Refresh the page automatically after a specified interval\n(C) Automatically redirect to another page upon download\n\n(D) Display the client time as part of the page\n\nWhich one of the following is NOT desired in a good Software Requirement Specifications (SRS)\ndocument?\n\n(A) Functional Requirements (B) Non-Functional Requirements\n(C) Goals of Implementation (D) Algorithms for Software Implementation\n\nA computer handles several interrupt sources of which the following are relevant for this question.\ne Interrupt from CPU temperature sensor (raises interrupt if CPU temperature is too high)\ne Interrupt from Mouse (raises interrupt if the mouse is moved or a button is pressed)\ne Interrupt from Keyboard (raises interrupt when a key is pressed or released)\ne Interrupt from Hard Disk (raises interrupt when a disk read is completed)\nWhich one of these will be handled at the HIGHEST priority?\n\n(A) Interrupt from Hard Disk (B) Interrupt from Mouse\n(C) Interrupt from Keyboard (D) Interrupt from CPU temperature sensor\n\n3/20\n\n\n--- PAGE 3 ---\n\n2011\n\nQ.12\n\nQ.13\n\nQ.14\n\nQ.15\n\nQ.16\n\ncs\nConsider a relational table with a single record for each registered student with the following\nattributes.\n\n1. Registration_Num: Unique registration number of each registered student\n\n2. UID: Unique identity number, unique at the national level for each citizen\n\n3. BankAccount_Num: Unique account number at the bank. A student can have multiple\naccounts or joint accounts. This attribute stores the primary account number.\n\n4. Name: Name of the student\n\n5. Hostel_Room: Room number of the hostel\n\nWhich of the following options is INCORRECT?\n\n(A) BankAccount_Num is a candidate key\n\n(B) Registration_Num can be a primary key\n\n(C) UID is a candidate key if all students are from the same country\n\n(D) If S is a superkey such that S{)UID is NULL then S UUID is also a superkey\n\nWhich one of the following circuits is NOT equivalent to a 2-input XNOR (exclusive NOR) gate?\n\n(A) (B)\n(C) (D) |\n\n=)>\n\nThe simplified SOP (Sum of Product) form of the Boolean expression\n(P+0 +R).(P+O+R).(P+O+R) is\n\n(A) (P.O +R) (B) (P+OR)\n(C) (P.0+R) (D) (P.0+ R)\n\nThe minimum number of D flip-flops needed to design a mod-258 counter is\n(A) 9 (B) 8 (C) 512 (D) 258\n\nA thread is usually defined as a “light weight process” because an operating system (OS) maintains\nsmaller data structures for a thread than for a process. In relation to this, which of the following is\nTRUE?\n\n(A) On per-thread basis, the OS maintains only CPU register state\n\n(B) The OS does not maintain a separate stack for each thread\n\n(C) On per-thread basis, the OS does not maintain virtual memory state\n\n(D) On per-thread basis, the OS maintains only scheduling and accounting information\n\nSSeS\n4/20\n\nCS-A\n\n\n--- PAGE 4 ---\n\n2011\n\nQ.17\n\nQ.18\n\nQ.19\n\nQ.20\n\nQ.21\n\nQ.22\n\nCS-A\n\nCS\n\nK4 and Q3 are graphs with the following structures.\n\nK4 Q3\n\nWhich one of the following statements is TRUE in relation to these graphs?\n\n(A) K4 is planar while Q3 is not (B) Both K4 and Q3 are planar\n(C) Q3 is planar while K3 is not (D) Neither K4 nor Q3 is planar\n\nIf the difference between the expectation of the square of a random variable (£ [ x 2 ]) and the\nsquare of the expectation of the random variable (E [X l) is denoted by R , then\n(A) R=0 (B)R<O (C)R20 (D)R>0\n\nThe lexical analysis for a modern computer language such as Java needs the power of which one of\nthe following machine models in a necessary and sufficient sense?\n\n(A) Finite state automata\n\n(B) Deterministic pushdown automata\n\n(C) Non-deterministic pushdown automata\n(D) Turing machine\n\nLet the page fault service time be 10 ms in a computer with average memory access time being\n20 ns. If one page fault is generated for every 10° memory accesses, what is the effective access\ntime for the memory?\n\n(A) 21 ns (B) 30 ns (C) 23 ns (D) 35 ns\n\nConsider a hypothetical processor with an instruction of type LW R1, 20(R2 ), which during\nexecution reads a 32-bit word from memory and stores it in a 32-bit register R1. The effective\naddress of the memory location is obtained by the addition of a constant 20 and the contents of\nregister R2. Which of the following best reflects the addressing mode implemented by this\ninstruction for the operand in memory?\n\n(A) Immediate Addressing (B) Register Addressing\n(C) Register Indirect Scaled Addressing (D) Base Indexed Addressing\n\nWhat does the following fragment of C program print?\nChar c[] = “GATE2011”;\nchar *p = Cc;\nprintf (“ss”, p + p[3] - pl1]);\n\n(A) GATE2011 (B) E2011 (C) 2011 (D) 011\n\n5/20\n\n\n--- PAGE 5 ---\n\n2011 cs\nQ.23, A max-heap is a heap where the value of each parent is greater than or equal to the value of its\nchildren. Which of the following is a max-heap?\n\n(A) (B)\n\n(C) (D)\n\nQ.24 Let P bea regular language and Q be a context-free language such that Q C P.. (For example, let\n\nP be the language represented by the regular expression p*g*and Q be {p\"q\" |neé N}). Then\nwhich of the following is ALWAYS regular?\n\n(A) PNOQ (B) P-Q (C) 2°-P (D) 2*-Q\n\nQ.25 An algorithm to find the length of the longest monotonically increasing sequence of numbers in an\narray A[0:n—1] is given below.\nLet L, denote the length of the longest monotonically increasing sequence starting at index iin\nthe array.\nInitialize L,_, =1.\nFor all i such thatO<i<n-—2\nL- {\" L,,, if A[i]<A[i+1]\n\nu\n\n] Otherwise\n\nFinally the length of the longest monotonically increasing sequence is Max (Ly, Dyess L,1) .\nWhich of the following statements is TRUE?\n\n(A) The aigorithm uses dynamic programming paradigm\n\n(B) The algorithm has a linear complexity and uses branch and bound paradigm\n\n(C) The algorithm has a non-linear polynomial complexity and uses branch and bound paradigm\n(D) The algorithm uses divide and conquer paradigm.\n\nSSeS\nCS-A 6/20\n\n\n--- PAGE 6 ---\n\n2011\n\nCS\n\nQ. 26 to Q. 55 carry two marks each.\n\nQ.26\n\nQ.27\n\nCS-A\n\nConsider the languages L1, L2 and L3 as given below.\n\nL1={071\"| p, gE N},\n\nL2={0'1\"| p, qe Nand p=q} and\n\nL3={0°190\" | p, gq, r€ Nand p=q=r}. Which of the following statements is NOT TRUE?\n(A) Push Down Automata (PDA) can be used to recognize L1 and L2\n\n(B) L1 is a regular language\n\n(C) All the three languages are context free\n(D) Turing machines can be used to recognize all the languages\n\nConsider two binary operators ‘t’ and ‘|’ with the precedence of operator | being lower than that\nof the operator t. Operator f is right associative while operator | is left associative. Which one of\nthe following represents the parse tree for expression (7|37473|2)?\n\n(A) (B)\n\n(C) (D)\n\n7/20\n\n\n--- PAGE 7 ---\n\n2011 : cs\nQ.28 Ona non-pipelined sequential Processor, a program segment, which is a part of the interrupt service\nroutine, is given to transfer 500 bytes from an I/O device to memory.\n\nInitialize the address register\nInitialize the count to 500\nLOOP: Load a byte from device\nStore in memory at address given by address register\nIncrement the address register\nDecrement the count\nIf count != 0 go to LOOP\n\nAssume that each statement in this program is equivalent to a machine instruction which takes one\nclock cycle to execute if it is a non-load/store instruction. The load-store instructions take two clock\ncycles to execute.\n\nThe designer of the system also has an alternate approach of using the DMA controller to\nimplement the same transfer. The DMA controller requires 20 clock cycles for initialization and\nother overheads. Each DMA transfer cycle takes two clock cycles to transfer one byte of data from\nthe device to the memory.\n\nWhat is the approximate speedup when the DMA controller based design is used in place of the\ninterrupt driven program based input-output?\n\n(A) 3.4 (B) 4.4 (C) 5.1 (D) 6.7\n\nQ.29 We are given a set of ndistinct elements and an unlabeled binary tree with n nodes. In how many\nways can we populate the tree with the given set so that it becomes a binary search tree?\n\n(A) 0 (B) 1 (C) n! (D) +-”C,\nQ.30 Which one of the following options is CORRECT given three positive integers x, yand z,anda\npredicate\nP(x) = A(x = 1) A Vy(Ae(x = y*z) => (y= x) Vv (y =D)\n\n(A) P(x) being true means that xis a prime number\n\n(B) P(x) being true means that xis a number other than 1\n\n(C) P(x)is always true irrespective of the value of x\n\n(D) P(x) being true means that x has exactly two factors other than 1 and x\n\nm12 os\n. . . Li cos x +isin x\nQ31 Given i= V—1, what will be the evaluation of the definite integral } ———— dx?\n» COSx—isinx\n\n(A) 0 (B) 2 (C) -i (D) i\n\nCS\n\n\n\n--- PAGE 8 ---\n\n2011 cs\nQ.32 Consider a database table T containing two columns X and Y each of type integer. After the\ncreation of the table, one record (X=1, Y=1) is inserted in the table.\n\nLet MX and MY denote the respective maximum values of X and Y among all records in the table\nat any point in time. Using MX and MY, new records are inserted in the table 128 times with X and\nY values being MX+1, 2*MY+1 respectively. It may be noted that each time after the insertion,\nvalues of MX and MY change.\n\nWhat will be the output of the following SQL query after the steps mentioned above are carried\nout?\nSELECT Y FROM T WHERE X=7,\n\n(A) 127 (B) 255 (C) 129 (D) 257\n\nQ.33 Consider a finite sequence of random values X = [ X,,%7,---»%, ]. Let 2, be the mean and o, be\nthe standard deviation of X. Let another finite sequence Y of equal length be derived from this\nas y, = a* x, +b, where a and b are positive constants. Let Z, be the mean and o, be the standard\ndeviation of this sequence. Which one of the following statements is INCORRECT?\n\n(A) Index position of mode of X in X is the same as the index position of mode of Y in ¥.\n(B) Index position of median of X in X is the same as the index position of median of Yin Y.\n(C) MW, =au, +b\n\n(D) o, =ao, +b\n\nQ.34 A deck of 5 cards (each carrying a distinct number from 1 to 5) is shuffled thoroughly. Two cards\nare then removed one at a time from the deck. What is the probability that the two cards are\nselected with the number on the first card being one higher than the number on the second card?\n\n(A) 1/5 (B) 4/25 (C) 1/4 (D) 2/5\nQ.35 Consider the following table of arrival time and burst time for three processes PO, P1 and P2.\n\n[ Process | Arrival time | Burst Time |\n(PO |Oms | 9 ms\n\nThe pre-emptive shortest job first scheduling algorithm is used. Scheduling is carried out only at\narrival or completion of processes. What is the average waiting time for the three processes?\n\n(A) 5.0 ms (B) 4.33 ms (C) 6.33 ms (D) 7.33 ms\n\nTT ooo\nCS-A 9/20\n\n\n--- PAGE 9 ---\n\n2011 cs\n\nQ.36 Consider evaluating the following expression tree on a machine with load-store architecture in\nwhich memory can be accessed only through load and store instructions. The variables a, b,c, d\nand e are initially stored in memory. The binary operators used in this expression tree can be\nevaluated by the machine only when the operands are in registers. The instructions produce result\nonly in a register. If no intermediate results can be stored in memory, what is the minimum number\nof registers needed to evaluate this expression?\n\n(A) 2 (B) 9 (C) 5 (D) 3\n\nQ.37 Which of the given options provides the increasing order of asymptotic complexity of functions\n> Jo Sf and f, ?\n\nf,(n) = 2\" f(n) = n*”? f,(n)=n log, n f,(n) = nie\"\nA) fi hofol, B) fh hohohs\nOQ fA fv fol O) fh foh\n\nQ.38 Four matrices M,, M,, M, and M, of dimensions PXq, qXr, rXs and sXt respectively\ncan be multiplied in several ways with different number of total scalar multiplications. For example\nwhen multiplied as ((M,xM,)x(M 3XM,)), the total number of scalar multiplications is\npqrtrst+ prt. When multiplied as ((M,xM,)xM,)xM 4)> the total number of scalar\nmultiplications is pgr+ prs+ pst.\n\nIf p=10, q=100, r= 20, s =5, and t =80, then the minimum number of scalar multiplications\nneeded is\n(A) 248000 (B) 44000 (C) 19000 (D) 25000\n\nQ.39 Consider a relational table r with sufficient number of records, having attributes A,,A,,...,A, and\nlet 1 <p <n. Two queries Q1 and Q2 are given below.\n\nerst\n\n¢q\n\nQ2: Hy a, (0, SA,SCy (r)) where c, and c2 are constants\n\nThe database can be configured to do ordered indexing on A, or hashing on A,. Which of the\nfollowing statements is TRUE?\n\n(A) Ordered indexing will always outperform hashing for both queries\n\n(B) Hashing will always outperform ordered indexing for both queries\n\n(C) Hashing will outperform ordered indexing on Q1, but not on Q2\n(D) Hashing will outperform ordered indexing on Q2, but not on QI\n\nCS-A 10/20\n\n\n--- PAGE 10 ---\n\n2011 CS\n\nQ.40 Consider the matrix as given below.\n\n1 2 3\n\n0 4 7\n\n0 0 3\nWhich one of the following options provides the CORRECT values of the eigenvalues of the\nmatrix?\n(A) 1, 4, 3 (B) 3, 7, 3 (C) 7, 3,2 (D) 1, 2,3\n\nQ.41 Consider an instruction pipeline with four stages (S1, S2, S3 and S4) each with combinational\ncircuit only. The pipeline registers are required between each stage and at the end of the last stage.\nDelays for the stages and for the pipeline registers are as given in the figure.\n\nco > > >\nwn no no no\nc c c c\n_— _ - _-\n> > > >\n& & & &\no o o o\na) a) (a) ja)\n~— ~ ~~ ~~\n— ra — ~\noO o i) ®\n~ 4 ~ _\n2 2D 2 | 2\nD D yD D\n3) oO oO o\noc ao o oc\noO Oo o oO\n= = £& £\nOo oO cy Oo\n2. Q. 2 Q.\noO oO oO a\n\nWhat is the approximate speed up of the pipeline in steady state under ideal conditions when\ncompared to the corresponding non-pipeline implementation?\n\n(A) 4.0 (B) 2.5 (C) 1.1 (D) 3.0\nQ.42 Definition of a language L with alphabet {a} is given as following.\nL= {a™ |k >0, and n is a positive integer constant}\nWhat is the minimum number of states needed in a DFA to recognize L?\n\nQ.43. An 8KB direct-mapped write-back cache is organized as multiple blocks, each of size 32-bytes. The\nprocessor generates 32-bit addresses. The cache controller maintains the tag information for each\ncache block comprising of the following.\n\n1 Valid bit\n1 Modified bit\nAs many bits as the minimum needed to identify the memory block mapped in the cache.\n\nWhat is the total size of memory needed at the cache controller to store meta-data (tags) for the\ncache?\n\n(A) 4864 bits (B) 6144 bits (C) 6656 bits (D) 5376 bits\n\nQ.44. An application loads 100 libraries at startup. Loading each library requires exactly one disk access.\nThe seek time of the disk to a random location is given as 10 ms. Rotational speed of disk is\n6000 rpm. If all 100 libraries are loaded from random locations on the disk, how long does it take to\nload all libraries? (The time to transfer data from the disk block once the head has been positioned\nat the start of the block may be neglected.)\n\n(A) 0.50 s (B) 1.50s (C) 1.25 s (D) 1.00 s\n\nae ttEttyttttyEE SISSIES\n\nCS-A 11/20\n\n\n--- PAGE 11 ---\n\n2011\n\nCS\n\nQ.45\n\nQ.46\n\nCS-A\n\nA deterministic finite automaton (DFA) D with alphabet > = {a,b} is given below.\n\nWhich of the foliowing finite state machines is a valid minimal DFA which accepts the same\nlanguage as D?\n\n(A) (B)\n\n(C) (D)\n\nDatabase table by name Loan_Records is given below.\n\n1000.00\nRamgopal 5000.00\n7000.00\n\nWhat is the output of the following SQL query?\n\nSELECT count(*)\nFROM (\n(SELECT Borrower, Bank_Manager FROM Loan_Records) AS S\nNATURAL JOIN\n(SELECT Bank_Manager, Loan_Amount FROM Loan_Records) AS T\n)s\n\n(A) 3 (B) 9 (C)5 (D) 6\n\n12/20\n\n\n--- PAGE 12 ---\n\n2011\n\nQ.47\n\nCS-A\n\nCS\nThe following is the comment written for a C function.\n/* This function computes the roots of a quadratic equation\na.x*2 + b.x + c = 0. The function stores two real roots\nin *rootl and *root2 and returns the status of validity\nof roots. It handles four different kinds of cases.\n(i) When coefficient a is zero irrespective of discriminant\n(ii) When discriminant is positive\n(iii) When discriminant is zero\n(iv) When discriminant is negative.\nOnly in case (ii) and (iii), the stored roots are valid.\nOtherwise 0 is stored in the roots. The function returns\n0 when the roots are valid and -1 otherwise.\nThe function also ensures rootl >= root2.\nint get_QuadRoots(float a, float b, float c,\nfloat *rootl1, float *root2);\n*/\nA software test engineer is assigned the job of doing black box testing. He comes up with the\nfollowing test cases, many of which are redundant.\n\nWhich one of the following options provide the set of non-redundant tests using equivalence class\npartitioning approach from input perspective for black box testing?\n\n(A) T1, T2, T3, T6 (B) T1, T3, T4, TS\n(C) T2, T4, T5, T6 (D) T2, T3, T4, TS\n\n13/20\n\n\n\n--- PAGE 13 ---\n\n2011 CS\nCommon Data Questions\n\nCommon Data for Questions 48 and 49:\nConsider the following recursive C function that takes two arguments.\n\nunsigned int foo(unsigned int n, unsigned int r) {\nif (n>0O) return ((n%r) + foo(n/r, r));\nelse return 0;\n\n}\nQ.48 — What is the return value of the function foo when it is called as f00(345, 10)?\n(A) 345 (B) 12 (C)5 (D) 3\nQ.49 What is the return value of the function £oo when it is called as foo (513, 2)?\n\n(A) 9 (B) 8 (C) 5 (D) 2\n\nCommon Data for Questions 50 and 51:\nConsider the following circuit involving three D-type flip-flops used in a certain type of counter\nconfiguration.\n\nQ.50 If at some instance prior to the occurrence of the clock edge, P, Q and R have a value 0, 1 and 0\nrespectively, what shall be the value of POR after the clock edge?\n\n(A) 000 (B) 001 (C) 010 (D) 011\n\nQ.51 If all the flip-flops were reset to 0 at power on, what is the total number of distinct outputs (states)\nrepresented by POR generated by the counter?\n\n(A) 3 (B)4 (C)5 (D) 6\n\nCS-A 14/20\n\n\n\n--- PAGE 14 ---\n\n2011 CS\nLinked Answer Questions\n\nStatement for Linked Answer Questions 52 and 53:\nConsider a network with five nodes, N1 to N5, as shown below.\n\nThe network uses a Distance Vector Routing protocol. Once the routes have stabilized, the distance vectors\nat different nodes are as following.\n\nN1: (0, 1, 7, 8, 4)\n\nN2: (1, 0, 6, 7, 3)\n\nN3: (7, 6, 0, 2, 6)\n\nN4: (8, 7, 2, 0, 4)\n\nNS: (4, 3, 6, 4, 0)\nEach distance vector is the distance of the best known path at that instance to nodes, N1 to N5, where the\ndistance to itself is 0. Also, all links are symmetric and the cost is identical in both directions. In each\nround, all nodes exchange their distance vectors with their respective neighbors. Then all nodes update\ntheir distance vectors. In between two rounds, any change in cost of a link will cause the two incident\nnodes to change only that entry in their distance vectors.\n\nQ.52 The cost of link N2-N3 reduces to 2 (in both directions). After the next round of updates, what will\nbe the new distance vector at node, N3?\n(A) (3, 2, 0, 2, 5) (B) (3, 2, 0, 2, 6) (C) (7, 2, 0, 2, 5) (D) (7, 2, 0, 2, 6)\n\nQ.53 After the update in the previous question, the link N1-N2 goes down. N2 will reflect this change\n\nimmediately in its distance vector as cost, 0. After the NEXT ROUND of update, what will be the\ncost to N1 in the distance vector of N3?\n\n(A) 3 (B) 9 (C) 10 (D) 0\nStatement for Linked Answer Questions 54 and 55:\n\nAn undirected graph G(V,E) contains n (n>2) nodes named v,,V,,...,V,- Two nodes v,,v, are\n\nconnected if and only if 0 <| i-j | <2. Each edge (y;,V;) 1s assigned a weight i + j. A sample graph with\nn= 4 is shown below.\n\nQ.54 What will be the cost of the minimum spanning tree (MST) of such a graph with n nodes?\n\n(A) $(UIin*-5n) ©) n—ntl (C) 6n—-11 (D) 2n+1\nQ.55 The length of the path from v, to v, in the MST of previous question with n = 10 is\n(A) Il (B) 25 (C) 31 (D) 41\n\nCS-A 15/20\n\n\n--- PAGE 15 ---\n\n2011\n\nCS\n\nGeneral Aptitude (GA) Questions\n\nQ. 56 — Q. 60 carry one mark each.\n\nQ.56\n\nQ.57\n\nQ.58\n\nQ.59\n\nQ.60\n\nWhich of the following options is the closest in the meaning to the word below:\nInexplicable\n\n(A) Incomprehensible\n(B) Indelible\n\n(C) Inextricable\n\n(D) Infallible\n\nIf Log (P) = (1/2)Log (Q) = (1/3) Log (R), then which of the following options is TRUE?\n(A) P? = Q°R’ (B) Q’=PR (C) @=R’P (D) R=P°\n\nChoose the most appropriate word(s) from the options given below to complete the following\nsentence.\nI contemplated Singapore for my vacation but decided against it.\n\n(A) to visit\n\n(B) having to visit\n(C) visiting\n\n(D) for a visit\n\nChoose the most appropriate word from the options given below to complete the following\nsentence.\n\nIf you are trying to make a strong impression on your audience, you cannot do so by being\nunderstated, tentative or\n\n(A) hyperbolic\n(B) restrained\n\n(C) argumentative\n(D) indifferent\n\nChoose the word from the options given below that is most nearly opposite in meaning to the given\nword:\nAmalgamate\n\n(A) merge\n(B) split\n(C) collect\n(D) separate\n\nQ. 61 to Q. 65 carry two marks each.\n\nQ.61\n\nFew school curricula include a unit on how to deal with bereavement and grief, and yet all\nstudents at some point in their lives suffer from losses through death and parting.\n\nBased on the above passage which topic would not be included in a unit on bereavement?\n\n(A) how to write a letter of condolence\n\n(B) what emotional stages are passed through in the healing process\n(C) what the leading causes of death are\n\n(D) how to give support to a grieving friend\n\nne eee\n16/20\n\nCS-A\n\n\n\n--- PAGE 16 ---\n\n2011\n\nQ.62\n\nQ.63\n\nQ.64\n\nQ.65\n\nCS-A\n\nCS\n\nP, Q, R and S are four types of dangerous microbes recently found in a human habitat. The area of\neach circle with its diameter printed in brackets represents the growth of a single microbe surviving\nhuman immunity system within 24 hours of entering the body. The danger to human beings varies\nproportionately with the toxicity, potency and growth attributed to a microbe shown in the figure\nbelow:\n\n1000\n\nP (50 mm)\n800\n\n600 —\n\nQ (40 mm)\n400 —]\nR (30 mm) it\n\nS (20 mm)\n\n200\n\nToxicity\n(milligrams of microbe required to destroy\nhalf of the body mass in kilograms)\n\n0\n0.2 0.4 0.6 0.8 1\n\nPotency\n(Probability that microbe will overcome human immunity system)\n\nA pharmaceutical company is contemplating the development of a vaccine against the most\ndangerous microbe. Which microbe should the company target in its first attempt?\n\n(A) P (B)Q (C)R (D)S\n\nThe variable cost (V) of manufacturing a product varies according to the equation V= 4q, where q\nis the quantity produced. The fixed cost (F) of production of same product reduces with q according\nto the equation F = 100/q. How many units should be produced to minimize the total cost (V+F)?\n\n(A)5 (B)4 (C)7 (D) 6\n\nA transporter receives the same number of orders each day. Currently, he has some pending orders\n(backlog) to be shipped. If he uses 7 trucks, then at the end of the 4th day he can clear all the\norders. Alternatively, if he uses only 3 trucks, then all the orders are cleared at the end of the 10th\nday. What is the minimum number of trucks required so that there will be no pending order at the\nend of the 5th day?\n\n(A) 4 (B)5 (C) 6 (D) 7\nA container originally contains 10 litres of pure spirit. From this container 1 litre of spirit is\n\nreplaced with 1 litre of water. Subsequently, 1 litre of the mixture is again replaced with 1 litre of '\nwater and this process is repeated one more time. How much spirit is now left in the container?\n\n(A) 7.58 litres (B) 7.84 litres (C) 7 litres (D) 7.29 litres\n\nEND OF THE QUESTION PAPER\n\n17/20\n\n\n--- PAGE 17 ---\n\n"
}