{
    "source_pdf": "GATE_2020_CS.pdf",
    "extracted_text": "r-\n\nInformation Brochure GATE International Pre Examination Important Dates Contact Us\n\nCS: Computer Sc. and Information Technology\n\nGA - General Aptitude\n\nQ.No. 1\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 2\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 3\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 4\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 5\n\nQ1 - Q5 carry one mark each.\n\nRaman is confident of speaking English six months as he has been practising\nregularly the last three weeks.\n\nduring, for\nfor, since\nfor, in\n\nwithin, for\n\nHis knowledge of the subject was excellent but his classroom performance was\nextremely poor\ngood\n\ndesirable\npraiseworthy\n\nSelect the word that fits the analogy:\n\nCook: Cook:: Fly: |\nFlyer\n\nFlying\n\nFlew\n\nFlighter\n\nThe dawn of the 21st century witnessed the melting glaciers oscillating between giving too\nmuch and too little to billions of people who depend on them for fresh water. The UN\nclimate report estimates that without deep cuts to man-made emissions, at least 30% of the\nnorthern hemisphere’s surface permafrost could melt by the end of the century. Given this\nsituation of imminent global exodus of billions of people displaced by rising seas, nation-\nstates need to rethink their carbon footprint for political concerns, if not for environmental\nones.\n\nWhich one of the following statements can be inferred from the given passage?\n\nNation-states do not have environmental concerns.\nNation-states are responsible for providing fresh water to billions of people.\n\nBillions of people are responsible for man-made emissions.\nBillions of people are affected by melting glaciers.\n\n\n\n--- PAGE 1 ---\n\n(A)\n(B)\n(C)\n(D)\n\nThere are multiple routes to reach from node | to node 2, as shown in the network.\n\nThe cost of travel on an edge between two nodes is given in rupees. Nodes ‘a’, *b’, “ce”, “d’,\n*e’, and ‘f are toll booths. The toll price at toll booths marked ‘a’ and ‘e’ is Rs. 200, and is\nRs. 100 for the other toll booths. Which is the cheapest route from node | to node 2?\n]-a-c-2\n\n1-f-b-2\n\n1-b-2\n\n1-f-e-2\n\nQ6 - Q10 carry two marks each.\n\nQ.No. 6\n\n(B)\n(C)\n\n(D)\n\nQ.No. 7\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 8\n\nGoods and Services Tax (GST) is an indirect tax introduced in India in 2017 that is\nimposed on the supply of goods and services, and it subsumes all indirect taxes except few.\nIt is a destination-based tax imposed on goods and services used, and it is not imposed at\nthe point of origin from where goods come. GST also has a few components specific to\nstate governments, central government and Union Territories (UTs).\n\nWhich one of the following statements can be inferred from the given passage?\nGST is imposed on the production of goods and services.\n\nGST includes all indirect taxes.\nGST does not have a component specific to UT.\n\nGST is imposed at the point of usage of goods and services.\n\nIf P=3, R = 27, T= 243, thenQ+S=\n40\n80\n90\n110\n\n\n--- PAGE 2 ---\n\n(A)\n\n(B)\n(C)\n\n(D)\n\nQ.No. 9\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 10\n\n(A)\n\n(B)\n(C)\n\nThe figure below shows an annular ring with outer and inner radii as 6 and a, respectively.\nThe annular space has been painted in the form of blue colour circles touching the outer\nand inner periphery of annular space. If maximum 7 number of circles can be painted, then\nthe unpainted area available in annular space is\n\nm|(b? - a?) -=(b—a)?|\nm[(b? — a?) — n(b— a)?]\n|(b? - a) +=(b-a)?|\nm[(b? — a?) + n(b — a)?]\n\nTwo straight lines are drawn perpendicular to each other in X-Y plane. If a and f are the\nacute angles the straight lines make with the X-axis, then@a+fis _.\n\n60°\n\n90°\n\n120°\n\n180°\n\nThe total revenue of a company during 2014-2018 is shown in the bar graph. If the total\nexpenditure of the company in each year is 500 million rupees, then the aggregate profit or\nloss (in percentage) on the total expenditure of the company during 2014-2018 is .\n\n900\n\n800\n\no S&S ¢\nco c& &\n\nmem we £& oA AH\no 8S\n=o &\n\nS\noS\n\nRevenue (In million rupees)\n\n100\n\n2014 2015 2016 2017 2018\nYear\n16.67 % profit\n16.67 % lass\n20 % profit\n\n\n\n--- PAGE 3 ---\n\n(D)\n\n20 % loss\n\nCS: Computer Sc. and Information Technology\n\nQ1 - Q25 carry one mark each.\n\nQ.No. 1\n\n(B)\n(C)\n(D)\n\nQ.No. 2\n\n(B)\n(C)\n(D)\n\nQ.No. 3\n\n(B)\n(C)\n(D)\n\nQ.No. 4\n\nConsider the functions\n\nI e*\nIl. x*—sinx\n\nIll. x? +1\n\nWhich of the above functions is/are increasing everywhere in [0,1]?\nIL only\n\nII only\n\nIl and III only\n\nland III only\n\nFor parameters aand b, both of which are @(1), T(n)=T(n\"\")+1, and T(b)=1.\nThen T(#) is\n\n(log, log, n)\n\nO(log, 7)\n\n(log, log, n)\n\nO(log, log, m)\n\nConsider the following statements.\n\nI. Daisy chaining is used to assign priorities in attending interrupts.\nII. When a device raises a vectored interrupt, the CPU does polling to identify\nthe source of interrupt.\nIII. In polling, the CPU periodically checks the status bits to know if any device\nneeds its attention.\nIV. During DMA, both the CPU and DMA controller can be bus masters at the\n\nsame time.\n\nWhich of the above statements is/are TRUE?\nland II only\n\nland IV only\n\nI and II only\n\nIL only\n\n\n\n--- PAGE 4 ---\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 5\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 6\n\n(A)\n\n(B)\n\n(C)\n(D)\n\nQ.No. 7\n\n(B)\n\nConsider the following data path diagram.\n\nConsider an instruction: RO © R1 + R2. The following steps are used to execute\nit over the given data path. Assume that PC is incremented appropriately. The\n\nsubscripts r and w indicate read and write operations, respectively.\n\nR2,, TEMP1,, ALUada, TEMP2\nRl; TEMP 1\n\nPC,;, MARy, MEM,\n\nTEMP2,, ROw\n\nMDR,. IRw\n\nBehe\n\nWhich one of the following is the correct order of execution of the above steps?\n2, 1,.4,.5,3\n1,254,355\n3,5, 25 1,4\n3, 5,152.4\n\nThe preorder traversal of a binary search tree is 15, 10, 12, 11, 20, 18, 16, 19.\n\nWhich one of the following is the postorder traversal of the tree?\n10, 11, 12, 15, 16, 18, 19, 20\n11, 12, 10, 16, 19, 18, 20, 15\n20, 19, 18, 16, 15, 12, 11, 10\n19, 16, 18, 20, 11, 12, 10, 15\n\nWhat is the worst case time complexity of inserting n? elements into an AVL-tree\nwith n elements initially?\n\n@(n*)\n\nQ(n?)\n\nO(n? log n)\n\n@(n3)\n\nWhich one of the following regular expressions represents the set of all binary\nstrings with an odd number of 1’s?\n\n((O + 1)*1(0 + 1)*1)°10*\n\n(0°10°10*)*0\"1\n\n\n\n--- PAGE 5 ---\n\n(C)\n(D)\n\nQ.No. 8\n\n(B)\n(C)\n(D)\n\nQ.No. 9\n\n(B)\n(C)\n(D)\n\nQ.No. 10\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 11\n\n(A)\n\n10°(0°10°10*)*\n(0°10°10*°)*10°\n\nConsider the following statements.\n\nI. If L, U Lp is regular, then both L, and Lz must be regular.\n\nII. The class of regular languages is closed under infinite union.\n\nWhich of the above statements is/are TRUE?\nlonly\nIl only\n\nBoth | and II\nNeither I nor IL\n\nConsider the following statements.\n\nI. Symbol table is accessed only during lexical analysis and syntax analysis.\nIl. Compilers for programming languages that support recursion necessarily\nneed heap storage for memory allocation in the run-time environment.\nIl. Errors violating the condition ‘any variable must be declared before its\n\nuse’ are detected during syntax analysis.\n\nWhich of the above statements is/are TRUE?\nl only\n\nI and II only\n\nIl only\n\nNone of I, [I], and III\n\nConsider the language L= {a\"|n > 0}U {a\"b\"|n = 0} and the following\n\nstatements.\n\nI. Lis deterministic context-free.\nIl. £ is context-free but not deterministic context-free.\n\nIll. ZL is not LL(&) for any &.\n\nWhich of the above statements is/are TRUE?\nl only\n\nIl only\n\nland III only\n\nIL only\n\nConsider allocation of memory to a new process. Assume that none of the existing\nholes in the memory will exactly fit the process’s memory requirement. Hence, a\nnew hole of smaller size will be created if allocation is made in any of the existing\nholes. Which one of the following statements is TRUE?\n\nThe hole created by first fit is always larger than the hole created by next fit.\n\n\n\n--- PAGE 6 ---\n\n(B) The hole created by worst fit is always larger than the hole created by first fit.\n(C) The hole created by best fit is never larger than the hole created by first fit.\n(D) The hole created by next fit is never larger than the hole created by best fit.\n\nQ.No.12 Consider the following statements about process state transitions for a system\n\nusing preemptive scheduling.\n\nI. A running process can move to ready state.\nIl. A ready process can move to running state.\nIII. A blocked process can move to running state.\n\nIV. A blocked process can move to ready state.\n\nWhich of the above statements are TRUE?\n\n(A) I, IL, and Il] only\n(B) Il and HI only\n(C) I, IL, and IV only\n(D) 1, IL, U1, and IV\n\nQ.No. 13 Consider a relational database containing the following schemas.\n\nCatalogue Suppliers\n\nsno | pno cost sno | sname location\nSl | M/s Royal furniture Delhi\n$2 | M/s Balaji furniture Bangalore\n$3 | M/s Premium furniture Chennai\n\nParts\npno | pname part_spec\nPl | Table Wood\nf P2 | Chair Wood\n\n33 p4 250 P3 | Table Steel\nP4 | Almirah Steel\nPS | Almirah Wood\n\nThe primary key of each table is indicated by underlining the constituent fields.\n\nSELECT s.sno, s.sname\nFROM Suppliers s, Catalogue c\nWHERE s.sno = c.sno AND\ncost > (SELECT AVG (cost)\nFROM Catalogue\nWHERE pno = ‘P4'\nGROUP BY pno);\nThe number of rows returned by the above SQL query is\n(A) 4\n\n(B) 5\n(C) 0\n\n\n\n--- PAGE 7 ---\n\n(D)\n\nQ.No.\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No.\n\n(B)\n(C)\n(D)\n\nQ.No.\n\n(B)\n(C)\n(D)\n\nQ.No.\n\n14\n\n15\n\n16\n\n. 20\n\n. 21\n\n2\n\nWhich one of the following is used to represent the supporting many-one\n\nrelationships of a weak entity set in an entity-relationship diagram?\n\nDiamonds with double/bold border\nRectangles with double/bold border\n\nOvals with double/bold border\nOvals that contain underlined identifiers\n\nConsider the following statements about the functionality of an IP based router.\n\nI. A router does not modify the IP packets during forwarding.\nII. Itis not necessary for a router to implement any routing protocol.\nIl. A router should reassemble IP fragments if the MTU of the outgoing link is\nlarger than the size of the incoming IP packet.\nWhich of the above statements is/are TRUE?\nland II only\nlonly\n\nIl and III only\nIl only\n\nWhat is the worst case time complexity of inserting n elements into an empty\nlinked list, if the linked list needs to be maintained in sorted order?\n\nO(n)\n\nO(n logn)\n\n@(n*)\n\n0(1)\n\nLet ® be the set of all binary relations on the set {1,2,3}. Suppose a relation is\nchosen from R® at random. The probability that the chosen relation is reflexive\n\n(round off to 3 decimal places) is\n\nLet G be a group of 35 elements. Then the largest possible size of a subgroup of G\n\nother than G itself is\n\nA multiplexer is placed between a group of 32 registers and an accumulator to\nregulate data movement such that at any given point in time the content of only\none register will move to the accumulator. The minimum number of select lines\n\nneeded for the multiplexer is\n\nIf there are m input lines and » output lines for a decoder that is used to uniquely\n\naddress a byte addressable | KB RAM, then the minimum value of #7 + 771s P\n\n\n--- PAGE 8 ---\n\nQ.No. 22\n\nQ.No. 23\n\nQ.No. 24\n\nQ.No. 25\n\nA direct mapped cache memory of | MB has a block size of 256 bytes. The cache\nhas an access time of 3 ns and a hit rate of 94%. During a cache miss, it takes\n20 ns to bring the first word of a block from the main memory, while each\nsubsequent word takes 5 ns. The word size is 64 bits. The average memory access\n\ntime in ns (round off to 1 decimal place) is\nConsider the following C program.\n\n#include <stdio.h>\nint main() {\nint a[4](S5J={{1l, 2, 3, 4, 5},\n(6, Ty @, 9, 1Ob,\n{11,. 12,. 13;. 14, 15},\n{ie, Tv, FB , 19, ZOE:\nprintf (\"Sd\\n\", *(* (at+**at2)4+3));\n\nreturn(Q});\n\nThe output of the program is\n\nConsider a double hashing scheme in which the primary hash function is\nh(k)=kmod 23, and the secondary hash function is /,(k)=1+(k mod 19).\nAssume that the table size is 23. Then the address returned by probe | in the probe\nsequence (assume that the probe sequence begins at probe 0) for key value £ =90\nis\n\nConsider the following grammar.\n\nS>aSB\\d\nB= b\n\nThe number of reduction steps taken by a bottom-up parser while accepting the\n\nstring aaadbhb is\n\nAssume that you have made a request for a web page through your web browser\nto a web server. Initially the browser cache is empty. Further, the browser is\nconfigured to send HTTP requests in non-persistent mode. The web page contains\ntext and five very small images. The minimum number of TCP connections\n\nrequired to display the web page completely in your browser is\n\nQ26 - Q55 carry two marks each.\n\nQ.No. 26\n\n\n\n--- PAGE 9 ---\n\n(B)\n(C)\n(D)\n\nQ.No. 27\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 28\n\nWhich of the following languages are undecidable? Note that (M) indicates\n\nencoding of the Turing machine M.\nL, = {(M)| L(M) = 9}\nLz = {(M,w,q)| M on input w reaches state q in exactly 100 steps}\nL; = {(M)| L(M) is not recursive}\n\nL, = {(M)| L(M) contains at least 21 members}\nL,,L3, and Ly only\nL, and Ls only\nLy and Ls only\nLy, Lz, and Ly only\n\nLet A and B be two n X n matrices over real numbers. Let rank(M) and det(M)\ndenote the rank and determinant of a matrix M, respectively. Consider the\n\nfollowing statements.\n\nI. rank(AB) = rank(A) rank(B)\n\nI. det(AB) = det(A) det(B)\n\nIl. rank(A +B) < rank(A) + rank(B)\nIV. det(A +B) < det(A) + det(B)\n\nWhich of the above statements are TRUE?\nland II only\n\nland IV only\n\nIl and HI only\n\nIl and IV only\n\nConsider the Boolean function z(a, b,c).\n\na ~\n\nWhich one of the following minterm lists represents the circuit given above?\n\nz= ¥.1,3,7)\n\nz= 045,67)\nz= Y.2.45,6,7)\n\n\n--- PAGE 10 ---\n\n(D)\n\nQ.No. 29\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 30\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 31\n\n(B)\n(C)\n\n(D)\n\nQ.No. 32\n\n(A)\n(B)\n(C)\n\nz= .2,3,5)\n\nConsider three registers R1, R2, and R3 that store numbers in IEEE-754 single\nprecision floating point format. Assume that Rl and R2 contain the values (in\n\nhexadecimal notation) 0x42200000 and 0xC 1200000, respectively.\n\nIf R3= a what is the value stored in R3?\n\n0x40800000\n0xC0800000\n0x83400000\nOxC8500000\n\nA computer system with a word length of 32 bits has a 16 MB byte-addressable\nmain memory and a 64 KB, 4-way set associative cache memory with a block size\nof 256 bytes. Consider the following four physical addresses represented in\n\nhexadecimal notation.\nAl = 0x42C8A4, A2=0x546888, A3=O0x6A289C, A4=0x5E4880\n\nWhich one of the following is TRUE?\n\nAl and A4 are mapped to different cache sets.\nA2 and A3 are mapped to the same cache set.\nA3 and A4 are mapped to the same cache set.\nAl and A3 are mapped to the same cache set.\n\nLet G = (V,E) be a weighted undirected graph and let T be a Minimum\nSpanning Tree (MST) of G maintained using adjacency lists. Suppose a new\nweighted edge (u,v) € V x V is added to G. The worst case time complexity of\ndetermining if T is still an MST of the resultant graph is\n\n@(/E| + |V1)\n\nO([EI|V1)\n\nO(|E| log |V|)\n\na(IV I)\n\nConsider the following languages.\nLy = {wxyx | w,x,y € (0+ 1)*}\nLz = txy|xy € (at b)*, |x| = ly x # y}\n\nWhich one of the following is TRUE?\nL, is regular and L, is context-free.\nL, is context-free but not regular and L» is context-free.\n\nNeither L, nor Ly is context-free.\n\n\n\n--- PAGE 11 ---\n\n(D)\n\nQ.No. 33\n\n(A)\n(B)\n(C)\n(D)\n\nQ.No. 34\n\n(A)\n\n(B)\n(C)\n(D)\n\nQ.No. 35\n\n(A)\n(B)\n\nL, is context-free but Ly is not context-free.\n\nConsider the productions A > PQ and A> XY. Each of the five non-terminals A,\nP, Q, X, and Y has two attributes: s is a synthesized attribute, and 7 is an inherited\n\nattribute. Consider the following rules.\nRule 1: P.i= A. + 2, Qi = P+ Av, and A.s = P.s + Qs\nRule 2: X.i= A.i+ Y.s and Yi = X.s + Ai\n\nWhich one of the following is TRUE?\n\nBoth Rule | and Rule 2 are L-attributed.\nOnly Rule | is L-attributed.\n\nOnly Rule 2 is L-attributed.\nNeither Rule 1 nor Rule 2 is L-attributed.\n\nEach of a set of m processes executes the following code using two semaphores\na and b initialized to 1 and 0, respectively. Assume that count is a shared\n\nvariable initialized to 0 and not used in CODE SECTION P.\n\nCODE SECTION P\n\nwait(a); count=count+1;\nif (count==n) signal (b);\n\nsignal(a); wait(b); signal(b);\n\nCODE SECTION Q\n\nWhat does the code achieve?\nIt ensures that no process executes CODE SECTION Q before every process has\n\nfinished CODE SECTION P.\nIt ensures that at most two processes are in CODE SECTION Q at any time.\n\nIt ensures that all processes execute CODE SECTION P mutually exclusively.\nIt ensures that at most n—1 processes are in CODE SECTION P at any time.\n\nConsider the following five disk access requests of the form (request id, cylinder\n\nnumber) that are present in the disk scheduler queue at a given time.\n(P, 155), (Q, 85), (R, 110), (S, 30), (T, 115)\n\nAssume the head is positioned at cylinder 100. The scheduler follows Shortest\n\nSeek Time First scheduling to service the requests.\n\nWhich one of the following statements is FALSE?\n\nT is serviced before P.\n\n\n\n--- PAGE 12 ---\n\n(C)\n(D)\n\nQ.No. 36\n\n(B)\n\n(C)\n\n(D)\n\nQ.No. 37\n\n(A)\n\n(B)\n\n(C)\n\n(D)\n\nQ.No. 38\n\nQ is serviced after S, but before T.\nThe head reverses its direction of movement between servicing of Q and P.\n\nR is serviced before P.\n\nConsider a relational table R that is in 3NF, but not in BCNF. Which one of the\n\nfollowing statements is TRUE?\n\nR has a nontrivial functional dependency Y — A,where X is not a superkey\nand A isa prime attribute.\n\nR has a nontrivial functional dependency  — A,where YX is not a superkey\nand A is anon-prime attribute and_X is not a proper subset of any key.\n\nR has a nontrivial functional dependency ¥ — A,where X is not a superkey\nand A is anon-prime attribute and_X is a proper subset of some key.\n\nA cell in & holds a set instead of an atomic value.\n\nConsider a schedule of transactions T, and T3:\n\nT, | RA RC WD WB | Commit\n\nT RB | WB RD wc Commit\n\nHere. RX stands for ‘“Read(X)\" and WX stands for “Write(X)\". Which one of the\n\nfollowing schedules is conflict equivalent to the above schedule?\n\nTy RA | RC | WD | WB Commit\nTz, | RB) WB} RD WC Commit\nT, |RA|RC} WD] WB Commit\nT2 RB | WB| RD | WC Commit\nT, |RA}|RC|] WD WB Commit\n% RB | WB | RD WC Commit\nTy RA | RC | WD | WB | Commit\nT, | RB | WB| RD| WC Commit\n\n\n\n--- PAGE 13 ---\n\n(B)\n(C)\n(D)\n\nQ.No. 39\n\n(B)\n(C)\n(D)\n\nQ.No. 40\n\n(B)\n(C)\n(D)\n\nQ.No. 41\n\n(B)\n(C)\n\nAn organization requires a range of IP addresses to assign one to each of its 1500\ncomputers. The organization has approached an Internet Service Provider (ISP)\nfor this task. The ISP uses CIDR and serves the requests from the available IP\naddress space 202.61.0.0/17. The ISP wants to assign an address space to the\norganization which will minimize the number of routing entries in the [SP’s router\nusing route aggregation. Which of the following address spaces are potential\n\ncandidates from which the ISP can allot any one to the organization?\n\nI. 202.61.84.0/21\n\nIl. 202.61.104.0/21\nIl.  202.61.64.0/21\nIV. 202.61.144.0/21\nland II only\nII and III only\nIll and IV only\nland IV only\n\nWhich one of the following predicate formulae is NOT logically valid?\n\nNote that W is a predicate formula without any free occurrence of x.\nVx(p(x) VW) = Vx p(x) VW\n\nSax(p(x) AW) = Ax p(x) AW\n\nvx(p(x) > W) = vx p(x) > W\n\nax(p(x) 9 W) = vx p(x) 9 W\n\nLet G=(V,E)be a directed, weighted graph with weight functionw:£>R.\nFor some function f:/ > IR, for each edge (u,v)e¢F,define w'(u,v) as\n\nw(u,v)+ fu) fv).\n\nWhich one of the options completes the following sentence so that it is TRUE?\n“The shortest paths in G under w are shortest paths under w' too,\n\nforevery f/:V > R\n\nifand only if Vue, f (i) is positive\n\nifand only if Vue, (uw) is negative\n\nif and only if f(w) is the distance from s to uw in the graph obtained by adding a\n\nnew vertex s to G and edges of zero weight from s to every vertex of G\n\nIn a balanced binary search tree with » elements, what is the worst case time\ncomplexity of reporting all elements in range [a,b]? Assume that the number of\nreported elements is k.\n\nO(log n)\n\nO(logn + k)\n\nO(k logn)\n\n\n--- PAGE 14 ---\n\n(D)\n\nQ.No. 42\n\nQ.No. 43\n\nQ.No. 44\n\nQ.No. 45\n\nQ.No. 46\n\nQ.No. 47\n\nO(n log k)\n\nThe number of permutations of the characters in LILAC so that no character\n\nappears in its original position, if the two L’s are indistinguishable, is\n\nConsider a non-pipelined processor operating at 2.5 GHz. It takes 5 clock cycles\nto complete an instruction. You are going to make a 5-stage pipeline out of this\nprocessor. Overheads associated with pipelining force you to operate the pipelined\nprocessor at 2 GHz. In a given program, assume that 30% are memory\ninstructions, 60% are ALU instructions and the rest are branch instructions.\n5% of the memory instructions cause stalls of 50 clock cycles each due to cache\nmisses and 50% of the branch instructions cause stalls of 2 cycles each. Assume\nthat there are no stalls associated with the execution of ALU instructions. For this\nprogram, the speedup achieved by the pipelined processor over the non-pipelined\n\nprocessor (round off to 2 decimal places) is\n\nA processor has 64 registers and uses 16-bit instruction format. It has two types of\ninstructions: I-type and R-type. Each I-type instruction contains an opcode, a\nregister name, and a 4-bit immediate value. Each R-type instruction contains an\nopcode and two register names. If there are 8 distinct I-type opcodes, then the\n\nmaximum number of distinct R-type opcodes is\n\nFor n> 2,let a €{0,1}\" be a non-zero vector. Suppose that x is chosen\nuniformly at random from {0,1}\". Then, the probability that }, a;x; is an odd\n\nnumber is\n\nConsider the following C functions.\n\nint funl(int n) { int fun2(int n) {\nstatic int i = 0; static int i = 0;\nif (n > 0) { if (n > 0) {\n++i; i = i + funlin);\nfunl(n-1); fun? (n-1);\n} }\nreturn(i); return(i);\n} }\n\nThe return value of fun? (5) is\n\nConsider the array representation of a binary min-heap containing 1023 elements.\nThe minimum number of comparisons required to find the maximum in the heap\n\nis\n\n\n\n--- PAGE 15 ---\n\nQ.No. 48 Consider the following C functions.\nint tob(int b, int* arr) { int pp(int a,int b) {\ninte is int arr[20];\nfor(i=O; b>O; i++) { int i, tot = 1, ex, len;\nif(b%2) arr[i]=1; ex = a;\nelse arr[i]=0; len = tob(b,arr);\nb = b/2; for (i=0; i<len; i++) {\n} if(arr[i]==1)\nreturn(i); tot = tot * ex;\nex = ex * ex;\nreturn (tot);\n}\n\nThe value returned by pp (3,4) is\n\nQ.No. 49 Consider a graph G = (V,E), where V = {¥,¥2,..., Vioo}. E = {(v, v)|1 <i <\nj = 100}, and weight of the edge (v;, v;) is |i—j|. The weight of minimum\n\nspanning tree of G is\n\nConsider the following set of processes, assumed to have arrived at time 0.\nConsider the CPU scheduling algorithms Shortest Job First (SJF) and Round\nRobin (RR). For RR, assume that the processes are scheduled in the order\nPP, Pa Py.\n\nQ.No. 50\n\nProcesses\n\nBurst time (in ms)\n\nIf the time quantum for RR is 4 ms, then the absolute value of the difference\nbetween the average turnaround times (in ms) of SJF and RR (round off to 2\n\ndecimal places) is\nQ.No.51 Consider the following language.\nL = {x € {a, b}*| number of a's in x is divisible by 2 but not divisible by 3}\nThe minimum number of states in a DFA that accepts L is\n\nQ.No. 52 Graph G is obtained by adding vertex s to K,, and making s adjacent to every\n\nvertex of K,,. The minimum number of colours required to edge-colour G\n\niS\n\n\n\n--- PAGE 16 ---\n\nQ.No. 53\n\nQ.No. 54\n\nQ.No. 55\n\nConsider a paging system that uses 1-level page table residing in main memory\nand a TLB for address translation. Each main memory access takes 100 ns and\nTLB lookup takes 20 ns. Each page transfer to/from the disk takes 5000 ns.\nAssume that the TLB hit ratio is 95%, page fault rate is 10%. Assume that for\n20% of the total page faults, a dirty page has to be written back to disk before the\nrequired page is read in from disk. TLB update time is negligible. The average\n\nmemory access time in ns (round off to 1 decimal places) is\n\nConsider a database implemented using B+ tree for file indexing and installed on\na disk drive with block size of 4 KB. The size of search key is 12 bytes and the\nsize of tree/disk pointer is 8 bytes. Assume that the database has one million\nrecords. Also assume that no node of the B+ tree and no records are present\ninitially in main memory. Consider that each record fits into one disk block. The\nminimum number of disk accesses required to retrieve any record in the database\n\nis\n\nConsider a TCP connection between a client and a server with the following\nspecifications: the round trip time is 6 ms, the size of the receiver advertised\nwindow is 50 KB, slow-start threshold at the client is 32 KB, and the maximum\nsegment size is 2 KB. The connection is established at time t = 0. Assume that\nthere are no timeouts and errors during transmission. Then the size of the\ncongestion window (in KB) at time ¢ +60 ms after all acknowledgements are\n\nprocessed is\n\nCopyright : GATE 2020, IIT Dethi\n\n\n\n--- PAGE 17 ---\n\n"
}