{
    "source_pdf": "GATE_2012_CS.pdf",
    "extracted_text": "2012\n\nQuestion Booklet Code —»> A\nCS : COMPUTER SCIENCE & INFORMATION TECHNOLOGY\n\nDuration: Three Hours Maximum Marks: 100\n\nRead the following instructions carefully.\n\nCS-A\n\n1.\n2.\n\n10.\n11.\n\n12.\n\nDo not open the seal of the Question Booklet until you are asked to do so by the invigilator.\n\nTake out the Optical Response Sheet (ORS) from this Question Booklet without breaking the seal\nand read the instructions printed on the ORS carefully. If you find that the Question Booklet Code\nprinted at the right hand top corner of this page does not match with the Booklet Code on the ORS,\nexchange the booklet immediately with a new sealed Question Booklet.\n\nOn the right half of the ORS, using ONLY a black ink ball point pen, (i) darken the bubble\ncorresponding to your test paper code and the appropriate bubble under each digit of your registration\nnumber and (ii) write your registration number, your name and name of the examination centre and\nput your signature at the specified location.\n\nThis Question Booklet contains 20 pages including blank pages for rough work. After you are\npermitted to open the seal, please check all pages and report discrepancies, if any, to the invigilator.\n\nThere are a total of 65 questions carrying 100 marks. All these questions are of objective type. Each\nquestion has only one correct answer. Questions must be answered on the left hand side of the ORS\nby darkening the appropriate bubble (marked A, B, C, D) using ONLY a black ink ball point pen\nagainst the question number. For each question darken the bubble of the correct answer. More\nthan one answer bubbled against a question will be treated as an incorrect response.\n\nSince bubbles darkened by the black ink ball point pen cannot be erased, candidates should darken\nthe bubbles in the ORS very carefully.\n\nQuestions Q.1 — Q.25 carry 1 mark each. Questions Q.26 — Q.55 carry 2 marks each. The 2 marks\nquestions include two pairs of common data questions and two pairs of linked answer questions. The\nanswer to the second question of the linked answer questions depends on the answer to the first\nquestion of the pair. If the first question in the linked pair is wrongly answered or is unattempted, then\nthe answer to the second question in the pair will not be evaluated.\n\nQuestions Q.56 — Q.65 belong to General Aptitude (GA) section and carry a total of 15 marks.\nQuestions Q.56 — Q.60 carry 1 mark each, and questions Q.61 — Q.65 carry 2 marks each.\n\nUnattempted questions will result in zero mark and wrong answers will result in NEGATIVE marks.\nFor all 1 mark questions, % mark will be deducted for each wrong answer. For all 2 marks questions,\n% mark will be deducted for each wrong answer. However, in the case of the linked answer question\npair, there will be negative marks only for wrong answer to the first question and no negative marks\nfor wrong answer to the second question.\n\nCalculator is allowed whereas charts, graph sheets or tables are NOT allowed in the examination hall.\n\nRough work can be done on the question paper itself. Blank pages are provided at the end of the\nquestion paper for rough work.\n\nBefore the start of the examination, write your name and registration number in the space provided\nbelow using a black ink ball point pen.\n\n| Name\n\nRegistration Number | CS | |\n\n1/20\n\n\n--- PAGE 1 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH. -—\n\nCS\n\nQ. 1-— Q. 25 carry one mark each.\n\nQ.1\n\nQ.2\n\nQ.3\n\nQ.4\n\nQ.5\n\nCS-A\n\nConsider the following logical inferences.\n\nI,: If it rains then the cricket match will not be played.\nThe cricket match was played.\nInference: There was no rain.\n\nI,: If it rains then the cricket match will not be played.\nIt did not rain.\nInference: The cricket match was played.\n\nWhich of the following is TRUE?\n\n(A) Both I, and I, are correct inferences\n\n(B) I, is correct but I, is not a correct inference\n(C) I; is not correct but I, is a correct inference\n(D) Both I, and I, are not correct inferences\n\nWhich of the following is TRUE?\n(A) Every relation in 3NF is also in BCNF\n\n(B) A relation R is in 3NF if every non-prime attribute of R is fully functionally dependent on every\n\nkey of R\n(C) Every relation in BCNF is also in 3NF\n(D) No relation can be in both BCNF and 3NF\n\nWhat will be the output of the following C program segment?\n\nchar inChar = ‘A’ ;\nswitch ( inChar ) {\ncase ‘A’ : printf C“Choice A\\ n”) ;\n\ncase ‘B’ :\n\ncase ‘C’ : printf (“Choice B”) ;\ncase ‘D’ :\n\ncase ‘E’\n\ndefault ; printf € “ No Choice” ) ; }\n\n(A) No Choice\n(B) Choice A\n(C) Choice A\nChoice B No Choice\n(D) Program gives no output as it is erroneous\n\nAssuming P # NP, which of the following is TRUE?\n\n(A) NP-complete = NP (B) NP-complete N P= ©\n(C) NP-hard = NP (D) P = NP-complete\nThe worst case running time to search for an element in a balanced binary search tree with n2”\n\nelements is\n\n(A) © (n log n) (B) © (n2\") (C) O(n) (D) © (log n)\n\n2/20\n\n\n--- PAGE 2 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH.\n\n-— CS\n\nQ.6\n\nQ.7\n\nQ.8\n\nQ.9\n\nQ.10\n\nQ.11\n\nQ.12\n\nCS-A\n\nThe truth table\n\nf (X, Y)\n\nRl |OloO|p<\nHS 1OlR|O|ne\nfo)\n\n|| oO\n\nrepresents the Boolean function\n\n(A) X (B)X+¥Y (C)X ®Y (D) Y\n\nThe decimal value 0.5 in IEEE single precision floating point representation has\n\n(A) fraction bits of 000...000 and exponent value of 0\n(B) fraction bits of 000...000 and exponent value of —1\n(C) fraction bits of 100...000 and exponent value of 0\n(D) no exact representation\n\nA process executes the code\n\nforkQ);\nforkQ);\nforkQ);\nThe total number of child processes created is\n(A) 3 (B) 4 (C) 7 (D) 8\n\nConsider the function f(x) = sin(x) in the interval x € [1/4, 72/4]. The number and location(s) of the\n\nlocal minima of this function are\n\n(A) One, at 1/2\n\n(B) One, at 32/2\n\n(C) Two, at 2/2 and 3n/2\n(D) Two, at 2/4 and 32/2\n\nThe protocol data unit (PDU) for the application layer in the Internet stack is\n(A) Segment (B) Datagram (C) Message (D) Frame\n\nLet A be the 2 X 2 matrix with elements a); = a). = a2; = +1 and az) = —1. Then the eigenvalues of\n\nthe matrix A'” are\n(A) 1024 and —1024 (B) 10242 and -1024V2\n(C) 4V2 and -4V2 (D) 512V2 and —512V2\n\nWhat is the complement of the language accepted by the NFA shown below?\nAssume & = {a} and ¢ is the empty string.\n\n(A) @ (B) {ge} (C) a’ (D) {a, 8}\n\n3/20\n\n\n--- PAGE 3 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ.13\n\nQ.14\n\nQ.15\n\nQ.16\n\nQ.17\n\nQ.18\n\nQ.19\n\nQ.20\n\nQ.21\n\nCS-A\n\nWhat is the correct translation of the following statement into mathematical logic?\n“Some real numbers are rational”\n\n(A) Ax (real(x) v rational(x))\n(B) Vx (real(x) > rational(x))\n(C) Ax (real(x) A rational(x))\n(D) Ax (rational(x) > real(x))\n\nGiven the basic ER and relational models, which of the following is INCORRECT?\n\n(A) An attribute of an entity can have more than one value\n\n(B) An attribute of an entity can be composite\n\n(C) In a row of a relational table, an attribute can have more than one value\n\n(D) In a row of a relational table, an attribute can have exactly one value or a NULL value\n\nWhich of the following statements are TRUE about an SQL query?\n\nP : An SQL query can contain a HAVING clause even if it does not have a GROUP BY clause\nQ: An SQL query can contain a HAVING clause only if it has a GROUP BY clause\n\nR: All attributes used in the GROUP BY clause must appear in the SELECT clause\n\nS : Not all attributes used in the GROUP BY clause need to appear in the SELECT clause\n\n(A) P and R (B) P and S (C) QandR (D) QandS\n\nThe recurrence relation capturing the optimal execution time of the Towers of Hanoi problem with\nn discs is\n\n(A) T(n) = 2T(n — 2) +2 (B) Tin) =2T(-1)+n\n\n(C) T(n) = 2T(n/2) + 1 (D) T(n) = 2T(n- 1) + 1\n\nLet G be a simple undirected planar graph on 10 vertices with 15 edges. If G is a connected graph,\nthen the number of bounded faces in any embedding of G on the plane is equal to\n\n(A) 3 (B) 4 (C) 5 (D) 6\n\nLet W(n) and A(n) denote respectively, the worst case and average case running time of an\nalgorithm executed on an input of size n. Which of the following is ALWAYS TRUE?\n\n(A) A(n) = Q (W(n)) (B) A(n) = © (W(n))\n(C) A(n) = O (W(n)) (D) A(n) = 0 (W(n))\nThe amount of ROM needed to implement a 4 bit multiplier is\n\n(A) 64 bits (B) 128 bits (C) 1 Kbits (D) 2 Kbits\n\nRegister renaming is done in pipelined processors\n\n(A) as an alternative to register allocation at compile time\n\n(B) for efficient access to function parameters and local variables\n(C) to handle certain kinds of hazards\n\n(D) as part of address translation\n\nConsider a random variable X that takes values +1 and —1 with probability 0.5 each. The values of\nthe cumulative distribution function F(x) at x =—1 and +1 are\n\n(A) 0 and 0.5 (B) 0 and 1 (C) 0.5 and 1 (D) 0.25 and 0.75\n\n4/20\n\n\n--- PAGE 4 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\nQ.22 Which of the following transport layer protocols is used to support electronic mail?\n(A) SMTP (B) IP (C) TCP (D) UDP\nQ.23 In the IPv4 addressing format, the number of networks allowed under Class C addresses is\n(A) 2\"* (B) 2’ (C) 2” (D) 2”\nQ.24 Which of the following problems are decidable?\n1) Does a given program ever produce an output?\n2) If Lis acontext-free language, then, is L also context-free?\n3) If Lis a regular language, then, is L also regular?\n4) If Lis a recursive language, then, is L also recursive?\n(A) 1, 2, 3,4 (B) 1, 2 (C) 2, 3,4 (D) 3,4\nQ.25 Given the language L = {ab, aa, baa}, which of the following strings are in L*?\n1) abaabaaabaa\n2) aaaabaaaa\n3) baaaaabaaaab\n4) baaaaabaa\n(A) 1, 2 and 3 (B) 2, 3 and 4\n(C) 1, 2 and 4 (D) 1, 3 and 4\nCS-A 5/20\n\n\n--- PAGE 5 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ. 26 to Q. 55 carry two marks each.\n\nQ.26 Which of the following graphs is isomorphic to\n\nQ.27\n\nQ.28\n\nQ.29\n\nCS-A\n\n(B)\n\n(A) wd\n©) we (D) OC\n2 b¢\n\nConsider the following transactions with data items P and Q initialized to zero:\n\nT,:read (CP);\nread (Q);\nif P=0thenQ:\nwrite (Q).\n\nT,: read (Q);\nread (P);\nif Q-=0thenP:\nwrite (CP).\n\nAny non-serial interleaving of T; and T, for concurrent execution leads to\n\nQ+1;\n\nP+1;\n\n(A) a serializable schedule\n\n(B) a schedule that is not conflict serializable\n\n(C) a conflict serializable schedule\n\n(D) a schedule for which a precedence graph cannot be drawn\n\nThe bisection method is applied to compute a zero of the function f(x) = x* —x° — x* — 4 in the\ninterval [1,9]. The method converges to a solution after iterations.\n\n(A) 1 (B) 3 (C) 5 (D) 7\n\nLet G be a weighted graph with edge weights greater than one and G’ be the graph constructed by\nsquaring the weights of edges in G. Let T and T’ be the minimum spanning trees of G and G’,\nrespectively, with total weights t and t’. Which of the following statements is TRUE?\n\n(A) T’ =T with total weight t’ = t”\n\n(B) T’ =T with total weight t’ < t?\n\n(C) T' #T but total weight t' = t\n\n(D) None of the above\n\n6/20\n\n\n--- PAGE 6 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ.30\n\nQ.31\n\nQ.32\n\nQ.33\n\nCS-A\n\nWhat is the minimal form of the Karnaugh map shown below? Assume that X denotes a don’t care\nterm.\n\nab\nC 00 Ol 11 10\no | 1/x |x }]41\no1 | x 1\n11\n10 | 1 x\n(A) bd (B) bd+be (C) bd+abcd (D) bd+bc+cd\n\nConsider the 3 processes, P1, P2 and P3 shown in the table.\n\nProcess | Arrival Time Units\ntime Required\n\nPl 0 5\n\nP2 1 7\n\nP3 3 4\n\nThe completion order of the 3 processes under the policies FCFS and RR2 (round robin scheduling\nwith CPU quantum of 2 time units) are\n\n(A) FCFS: P1, P2, P3 RR2: Pl, P2, P3 (B) FCFS: P1, P3, P2. RR2: Pl, P3, P2\n(C) FCFS: P1, P2, P3 RR2: Pl, P3, P2 (D) FCFS: P1, P3, P2. RR2: Pl, P2, P3\n\nFetch_And_Add(X,1) is an atomic Read-Modify-Write instruction that reads the value of\nmemory location X, increments it by the value i, and returns the old value of X. It is used in the\npseudocode shown below to implement a busy-wait lock. L is an unsigned integer shared variable\ninitialized to 0. The value of 0 corresponds to lock being available, while any non-zero value\ncorresponds to the lock being not available.\n\nAcquireLock(L) {\nwhile CFetch_And_Add(L, 1))\n\nL=1;\n}\nReleaseLock(L) {\nL = 0;\n}\n\nThis implementation\n\n(A) fails as L can overflow\n\n(B) fails as L can take on a non-zero value when the lock is actually available\n(C) works correctly but may starve some processes\n\n(D) works correctly without starvation\n\nSuppose a fair six-sided die is rolled once. If the value on the die is 1, 2, or 3, the die is rolled a\nsecond time. What is the probability that the sum total of values that turn up is at least 6?\n\n(A) 10/21 (B) 5/12 (C) 2/3 (D) 1/6\n\n7/20\n\n\n--- PAGE 7 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ.34 An Internet Service Provider (ISP) has the following chunk of CIDR-based IP addresses available\n\nQ.35\n\nCS-A\n\nwith it: 245.248.128.0/20. The ISP wants to give half of this chunk of addresses to Organization A,\nand a quarter to Organization B, while retaining the remaining with itself. Which of the following is\na valid allocation of addresses to A and B?\n\n(A) 245.248.136.0/21 and 245.248.128.0/22\n(B) 245.248.128.0/21 and 245.248.128.0/22\n(C) 245.248.132.0/22 and 245.248.132.0/21\n(D) 245.248.136.0/24 and 245.248.132.0/21\n\nSuppose a circular queue of capacity (n —1) elements is implemented with an array of n elements.\nAssume that the insertion and deletion operations are carried out using REAR and FRONT as array\nindex variables, respectively. Initially, REAR = FRONT = 0. The conditions to detect queue full\nand queue empty are\n\n(A) full: (REAR+1) mod n == FRONT (B) full: (REAR+1) mod n == FRONT\nempty: REAR == FRONT empty: (FRONT+1) mod n == REAR\n\n(C) full: REAR == FRONT (D) full: (FRONT+1) mod n == REAR\nempty: (REAR+1) mod n == FRONT empty: REAR == FRONT\n\n8/20\n\n\n--- PAGE 8 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ.36 Consider the program given below, in a block-structured pseudo-language with lexical scoping and\n\nnesting of procedures permitted.\n\nProgram main;\nVar ...\n\nProcedure A1;\nVar ...\nCall A2;\n\nEnd Al\n\nProcedure A2;\nVar ...\n\nProcedure A21;\nVar ...\nCall Al;\n\nEnd A21\n\nCall A21;\nEnd A2\n\nCall Al;\nEnd main.\n\nConsider the calling chain: Main > Al 3 A2 > A219 Al\n\nThe correct set of activation records along with their access links is given by\n\n(A)\nFRAME ACCESS\nPOINTER LINKS\n(C)\nFRAME\nPOINTER\n\nACCESS\nLINKS\n\nCS-A\n\n(B)\nFRAME ACCESS\nPOINTER LINKS\n(D)\nFRAME ACCESS\nPOINTER LINKS\n\n9/20\n\n\n--- PAGE 9 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ.37 How many onto (or surjective) functions are there from an n-element (n > 2) set to a 2-element set?\n(A) 2” (B) 2\"-1 (C) 2\"-2 (D) 2(2”—2)\n\nQ.38 Let G be a complete undirected graph on 6 vertices. If vertices of G are labeled, then the number of\ndistinct cycles of length 4 in G is equal to\n(A) 15 (B) 30 (C) 90 (D) 360\n\nQ.39 A list of n strings, each of length n, is sorted into lexicographic order using the merge-sort\nalgorithm. The worst case running time of this computation is\n(A) O (nlogn) (B) O (n’ log n) (C) O (n’ + log n) (D) O(n’)\n\nQ.40 Consider the directed graph shown in the figure below. There are multiple shortest paths between\nvertices S and T. Which one will be reported by Dijkstra’s shortest path algorithm? Assume that, in\nany iteration, the shortest path to a vertex v is updated only when a strictly shorter path to v is\ndiscovered.\n\n(A) SDT (B) SBDT (C) SACDT (D) SACET\n\nQ.41_ A file system with 300 GByte disk uses a file descriptor with 8 direct block addresses, 1 indirect\nblock address and 1 doubly indirect block address. The size of each disk block is 128 Bytes and the\nsize of each disk block address is 8 Bytes. The maximum possible file size in this file system is\n(A) 3 KBytes\n(B) 35 KBytes\n(C) 280 KBytes\n(D) dependent on the size of the disk\n\nQ.42 Consider the virtual page reference string\n\n1, 2, 3, 2, 4, 1, 3, 2, 4, 1\non a demand paged virtual memory system running on a computer system that has main memory\nsize of 3 page frames which are initially empty. Let LRU, FIFO and OPTIMAL denote the number\nof page faults under the corresponding page replacement policy. Then\n(A) OPTIMAL < LRU < FIFO (B) OPTIMAL < FIFO < LRU\n(C) OPTIMAL = LRU (D) OPTIMAL = FIFO\nQ.43 Suppose Ri(A, B) and R2(C, D) are two relation schemas. Let r; and 7 be the corresponding\n\nCS-A\n\nrelation instances. B is a foreign key that refers to C in R). If data in r,; and ry satisfy referential\nintegrity constraints, which of the following is ALWAYS TRUE?\n\n(A) T(r) — Hc(r2) = @\n(B) [Ic(r2) — Ha) = ©\n(C) T(r) = et)\n\n(D) Tp(r1) — He(r2) # D\n\n10/20\n\n\n--- PAGE 10 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ.44\n\nQ.45\n\nQ.46\n\nCS-A\n\nConsider a source computer (S) transmitting a file of size 10° bits to a destination computer (D)\nover a network of two routers (R; and R,) and three links (L), L,, and L3). L; connects S to R,; L,\nconnects R, to R,; and L3 connects Ro to D. Let each link be of length 100 km. Assume signals\ntravel over each link at a speed of 10° meters per second. Assume that the link bandwidth on each\nlink is 1Mbps. Let the file be broken down into 1000 packets each of size 1000 bits. Find the total\nsum of transmission and propagation delays in transmitting the file from S to D?\n\n(A) 1005 ms (B) 1010 ms (C) 3000 ms (D) 3003 ms\n\nConsider an instance of TCP’s Additive Increase Multiplicative Decrease (AIMD) algorithm where\nthe window size at the start of the slow start phase is 2 MSS and the threshold at the start of the first\ntransmission is 8 MSS. Assume that a timeout occurs during the fifth transmission. Find the\ncongestion window size at the end of the tenth transmission.\n\n(A) 8 MSS (B) 14 MSS (C) 7 MSS (D) 12 MSS\n\nConsider the set of strings on {0,1} in which, every substring of 3 symbols has at most two zeros.\nFor example, 001110 and 011001 are in the language, but 100010 is not. All strings of length less\nthan 3 are also in the language. A partially completed DFA that accepts this language is shown\nbelow.\n\n0, 1\nThe missing arcs in the DFA are\n(A) (B)\n00 01 10 11 q 00 01 10 11 q\n00 1 0 00 0 1\n01 1 01 1\n10 0 10 0\n11 0 11 0\n(C) (D)\n00 01 10 11 q 00 01 10 11 q\n00 1 0 00 1 0\n01 1 01 1\n10 0 10 0\n11 0 11 0\n\n11/20\n\n\n--- PAGE 11 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ.47 The height of a tree is defined as the number of edges on the longest path in the tree. The function\nshown in the pseudocode below is invoked as heightCroot) to compute the height of a binary\ntree rooted at the tree pointer root.\n\nint height Ctreeptr n)\n{ if Cn == NULL) return -1;\nif (n > left == NULL)\nif (n > right == NULL) return 0;\n\nelse return : // Box 1\n\nelse { hl = height (n > left);\nif (n > right == NULL) return (1+h1);\nelse { h2 = height (n > right);\n\nreturn ; // Box 2\n}\n\n}\n}\nThe appropriate expressions for the two boxes B1 and B2 are\n(A) B1: (1+height(n > right)) (B) BI: (height(n > right))\nB2: (1+max(hl, h2)) B2: (1+max(hl,h2))\n(C) BI: height(n > right) (D) B1: (1+ height(n > right))\n\nB2: max(hl, h2) B2: max(hl, h2)\n\nCS-A 12/20\n\n\n--- PAGE 12 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nCommon Data Questions\nCommon Data for Questions 48 and 49:\nConsider the following C code segment.\n\nint a, b, c =0;\nvoid prtFun(void);\nmainC )\nstatic int a = 1; /* Line 1 */\nprtFunC );\na += 1;\nprtFunC );\nprintfC“ \\n %d %d ”, a, b);\n\n}\n\nvoid prtFun(void)\n\n{ static int a = 2; /* Line 2 */\nint b= 1;\na += ++b;\nprintf(* \\n %d %d ”, a, b);\n\nQ.48 What output will be generated by the given code segment?\n\n(A) (B) (C) (D)\n3 1 4 2 4 2 3 1\n4 1 6 1 6 2 5 2\n4 2 6 1 2 0 5 2\nQ.49 What output will be generated by the given code segment if:\nLine | isreplaced by auto int a = 1;\nLine 2 is replaced by register int a = 2;\n(A) (B) (C) (D)\n3 1 4 2 4 2 4 2\n4 1 6 1 6 2 4 2\n4 2 6 1 2 0 2 0\n\nCS-A 13/20\n\n\n--- PAGE 13 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nCommon Data for Questions 50 and 51:\n\nConsider the following relations A, B and C:\n\nA B C\nId Name _ | Age Id Phone | Area\n15 Shreya | 24 10 2200 02\n25 Hari 40 99 2100 01\n98 Rohit | 20\n99 Rohit 11\n\nQ.50 How many tuples does the result of the following relational algebra expression contain? Assume\nthat the schema of AUB is the same as that of A.\n\n(AUB) DX ata>4ovcia<i5s C\n(A) 7 (B) 4 (C) 5 (D) 9\n\nQ.51 How many tuples does the result of the following SQL query contain?\n\nSELECT A.Id\nFROM A\nWHERE A.Age > ALL (SELECT B.Age\nFROM B\nWHERE B.Name = ‘Arun’)\n(A) 4 (B) 3 (C) 0 (D) 1\n\nCS-A 14/20\n\n\n--- PAGE 14 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nLinked Answer Questions\n\nStatement for Linked Answer Questions 52 and 53:\n\nFor the grammar below, a partial LL(1) parsing table is also presented along with the grammar. Entries that\nneed to be filled are indicated as E1, E2, and E3. ¢ is the empty string, $ indicates end of input, and, |\n\nseparates alternate right hand sides of productions.\n\nS>aAbB|bAaBle\n\nADS\nBOS\nne ne Cs nn; en S|\nS El E2 SMe\nA ADS ADS error\nB BOS BOS E3\n\nQ.52 The FIRST and FOLLOW sets for the non-terminals A and B are\n\n(A) FIRST(A) = {a, b, ¢} = FIRST(B) (B) FIRST(A) = {a, b, $}\nFOLLOW(A) = {a, b} FIRST(B) = {a, b, ¢}\nFOLLOW(B) = {a, b, $} FOLLOW(A) = {a, b}\n\nFOLLOW(B) = {$}\n\n(C) FIRST(A) = {a, b, ¢} = FIRST(B) (D) FIRST(A) = {a, b} = FIRST(B)\nFOLLOW(A) = {a, b} FOLLOW(A) = {a, b}\nFOLLOW(B) = @ FOLLOW(B) = {a, b}\n\nQ.53 The appropriate entries for El, E2, and E3 are\n\n(A) El:S > aAbB, ADS (B) El:S > aAbB, SMe\nE2:S > bAaB, BS E2:S > bAaB, SMe\nE3:B3S E3:S Me\n\n(C) El:S > aAbB, SMe (D) El:ADS, SMe\nE2:S > bAaB, SMs E2:B9S,SM¢e\nE3:B3S EBE3:B3S\n\nStatement for Linked Answer Questions 54 and 55:\n\nA computer has a 256 KByte, 4-way set associative, write back data cache with block size of 32 Bytes. The\nprocessor sends 32 bit addresses to the cache controller. Each cache tag directory entry contains, in\n\naddition to address tag, 2 valid bits, 1 modified bit and 1 replacement bit.\n\nQ.54 The number of bits in the tag field of an address is\n\n(A) 11 (B) 14 (C) 16 (D) 27\n\nQ.55 The size of the cache tag directory is\n\n(A) 160 Kbits (B) 136 Kbits (C) 40 Kbits (D) 32 Kbits\n\nCS-A\n\n15/20\n\n\n--- PAGE 15 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nGeneral Aptitude (GA) Questions\n\nQ. 56 — Q. 60 carry one mark each.\n\nQ.56 The cost function for a product in a firm is given by 5q’, where q is the amount of production. The\nfirm can sell the product at a market price of ® 50 per unit. The number of units to be produced by\nthe firm such that the profit is maximized is\n\n(A) 5 (B) 10 (C) 15 (D) 25\nQ.57 Choose the most appropriate alternative from the options given below to complete the following\nsentence:\nDespite several _______ the mission succeeded in its attempt to resolve the conflict.\n(A) attempts (B) setbacks (C) meetings (D) delegations\n\nQ.58 Which one of the following options is the closest in meaning to the word given below?\n\nMitigate\n(A) Diminish (B) Divulge (C) Dedicate (D) Denote\nQ.59 Choose the grammatically INCORRECT sentence:\n\n(A) They gave us the money back less the service charges of Three Hundred rupees.\n\n(B) This country’s expenditure is not less than that of Bangladesh.\n\n(C) The committee initially asked for a funding of Fifty Lakh rupees, but later settled for a lesser\nsum.\n\n(D) This country’s expenditure on educational reforms is very less.\n\nQ.60 Choose the most appropriate alternative from the options given below to complete the following\n\nsentence:\nSuresh’s dog is the one ________ was hurt in the stampede.\n(A) that (B) which (C) who (D) whom\n\nQ. 61 - Q. 65 carry two marks each.\n\nQ.61 Wanted Temporary, Part-time persons for the post of Field Interviewer to conduct personal\ninterviews to collect and collate economic data. Requirements: High School-pass, must be\navailable for Day, Evening and Saturday work. Transportation paid, expenses reimbursed.\n\nWhich one of the following is the best inference from the above advertisement?\n\n(A) Gender-discriminatory\n\n(B) Xenophobic\n\n(C) Not designed to make the post attractive\n(D) Not gender-discriminatory\n\nQ.62 A political party orders an arch for the entrance to the ground in which the annual convention is\nbeing held. The profile of the arch follows the equation y = 2x — 0.1x° where y is the height of the\narch in meters. The maximum possible height of the arch is\n\n(A) 8 meters (B) 10 meters (C) 12 meters (D) 14 meters\n\nCS-A 16/20\n\n\n--- PAGE 16 ---\n\n2012\n\nCOMPUTER SCIENCE & INFORMATION TECH. — CS\n\nQ.63 An automobile plant contracted to buy shock absorbers from two suppliers X and Y. X supplies\n60% and Y supplies 40% of the shock absorbers. All shock absorbers are subjected to a quality test.\nThe ones that pass the quality test are considered reliable. Of X’s shock absorbers, 96% are reliable.\n\nQ.64\n\nQ.65\n\nCS-A\n\nOf Y’s shock absorbers, 72% are reliable.\n\nThe probability that a randomly chosen shock absorber, which is found to be reliable, is made by Y\n\n1S\n\n(A) 0.288 (B) 0.334 (C) 0.667 (D) 0.720\nWhich of the following assertions are CORRECT?\n\nP: Adding 7 to each entry in a list adds 7 to the mean of the list\n\nQ: Adding 7 to each entry in a list adds 7 to the standard deviation of the list\n\nR: Doubling each entry in a list doubles the mean of the list\n\nS: Doubling each entry in a list leaves the standard deviation of the list unchanged\n\n(A) P,Q (B)Q,R (C) P,R (D)R,S\n\nGiven the sequence of terms, AD CG FK JP, the next term is\n(A) OV (B) OW (C) PV (D) PW\n\nEND OF THE QUESTION PAPER\n\n17/20\n\n\n--- PAGE 17 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nSpace for Rough Work\n\nCS-A 18/20\n\n\n--- PAGE 18 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nSpace for Rough Work\n\nCS-A 19/20\n\n\n--- PAGE 19 ---\n\n2012 COMPUTER SCIENCE & INFORMATION TECH. — CS\n\nSpace for Rough Work\n\nCS-A 20/20\n\n\n--- PAGE 20 ---\n\n"
}