{
    "source_pdf": "GATE_2014_CS_SET2.pdf",
    "extracted_text": "GATE 2014: General Instructions during Examination\n\n1. Total duration of the GATE examination is 180 minutes.\n\n2. The clock will be set at the server. The countdown timer at the top right corner of\nscreen will display the remaining time available for you to complete the examination.\nWhen the timer reaches zero, the examination will end by itself. You need not\nterminate the examination or submit your paper.\n\n3. Any useful data required for your paper can be viewed by clicking on the Useful\nCommon Data button that appears on the screen.\n\n4. Use the scribble pad provided to you for any rough work. Submit the scribble pad at\nthe end of the examination.\n\n5. You are allowed to use a non-programmable type calculator, however, sharing of\ncalculators is not allowed.\n\n6. The Question Palette displayed on the right side of screen will show the status of\neach question using one of the following symbols:\n\n1 | You have not visited the question yet.\nYou have not answered the question.\na You have answered the question.\n@ You have NOT answered the question, but have marked the question for review.\n\nal\n© You have answered the question, but marked it for review.\n\nThe Marked for Review status for a question simply indicates that you would like to look at\nthat question again. If a question is answered, but marked for review, then the answer will\nbe considered for evaluation unless the status is modified by the candidate.\n\nNavigating to a Question :\n\n7. To answer a question, do the following:\n\na. Click on the question number in the Question Palette to go to that question\ndirectly.\n\nb. Select an answer for a multiple choice type question by clicking on the bubble\nplaced before the 4 choices, namely A, B, C and D. Use the virtual numeric\nkeypad to enter a number as answer for a numerical type question.\n\nc. Click on Save & Next to save your answer for the current question and then go\nto the next question.\n\nd. Click on Mark for Review & Next to save your answer for the current question\nand also mark it for review, and then go to the next question.\n\n\n--- PAGE 1 ---\n\nCaution: Note that your answer for the current question will not be saved, if you navigate\nto another question directly by clicking on a question number without saving the answer to\nthe previous question.\n\nYou can view all the questions by clicking on the Question Paper button. This feature is\nprovided, so that if you want you can just see the entire question paper at a glance.\n\nAnswering a Question :\n\n8. Procedure for answering a multiple choice (MCQ) type question:\na. Choose one answer from the 4 options (A,B,C,D) given below the question,\nclick on the bubble placed before the chosen option.\nb. To deselect your chosen answer, click on the bubble of the chosen option again\nor click on the Clear Response button.\nc. To change your chosen answer, click on the bubble of another option.\nd. To save your answer, you MUST click on the Save & Next button.\n\n9. Procedure for answering a numerical answer type question:\na. To enter a number as your answer, use the virtual numerical keypad.\nb. A fraction (e.g. -0.3 or -.3) can be entered as an answer with or without '0'\nbefore the decimal point. As many as four decimal points, e.g. 12.5435 or\n0.003 or -932.6711 or 12.82 can be entered.\nc. Toclear your answer, click on the Clear Response button.\nd. To save your answer, you MUST click on the Save & Next button\n10. To mark a question for review, click on the Mark for Review & Next button. /f an\n\nanswer is selected (for MCQ) or entered (for numerical answer type) for a question\nthat is Marked for Review, that answer will be considered in the evaluation unless\nthe status is modified by the candidate.\n\n11. To change your answer to a question that has already been answered, first select\nthat question for answering and then follow the procedure for answering that type of\nquestion.\n\n12. Note that ONLY Questions for which answers are saved or marked for review after\nanswering will be considered for evaluation.\n\nChoosing a Section :\n\n13. Sections in this question paper are displayed on the top bar of the screen. Questions\nin a Section can be viewed by clicking on the name of that Section. The Section you\nare currently viewing will be highlighted.\n\n14. A checkbox is displayed for every optional Section, if any, in the Question Paper. To\nselect the optional Section for answering, click on the checkbox for that Section.\n\n15. If the checkbox for an optional Section is not selected, the Save & Next button and\nthe Mark for Review & Next button will NOT be enabled for that Section. You will\n\n\n--- PAGE 2 ---\n\nonly be able to see questions in this Section, but you will not be able to answer\nquestions in the Section.\n\n16. After clicking the Save & Next button for the last question in a Section, you will\nautomatically be taken to the first question of the next Section in sequence.\n\n17. You can move the mouse cursor over the name of a Section to view the answering\nstatus for that Section.\n\nChanging the Optional Section :\n\n18. After answering the chosen optional Section, partially or completely, you can change\nthe optional Section by selecting the checkbox for a new Section that you want to\nattempt. A warning message will appear along with a table showing the number of\nquestions answered in each of the previously chosen optional Sections and a\ncheckbox against each of these Sections. Click on a checkbox against a Section that\nyou want to reset and then click on the RESET button. Note that RESETTING a Section\nwill DELETE all the answers for questions in that Section. Hence, if you think that you\nmay want to select this Section again later, you will have to note down your answers\nfor questions in that Section. If you do not want to reset the Section and want to\ncontinue answering the previously chosen optional Section, then click on the BACK\nbutton.\n\n19. If you deselect the checkbox for an optional Section in the top bar, the following\nwarning message will appear: \"Deselecting the checkbox will DELETE all the answers\nfor questions in this Section. Do you want to deselect this Section?” If you want to\ndeselect, click on the RESET button. If you do not want to deselect, click on the BACK\nbutton.\n\n20. You can shuffle between different Sections or change the optional Sections any\nnumber of times.\n\n\n--- PAGE 3 ---\n\nGATE 2014 Examination\n\nCS: Computer Science & Information Technology\n\nDuration: 180 minutes Maximum Marks: 100\n\nRead the following instructions carefully.\n\n10.\n\n11.\n\n12.\n13.\n\nTo login, enter your Registration Number and password provided to you. Kindly go through the various\nsymbols used in the test and understand their meaning before you start the examination.\n\nOnce you login and after the start of the examination, you can view all the questions in the question\npaper, by clicking on the View All Questions button in the screen.\n\nThis question paper consists of 2 sections, General Aptitude (GA) for 15 marks and the subject\nspecific GATE paper for 85 marks. Both these sections are compulsory.\n\nThe GA section consists of 10 questions. Question numbers | to 5 are of 1-mark each, while question\nnumbers 6 to 10 are of 2-mark each.\n\nThe subject specific GATE paper section consists of 55 questions, out of which question numbers 1 to\n25 are of 1-mark each, while question numbers 26 to 55 are of 2-mark each.\n\nDepending upon the GATE paper, there may be useful common data that may be required for\nanswering the questions. If the paper has such useful data, the same can be viewed by clicking on the\nUseful Common Data button that appears at the top, right hand side of the screen.\n\nThe computer allotted to you at the examination center runs specialized software that permits only one\nanswer to be selected for multiple-choice questions using a mouse and to enter a suitable number for\nthe numerical answer type questions using the virtual keyboard and mouse.\n\nYour answers shall be updated and saved on a server periodically and also at the end of the\nexamination. The examination will stop automatically at the end of 180 minutes.\n\nIn each paper a candidate can answer a total of 65 questions carrying 100 marks.\n\nThe question paper may consist of questions of multiple choice type (MCQ) and numerical answer\ntype.\n\nMultiple choice type questions will have four choices against A, B, C, D, out of which only ONE is the\ncorrect answer. The candidate has to choose the correct answer by clicking on the bubble (©) placed\nbefore the choice.\n\nFor numerical answer type questions, each question will have a numerical answer and there will not be\nany choices. For these questions, the answer should be enteredby using the virtual keyboard that\nappears on the monitor and the mouse.\n\nAll questions that are not attempted will result in zero marks. However, wrong answers for multiple\nchoice type questions (MCQ) will result in NEGATIVE marks. For all MCQ questions a wrong\nanswer will result in deduction of 4 marks for a 1-mark question and % marks for a 2-mark question.\nThere is NO NEGATIVE MARKING for questions of NUMERICAL ANSWER TYPE.\n\nNon-programmable type Calculator is allowed. Charts, graph sheets, and mathematical tables are NOT\nallowed in the Examination Hall. You must use the Scribble pad provided to you at the examination\ncentre for all your rough work. The Scribble Pad has to be returned at the end of the examination.\n\nDeclaration by the candidate:\n\n“I have read and understood all the above instructions. I have also read and understood clearly the\ninstructions given on the admit card and shall follow the same. I also understand that in case I am found to\nviolate any of these instructions, my candidature is liable to be cancelled. I also confirm that at the start of\nthe examination all the computer hardware allotted to me are in proper working condition’.\n\n\n--- PAGE 4 ---\n\nGATE 2014 SET- 8 General Aptitude -GA\n\nQ. 1-Q. 5 carry one mark each.\n\nQ.1\n\nQ.2\n\nQ.3\n\nQ.4\n\nQ.5\n\nChoose the most appropriate phrase from the options given below to complete the following\nsentence.\n\nIndia is a post-colonial country because\n\n(A) it was a former British colony\n\n(B) Indian Information Technology professionals have colonized the world\n(C) India does not follow any colonial practices\n\n(D) India has helped other countries gain freedom\n\nWho was coming to see us this evening?\n\n(A) you said (B) did you say\n\n(C) did you say that (D) had you said\nMatch the columns.\n\nColumn 1 Column 2\n\n1) eradicate P) misrepresent\n\n2) distort Q) soak completely\n\n3) saturate R) use\n\n4) utilize S) destroy utterly\n\n(A) 1:S, 2:P, 3:Q, 4:R (B) 1:P, 2:Q, 3:R, 4:S\n(C) 1:Q, 2:R, 3:S, 4:P (D).1:S, 2:Py3:R, 4:Q\n\nWhat is the average of all multiples of 10 from 2 to 198?\n\n(A) 90 (B) 100 (C) 110 (D) 120\nThe value of /12 + 12+ V¥12+ ---is\n(A) 3.464 (B) 3.932 (C) 4.000 (D) 4.444\n\nQ. 6 - Q. 10 carry twomarks each.\n\nQ.6\n\nGA\n\nThe oldicity of Koenigsberg, which had a German majority population before World War 2, is now\ncalled Kaliningrad. After the events of the war, Kaliningrad is now a Russian territory and has a\npredominantly Russian population. It is bordered by the Baltic Sea on the north and the countries of\nPoland to the south and west and Lithuania to the east respectively. Which of the statements below\ncan be inferred from this passage?\n\n(A) Kaliningrad was historically Russian in its ethnic make up\n\n(B) Kaliningrad is a part of Russia despite it not being contiguous with the rest of Russia\n(C) Koenigsberg was renamed Kaliningrad, as that was its original Russian name\n\n(D) Poland and Lithuania are on the route from Kaliningrad to the rest of Russia\n\n1/2\n\n\n--- PAGE 5 ---\n\nGATE 2014 SET- 8 General Aptitude -GA\n\nQ.7\n\nQ.8\n\nQ.9\n\nThe number of people diagnosed with dengue fever (contracted from the bite of a mosquito) in\nnorth India is twice the number diagnosed last year. Municipal authorities have concluded that\nmeasures to control the mosquito population have failed in this region.\n\nWhich one of the following statements, if true, does not contradict this conclusion?\n\n(A) A high proportion of the affected population has returned from neighbouring countries where\ndengue is prevalent\n\n(B) More cases of dengue are now reported because of an increase in the Municipal Office’s\nadministrative efficiency\n\n(C) Many more cases of dengue are being diagnosed this year since the introduction of a new and\neffective diagnostic test\n\n(D) The number of people with malarial fever (also contracted from mosquito bites) has increased\nthis year\n\nIf xis real and |x* — 2x + 3| = 11, then possible values of | — x? + x? — x| include\nPp\n\n(A) 2,4 (B) 2, 14 (C) 4,52 (D), 14, 52\n\nThe ratio of male to female students in a college for five years is plotted in the following line graph.\nIf the number of female students doubled in 2009, by what percent did the number of male students\nincrease in 2009?\n\nNN\n\nwn\n_\n=\na\n4]\n=\n-\nmi\ni\n7]\ne\na\n—\no\n_\ni\n7]\ne\n—\no\no\nSs\nLis)\n[a\n\n2009 2010 2011\n\nQ.10 _Atwhat time between 6 a.m. and 7 a.m. will the minute hand and hour hand of a clock make an\n\nGA\n\nangle closest to 60°?\n\n(A) 6:22 a.m. (B) 6:27 a.m.\n(C)6: 38. a.m. (D) 6:45 a.m.\n\nEND OF THE QUESTION PAPER\n\n2/2\n\n\n--- PAGE 6 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ. 1 - Q. 25 carry one mark each.\n\nQ.1 The security system at an IT office is composed of 10 computers of which exactly four are\nworking. To check whether the system is functional, the officials inspect four of the computers\npicked at random (without replacement). The system is deemed functional if at least three of the\nfour computers inspected are working. Let the probability that the system is deemed functional be\ndenoted by p. Then 100p =\n\nQ.2 Each of the nine words in the sentence \"The quick brown fox jumps over the lazy\ndog” is written on a separate piece of paper. These nine pieces of paper are kept in a box. One of\nthe pieces is drawn at random from the box. The expected length of the word drawn is\n\n. (The answer should be rounded to one decimal places)\n\nQ.3. The maximum number of edges in a bipartite graph on 12 vertices is\n\nQ.4 — Ifthe matrix A is such that\n\nthen the determinant of A is equal to\n\nQ.5 A non-zero polynomial f(x) of degree 3 has roots at x = 1,x = 2 and x = 3. Which one of the\nfollowing mustbe TRUE?\n\n(A) fW)F(4) <0\n(B) F()F(4) > 0\n(C) f(O) +f (4) > 0\n(D) f@) + f(4) < 0\n\nQ.6 The dual of a Boolean function F(x1,%2,.-,Xn+, *, ’ ), written as F? , is the same expression\nas that of F with + and - swapped. F is said to be self-dual if F = F?. The number of self-dual\nfunctions with n Boolean variables is\n\n(A) 2” (B) 2\"-7 (C) 22” (D) 22” \"\n\nCS 1/15\n\n\n--- PAGE 7 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.7\n\nQ.8\n\nQ.9\n\nQ.10\n\nQ.11\n\nCS\n\nLet k = 2”. A circuit is built by giving the output of an n-bit binary counter as input to an\nn-to-2” bit decoder. This circuit is equivalent to a\n\n(A) k-bit binary up counter.\n(B) k-bit binary down counter.\n(C) k-bit ring counter.\n\n(D) k-bit Johnson counter.\n\nConsider the equation (123)5 = (x8), with x and y as unknown. The number of possible solutions is\n\nA 4-way set-associative cache memory unit with a capacity of 16 KB is,built using a block size of 8\nwords. The word length is 32 bits. The size of the physical address space.is 4 GB. The number of\nbits for the TAG field is\n\nConsider the function func shown below:\n\nint func(int num) {\nint count = 0;\nwhile (num) {\ncount++;\nnum>>= 1;\n}\n\nreturn (count) ;\n\n}\n\nThe value returned by Eune,(435) is\n\nSuppose n and p are unsigned int variables in a C program. We wish to set p to \"C3.\nIf n is large, which one of the following statements is most likely to set p correctly?\n\n(Ay p=n* (n-1) * (n-2) / 6;\n\n(B) pe=n* (n-1) / 2 * (n-2) / 3;\n(C) p-=n* (n-1) / 3 * (n-2) / 2;\n(D) p=n* (n-1) * (n-2) / 6.0;\n\n2/15\n\n\n--- PAGE 8 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.12. A priority queue is implemented as a Max-Heap. Initially, it has 5 elements. The level-order\ntraversal of the heap is: 10, 8, 5, 3, 2. Two new elements 1 and 7 are inserted into the heap in that\norder. The level-order traversal of the heap after the insertion of the elements is:\n\n(A) 10, 8, 7, 3, 2, 1,5 (B) 10, 8, 7, 2, 3, 1,5\n(C) 10, 8, 7, 1, 2, 3,5 (D) 10, 8, 7,5, 3, 2, 1\n\nQ.13. Which one of the following correctly determines the solution of the recurrence relation with\nTd) =1?\n\nT(n) = 2T (=) +logn\n\n(A) O(n) (B) O(n log n) (C) O(n’) (D) O(log n)\n\nQ.14 Consider the tree arcs of a BFS traversal from a source nodesW.in an unweighted, connected,\nundirected graph. The tree T formed by the tree arcs is a data structure for computing\n\n(A) _ the shortest path between every pair of vertices.\n(B) the shortest path from W to every vertex in the graph.\n(C) _ the shortest paths from W to only those nodes that areleaves of T.\n\n(D) _ the longest path in the graph.\n\nQ.15 IfL, ={a\"| n = 0} and L»= {b™| n = 0}; consider\n(1) Ly-Lz is a regular language\nWhich one of the following is CORRECT?\n\n(A) Only (J). (B) Only dD\n(C) Both (1) and (II) (D) Neither (I) nor (II)\n\nQ.16 Let A <,, B denotes that language A is mapping reducible (also known as many-to-one reducible)\nto language B. Which one of the following is FALSE?\n\n(A) If A <,, B and B is recursive then A is recursive.\n(B) If A <,, B and A is undecidable then B is undecidable.\n(C) If A <, B and B is recursively enumerable then A is recursively enumerable.\n\n(D) If A <,, B and B is not recursively enumerable then A is not recursively enumerable.\n\nCS 3/15\n\n\n--- PAGE 9 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.17 Consider the grammar defined by the following production rules, with two operators * and +\nS—T*P\nT—U|T*U\nP—>Q+P|Q\nQ— Id\nU—Id\nWhich one of the following is TRUE?\n\n(A) + is left associative, while * is right associative\n(B) + is right associative, while * is left associative\n(C) Both + and * are right associative\n\n(D) Both + and * are left associative\n\nQ.18 Which one of the following is NOT performed during compilation?\n\n(A) Dynamic memory allocation (B) Type checking\n\n(C) Symbol table management (D) Inline expansion\n\nQ.19 Which one of the following is TRUE?\n(A) The requirements document also describes.how the requirements that are listed in the document\nare implemented efficiently.\n(B) Consistency and completeness of functional requirements are always achieved in practice.\n(C) Prototyping is a method of requirements validation.\n\n(D) Requirements review is carried out to find the errors in system design.\n\nQ.20 AFAT (file allocation table) based file system is being used and the total overhead of each entry in\nthe FAT is 4 bytes imsize. Given a 100 x 10° bytes disk on which the file system is stored and data\nblock siz@is 10° bytes, the maximum size of a file that can be stored on this disk in units of 10°\nbytes is\n\nQ.21 The maximum number of superkeys for the relation schema R(E,F,G,H) with E as the key is\n\nCS 4/15\n\n\n--- PAGE 10 ---\n\nGATE 2014 SET-2 COMPUTER — CS\nQ.22 Given an instance of the STUDENTS relation as shown below:\nStudentID StudentName StudentEmail StudentAge CPI\n2345 Shankar shankar @ math x 9.4\n1287 Swati swati@ee 19 9.5\n7853 Shankar shankar @cse 19 9.4\n9876 Swati swati@ mech 18 9.3\n8765 Ganesh ganesh @civil 19 8.7\nFor (StudentName, StudentAge) to be a key for this instance, the value X should NOT be\nequal to .\nQ.23 Which one of the following is TRUE about the interior gateway routing protocols) Routing\nInformation Protocol (RIP) and Open Shortest Path First (OSPF)?\n(A) RIP uses distance vector routing and OSPF uses link state routing\n(B) OSPE uses distance vector routing and RIP uses link state routing\n(C) Both RIP and OSPF use link state routing\n(D) Both RIP and OSPF use distance vector routing\nQ.24 Which one of the following socket API functions converts an unconnected active TCP socket into a\npassive socket?\n(A) connect\n(B) bind\n(C) listen\n(D) accept\nQ.25 In the diagram showmpbelow, L1is.an Ethernet LAN and L2 is a Token-Ring LAN. An IP packet\noriginates from sender S and traverses to R, as shown. The links within each ISP and across the\ntwo ISPs, aresall point-to-point optical links. The initial value of the TTL field is 32. The\nmaximum possiblevalue of the TTL field when R receives the datagram is\ncs 5/15\n\n\n\n--- PAGE 11 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ. 26 — Q. 55 carry two marks each.\n\nQ.26 Consider the store and forward packet switched network given below. Assume that the bandwidth\nof each link is 10° bytes / sec. A user on host A sends a file of size 10° bytes to host B through\nrouters R1 and R2 in three different ways. In the first case a single packet containing the complete\nfile is transmitted from A to B. In the second case, the file is split into 10 equal parts, and these\npackets are transmitted from A to B. In the third case, the file is split into 20 equal parts and these\npackets are sent from A to B. Each packet contains 100 bytes of header information alongywith the\nuser data. Consider only transmission time and ignore processing, queuing and propagation delays.\nAlso assume that there are no errors during transmission. Let Tl, T2 and T3 be the times,taken to\ntransmit the file in the first, second and third case respectively. Which one of the following is\nCORRECT?\n\n—— —E_\nN\n(A) T1 <T2<T3\n(B) Tl > T2 > T3\n(C) T2 = T3, T3 < T1\n(D) T1 = T3, T3 > T2\n\nQ.27. An IP machine Q has a path to another IP machine H via three IP routers R1, R2, and R3.\n\nQ—RI—R2—R3—H\n\nH acts as an HTTP server, and Q connects to H via HTTP and downloads a file. Session layer\nencryption is usedy with DES as the.shared key encryption protocol. Consider the following four\npieces of information:\n\n{I1] The URL of the filedownloaded by Q\n{12] The-ECP port numbers at Q and H\n[13] The IP addresses of Q and H\n\n[14] The link layer addresses of Q and H\n\nWhichrof 11, 12, 13, and I4 can an intruder learn through sniffing at R2 alone?\n\n(A) Only I and [2\n(B) Only I1\n\n(C) Only I2 and I3\n(D) Only I3 and I4\n\nCS 6/15\n\n\n--- PAGE 12 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.28 <A graphical HTML browser resident at a network client machine Q accesses a static HTML\nwebpage from a HTTP server S. The static HTML page has exactly one static embedded image\nwhich is also at S. Assuming no caching, which one of the following is correct about the HTML\nwebpage loading (including the embedded image)?\n\n(A) Q needs to send at least 2 HTTP requests to S, each necessarily in a separate TCP\nconnection to server S\n\n(B) Q needs to send at least 2 HTTP requests to S, but a single TCP connection to server S is\nsufficient\n\n(C) A single HTTP request from Q to S is sufficient, and a single TCP connection between Q\nand S is necessary for this\n\n(D) A single HTTP request from Q to S is sufficient, and this is possible without any, TCP\n\nconnection between Q and S$\n\nQ.29 Consider the following schedule S of transactions T1, T2, T3, T4:\n\nT1 T2 T3 T4\nReads(X)\nWrites(X)\nCommit\nWrites (X)\nCommit\nWrites(Y)\nReads(Z)\nCommit\nReads(X)\nReads(Y)\nCommit\n\nWhich one ofthe following statements is CORRECT?\n\n(A) S is conflict-serializable but not recoverable\n(B) S is not conflict-serializable but is recoverable\n(C)S is both conflict-serializable and recoverable\n\n(D) S is neither conflict-serializable nor is it recoverable\n\nCS TNS\n\n\n--- PAGE 13 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.30 Consider a join (relation algebra) between relations r (R) and s(S) using the nested loop method.\n\nQ.31\n\nCS\n\nThere are 3 buffers each of size equal to disk block size, out of which one buffer is reserved for\nintermediate results. Assuming size (r(R) )<size(s(S) ), the join will have fewer number of\ndisk block accesses if\n\n(A) relation r (R) is in the outer loop.\n(B) relation s (S) is in the outer loop.\n(C) join selection factor between r (R) and s(S) is more than 0.5.\n\n(D) join selection factor between r (R) and s (S) is less than 0.5.\n\nConsider the procedure below for the Producer-Consumer problem which uses semaphores:\n\nsemaphore n = 0;\n\nsemaphore s = 1;\n\nvoid producer () void consumer)\n\n{ {\n\nwhile (true) while(true)\n{\n\nproduce (); semWait (s) ;\nsemWait(s) ; semWait(n) ;\naddToBuffer () ; removeFromBuffer () ;\nsemSignal (s) ; semSignal (s) ;\nsemSignal (n) ; consume () ;\n\n} }\n\nWhich one of the following is TRUE?\n\n(A) The producer will be able to add an item to the buffer, but the consumer can never\nconsume it.\n\n(B) The consumer will remove no more than one item from the buffer.\n\n(C) Deadlock occurs if the consumer succeeds in acquiring semaphore s when the buffer is\nempty.\n\n(D) The starting valueor the semaphore n must be 1 and not 0 for deadlock-free operation.\n\n8/15\n\n\n--- PAGE 14 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.32\n\nQ.33\n\nQ.34\n\nCS\n\nThree processes A, B and C each execute a loop of 100 iterations. In each iteration of the loop, a\nprocess performs a single computation that requires t, CPU milliseconds and then initiates a single\nI/O operation that lasts for tj, milliseconds. It is assumed that the computer where the processes\nexecute has sufficient number of I/O devices and the OS of the computer assigns different I/O\ndevices to each process. Also, the scheduling overhead of the OS is negligible. The processes have\nthe following characteristics:\n\nProcess id t. tio\nA 100 ms 500 ms\nB 350 ms 500 ms\nC 200 ms 500 ms\n\nThe processes A, B, and C are started at times 0, 5 and 10 milliseconds respectively, in a pure time\nsharing system (round robin scheduling) that uses a time slice of 50 milliseconds»The time in\nmilliseconds at which process C would complete its first I/O operation is\n\nA computer has twenty physical page frames which contain pages numbered 101 through 120.\nNow a program accesses the pages numbered 1, 2, ...,100 in that order, and repeats the access\nsequence THRICE. Which one of the following page replacement policies experiences the same\nnumber of page faults as the optimal page replacement,policy for this program?\n\n(A) Least-recently-used (B) First-in-first-out\n\n(C) Last-in-first-out (D) Most-recently-used\n\nFor a C program accessing X[i] [j] [kK], the following intermediate code is generated by a\ncompiler. Assume that the size of anainteger is 32 bits and the size of a character is 8 bits.\n\ntO = i * 1024\ntl = j * 32\nt2 =k «4\nt3 = t1 + tO\nt4 = t3 + t2\nt5 = X[t4]\n\nWhich oneof the following statements about the source code for the C program is CORRECT?\n(A)s X is declared as “int X[32] [32] [8]”.\n(B) Xisdeclaredas “int X[4] [1024] [32]”.\n\n(C) Xisdeclared as “char X[4] [32] [8]”.\n(D) Xisdeclared as “char X[32] [16] [2]”.\n\n9/15\n\n\n--- PAGE 15 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.35\n\nQ.36\n\nQ.37\n\nQ.38\n\nCS\n\nLet <M> be the encoding of a Turing machine as a string over 4 = {0,1}. Let\nL ={<M> | MisaTuring machine that accepts a string of length 2014 }. Then, L is\n\n(A) decidable and recursively enumerable\n(B) undecidable but recursively enumerable\n(C) undecidable and not recursively enumerable\n\n(D) decidable but not recursively enumerable\n\nLet L, = {w € {0,1}*|w_ has at least as many occurrences of (110)’s as (011)’s}. Let\nLy = {w € {0,1}* | w has at least as many occurrences of (000)’s as(hb1)’s}. Which one of the\nfollowing is TRUE?\n\n(A) Ly, is regular but not L,\n(B) Lz is regular but not L4\n(C) Both L, and Lz are regular\n\n(D) Neither L, nor Lz are regular\n\nConsider two strings A = \"qpqrr”and B =\"pqprqrp’”. Let x be the length of the longest common\nsubsequence (not necessarily contiguous), between A and B and let y be the number of such longest\ncommon subsequences between A and B. Then x + 10y=___\n\nSupposeiP, Q,R, S, T are sorted sequences having lengths 20, 24, 30,35, 50 respectively. They are\nto be mergeduinto a single sequence by merging together two sequences at a time. The number of\ncomparisons that will be needed in the worst case by the optimal algorithm for doing this is .\n\n10/15\n\n\n--- PAGE 16 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.39\n\nConsider the expression tree shown. Each leaf represents a numerical value, which can either be 0\nor 1. Over all possible choices of the values at the leaves, the maximum possible value of the\nexpression represented by the tree is .\n\nQ.40 Consider the following function\n\nQ.41\n\nCS\n\ndouble f (double x) {\nif( abs(x*x - 3)\\< O01) return x;\nelse return £(x/2\\+ 1.5/x);\n\n}\n\nGive a value g,(to 2 decimals) such that £ (q) will return q:\n\nSuppose aystack implementation supports an instruction REVERSE, which reverses the order of\nelements on the stack, in addition to the PUSH and POP instructions. Which one of the following\nstatements is TRUE with respect to this modified stack?\n\n(A) A queue cannot be implemented using this stack.\n\n(B) A queue can be implemented where ENQUEUE takes a single instruction and DEQUEUE takes\n\na sequence of two instructions.\n\n(C) A queue can be implemented where ENQUEUE takes a sequence of three instructions and\nDEQUEUE takes a single instruction.\n\n(D) A queue can be implemented where both ENQUEUE and DEQUEUE take a single instruction\n\neach.\n\n11/15\n\n\n--- PAGE 17 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.42 Consider the C function given below.\n\nint f(int j)\n\n{\n\nstatic int i = 50;\nint k;\nif (i == j)\n\n{\n\nprintf (“something”) ;\nreturn 0;\n\n}\n\nelse return 0;\n\n}\n\nWhich one of the following is TRUE?\n\n(A) The function returns 0 for all values of j.\n(B) The function prints the string something for all values of j.\n(C) The function returns O whenj = 50.\n\n(D) The function will exhaust the runtime stack or runinto an infinite loop when j = 50.\n\n.43 In designing a computer’s cache systemjpthe cache block (or cache line) size is an important\ngning p y p\nparameter. Which one of the following statements»is correct in this context?\n\n(A) A smaller block size impliesbetter spatial locality\n(B) A smaller block size implies a smaller cache tag and hence lower cache tag overhead\n(C) A smaller block size implies a larger cache tag and hence lower cache hit time\n\n(D) A smaller blockssize incurs ajlower cache miss penalty\n\nQ.44 If the associativity of a processor cache is doubled while keeping the capacity and block size\nunchanged, which one of the following is guaranteed to be NOT affected?\n\n(A) Width of tag comparator (B) Width of set index decoder\n\n(C) Width of way selection multiplexor (D) Width of processor to main memory data bus\n\nQ.45 The value of a float type variable is represented using the single-precision 32-bit floating point\nformat of IEEE-754 standard that uses 1 bit for sign, 8 bits for biased exponent and 23 bits for\nmantissa. A float type variable X is assigned the decimal value of —14.25. The representation of X\nin hexadecimal notation is\n\n(A) C1640000H (B) 416C0000H (C) 41640000H (D) C16C0000H\n\nCS 12/15\n\n\n--- PAGE 18 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.46\n\nQ.47\n\nQ.48\n\nQ.49\n\nQ.50\n\nCS\n\nIn the Newton-Raphson method, an initial guess of x» = 2 is made and the sequence Xq, X1,X2 -..\nis obtained for the function\n0.75x3 - 2x2 -2x+4=0\nConsider the statements\n(1) Xz, =0.\n(I) The method converges to a solution in a finite number of iterations.\n\nWhich of the following is TRUE?\n\n(A) Only I (B) Only II (C) Both I and II (D) Neither I nor II\n\nThe product of the non-zero eigenvalues of the matrix\n\nPoOocorF\nOrRPrRPRSO\nOrRPrRPRSO\nOrRPrRRO\nROoOOOPR\n\n18\n\nThe probability that a given positive integer lying between 1 and 100 (both inclusive) is NOT\ndivisible by 2, 3 or 5 is .\n\nThe number of distinct positive integral factors of 2014 is\n\nConsider the following relation on subsets of the set S of integers between | and 2014. For two\ndistinct subsets*U_and V of S we say U < V if the minimum element in the symmetric difference of\nthe two sets is in U.\n\nConsider the.following two statements:\n\nStI: There isa subset of S that is larger than every other subset.\nS2: There is a subset of S that is smaller than every other subset.\n\nWhich one of the following is CORRECT?\n\n(A) Both $1 and S2 are true\n(B) S1 is true and S2 is false\n(C) S2 is true and S1 is false\n(D) Neither S1 nor S2 is true\n\n13/15\n\n\n--- PAGE 19 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.51  Acycle on 7n vertices is isomorphic to its complement. The value of 7 is\n\nQ.52 The number of distinct minimum spanning trees for the weighted graph below is\n\nQ.53. Which one of the following Boolean expressions is NOT a tautology?\n\n(A) ((a > b)A(b > c)) > (a Pg)\n(B) (a> c) > (~ b > (aXc))\n\n(C) (aAbAc) —(cVa)\n\n(D) a > (b > @)\n\nQ.54 SQL allows duplicate tuples in relations, and correspondingly defines the multiplicity of tuples in\nthe result of joins. Which one of the following queries always gives the same answer as the nested\nquery shown below:\n\nselect * from R where a in (select S.a from S)\n\n(A) select R.* from R, S where R.a=S.a\n\n(B) select distinct R.* from R,S where R.a=S.a\n\n(C) select R.* from R, (select distinct a from S) as S1 where\nR.a=Sl.a\n\n(D) select R.* from R,S where R.a=S.a and is unique R\n\nCS 14/15\n\n\n--- PAGE 20 ---\n\nGATE 2014 SET-2 COMPUTER - CS\n\nQ.55 Consider a main memory system that consists of 8 memory modules attached to the system bus,\nwhich is one word wide. When a write request is made, the bus is occupied for 100 nanoseconds\n(ns) by the data, address, and control signals. During the same 100 ns, and for 500 ns thereafter, the\naddressed memory module executes one cycle accepting and storing the data. The (internal)\noperation of different memory modules may overlap in time, but only one request can be on the bus\nat any time. The maximum number of stores (of one word each) that can be initiated in 1\nmillisecond is\n\nEND OF THE QUESTION PAPER\n\nCS 15/15\n\n\n--- PAGE 21 ---\n\n"
}