{
    "source_pdf": "GATE_2015_CS_SET1.pdf",
    "extracted_text": "GATE 2015 Examination - CS (Set 1, 7 February, Forenoon Session)\n\nGeneral Aptitude\n\nQ.1\n\nDidn't you buy when you went shopping?\n\n(A) any paper (B) much paper (C) no paper (D) a few paper\nQ.2\n\nWhich of the following options is the closest in meaning to the sentence below?\n\nShe enjoyed herself immensely at the party.\n(A) She had a terrible time at the party\n(B) She had a horrible time at the party\n(C) She had a terrific time at the party\n(D) She had a terrifying time at the party\nQ.3\nGiven Set A= {2. 3.4, 5} and Set B = {11, 12, 13, 14. 15}. two numbers are randomly selected.\none from each set. What is the probability that the sum of the two numbers equals 16?\n\n(A) 0.20 (B) 0.25 (C) 0.30 (D) 0.33\n\nQ.4\n\nBased on the given statements, select the most appropriate option to solve the given question.\n\nIf two floors in a certain building are 9 feet apart, how many steps are there in a set of stairs that\nextends from the first floor to the second floor of the building?\n\nStatements:\n\n() = Each step is 3/4 foot high.\n(I) Each step is 1 foot wide.\n\n(A) Statement I alone 1s sufficient, but statement I alone is not sufficient.\n\n(B) Statement II alone is sufficient, but statement I alone is not sufficient.\n\n(C) Both statements together are sufficient, but neither statement alone 1s sufficient.\n(D) Statement I and II together are not sufficient.\n\n\n--- PAGE 1 ---\n\nQ.5\n\nWhich one of the following combinations is incorrect?\n\n(A) Acquiescence - Submission\n(B) Wheedle - Roundabout\n\n(C) Flippancy - Lightness\n\n(D) Profligate - Extravagant\n\nQ.6\n\nThe number of students in a class who have answered correctly, wrongly. or not attempted each\nquestion in an exam. are listed in the table below. The marks for each question are also listed. There\nis no negative or partial marking.\n\nAnswered | Answered\nCorrectly | Wrongly svc\n\nWhat 1s the average of the marks obtained by the class in the examination?\n(A) 2.290 (B) 2.970 (C) 6.795 (D) 8.795\n\nQ.7\n\nSelect the alternative meaning of the underlined part of the sentence.\n\nThe chain snatchers took to their heels when the police party arnved.\n\n(A) took shelter in a thick jungle\n(B) open indiscriminate fire\n\n(C) took to flight\n\n(D) unconditionally surrendered\n\n\n--- PAGE 2 ---\n\nQ. 8\n\nThe given statement 1s followed by some courses of action. Assuming the statement to be true.\ndecide the correct option.\n\nStatement:\nThere has been a significant drop in the water level in the lakes supplying water to the city.\n\nCourse of action:\n\n(I) The water supply authority should impose a partial cut in supply to tackle the situation.\n\n(1) The government should appeal to all the residents through mass media for munimal use of\nwater.\n\n(III) The government should ban the water supply in lower areas.\n\n(A) Statements I and II follow.\n(B) Statements I and III follow.\n(C) Statements I and II follow.\n(D) All statements follow.\n\nQ.9\n\nThe pie chart below has the breakup of the number of students from different departments in an\nengineering college for the year 2012. The proportion of male to female students in each\ndepartment is 5:4. There are 40 males in Electrical Engineering. What is the difference between the\nnumbers of female students in the Civil department and the female students in the Mechanical\ndepartment?\n\n\n\n--- PAGE 3 ---\n\nQ. 10\n\nThe probabilities that a student passes in Mathematics. Physics and Chemistry are m p. and c\nrespectively. Of these subjects, the student has 75% chance of passing in at least one. a 50% chance\nof passing 1n at least two and a 40% chance of passing in exactly two. Following relations are\ndrawn in mp. c:\n\n(D pt+m+c= 27/20\n(1) pt+m+c= 13/20\nMD = (p)*(m)x(c) = 1/10\n\n(A) Only relation I is true.\n\n(B) Only relation II is true.\n\n(C) Relations II and II are true.\n(D) Relations I and II are true.\n\nComputer Science and Information Technology\n\nQ.1\nMatch the following:\n(P) Condition coverage (i) Black-box testing\n(Q) Equivalence class partitioning (11) System testing\n(R) Volume testing (111) White-box testing\n(S) Alpha testing (iv) Performance testing\n(A) P-i, Q-i11, R-1, S-iv (B) P-in, Q-iv, R-1i, S-1\n(C) Pat, Q-i, R-iv, S-11 (D) P-i11, Q-i, R-i1, S-iv\nQ.2\n\nWhich one of the following is the recurrence equation for the worst case time complexity of the\nQuicksort algorithm for sorting n ( = 2) numbers? In the recurrence equations given in the options\nbelow, c is a constant.\n\n(A) T(n) = 2T(n/2) + en\n\n(B) T(n) = T(n—1) + T(1) + en\n(C) T(n) = 2T(n—1) + cn\n\n(D) T(n) = T(n/2) + cn\n\n\n--- PAGE 4 ---\n\nQ. 3\n\nFor any two languages L; and L2 such that L; is context-free and L> is recursively enumerable but\nnot recursive, which of the following is/are necessarily true?\n\ni L; (complement of L;) is recursive\nIL. L, (complement of L) is recursive\nII. L; is context-free\nIV. _L, UL is recursively enumerable\n(A) I only (B) II only (C) IlandIVonly (D) IandIV only\nQ.4\nlim, x'/* is\n(A) % (B) 0 (C) 1 (D) Not defined\nQ.5\n3 h(x)) .\nIf g(x) =1-—xand h(x)= —. , then BAG) 5.\nx—l h(g(x))\nA(x -l x) x\n@y (B) — © && (0) —.\n2(x) x h(x) (l-x)\nQ.6\nMatch the following:\n(P) Prim’s algorithm for mimimum spanning tree (i) Backtracking\n(Q) Floyd-Warshall algorithm for all pairs shortest paths (ii) Greedy method\n(R) Mergesort (111) Dynamic programming\n(S) Hamiltonian circuit (iv) Divide and conquer\n(A) P-i11, Q-11, R-iv, S-1 (B) P-, Q-11, R-iv, S-111\n\n(C) Pu, Q-111, R-iv, S-1 (D) P-i, Qi, R-iu1, S-iv\n\n\n--- PAGE 5 ---\n\nQ.7\n\nSELECT operation in SQL is equivalent to\n\n(A) the selection operation in relational algebra\n\n(B) the selection operation in relational algebra, except that SELECT in SQL retains duplicates\n(C) the projection operation in relational algebra\n\n(D) the projection operation in relational algebra, except that SELECT in SQL retains duplicates\n\nQ. 8\n\nFor computers based on three-address instruction formats, each address field can be used to specify\nwhich of the following:\n\n(S1) A memory operand\n\n(S2) A processor register\n\n(S3) Animplied accumulator register\n\n(A) Either $1 or $2\n(B) Either S2 or $3\n(C) Only $2 and $3\n(D) All of $1, S2 and S3\n\nQ.9\n\nThe following two functions Pl and P2 that share a variable B with an initial value of 2 execute\nconcurrently.\n\nS34 > { P2ZH; X *t\nc Bus ay D\nB 2% Es B\n} }\n\n2* B\nD- 1;\n\nThe number of distinct values that B can possibly take after the execution is\n\nQ. 10\nWhich of the following is/are correct morder traversal sequence(s) of binary search tree(s)?\nL 3, 5,7, 8, 15, 19, 25\nIL. 5, 8,9, 12, 10, 15, 25\nIl. 2. 7, 10, 8, 14, 16, 20\nIV. 4 6,7,9 18, 20, 25\n\n(A) I and IV only (B) I and II only (C) and IV only (D) I only\n\n\n--- PAGE 6 ---\n\nQ.11\n\nThe output of the following C program is\n\nvoid fi(int a, int b) {\nint c;\nc=a; a=b; b=c;\n}\nvoid f2(int *a, int *b) {\nint: c;\nc=*a; *a=*b; *b=c;\n}\nint main () {\nint a=4, b=5, c=6;\nfl(a,b);\n£2 (eb, €c)7\nprintf (“%d”,c-a-b);\n\nQ. 12\n\nConsider a system with byte-addressable memory, 32-bit logical addresses, 4 kilobyte page size and\npage table entries of 4 bytes each. The size of the page table in the system im megabytes is\n\nQ. 13\n\nWhich one of the following is TRUE at any valid state in shift-reduce parsing?\n\n(A) Viable prefixes appear only at the bottom of the stack and not inside\n(B) Viable prefixes appear only at the top of the stack and not inside\n\n(C) The stack contains only a set of viable prefixes\n\n(D) The stack never contains viable prefixes\n\nQ. 14\n\nWhich one of the following is NOT equivalent to p <> q?\n\n(A)GPYDARPYI®D (B)GPYQDA@—p)\n(CC) GPADY@PA4Q) (D)GPAIDVY OAD\n\n\n--- PAGE 7 ---\n\nQ. 15\n\nWhich of the following statements is/are FALSE?\nI XML overcomes the limitations in HTML to support a structured way of organizing\n\ncontent.\nIl XML specification is not case sensitive while HTML specification is case sensitive.\nIl. XML supports user defined tags while HTML uses pre-defined tags.\nIV. XML tags need not be closed while HTML tags must be closed.\n\n(A) I only (B) I only (C) Iand IV only (D) I and IV only\n\nQ. 16\n\nFor a set A, the power set of A is denoted by 24. If A = {5, {6}, {7}}, which of the following options\nare TRUE?\n\nL@e24 I. @c 24 I {5, {6}} € 24 IV. {5, {6}} & 24\n(A) I and III only (B) 0 and I only\n\n(C) L and I only (D) L Dand IV only\n\nQ.17\n\nIn one of the pairs of protocols given below, both the protocols can use multiple TCP connections\nbetween the same client and the server. Which one is that?\n\n(A) HTTP, FTP (B) HTTP, TELNET (C) FIP,SMTP (D) HTTP, SMTP\n\nQ. 18\n\nIn the LU decomposition of the mat | | , if the diagonal elements of U are both 1, then the\n\nlower diagonal entry 1,, of L is :\n\n\n--- PAGE 8 ---\n\nQ. 19\n\nSuppose two hosts use a TCP connection to transfer a large file. Which of the following statements\nis/are FALSE with respect to the TCP connection?\n\nI.__ If the sequence number of a segment is m, then the sequence number of the subsequent\nsegment is always m+1.\nIl. If the estimated round trip time at any given point of time is rf sec, the value of the\nretransmission timeout is always set to greater than or equal to f sec.\nI. The size of the advertised window never changes during the course of the TCP connection.\nIV. The number of unacknowledged bytes at the sender is always less than or equal to the\nadvertised window.\n(A) II only (B) I and III only (C) Land IV only (D) ILand IV only\nQ. 20\n\nConsider a 4-bit Johnson counter with an initial value of 0000. The counting sequence of this\ncounter is\n\n(A) 0, 1, 3, 7, 15, 14, 12, 8,0 (B) 0, 1, 3, 5, 7, 9, 11, 13, 15,0\n(C) 0, 2, 4, 6, 8, 10, 12, 14, 0 (D) 0, 8, 12, 14, 15, 7, 3, 1,0\nQ. 21\n\nSuppose that everyone in a group of N people wants to communicate secretly with the N-1 others\nusing symmetric key cryptographic system. The communication between any two persons should\nnot be decodable by the others in the group. The number of keys required in the system as a whole\nto satisfy the confidentiality requirement is\n\n(A) 2N (B) NWV-1) (C) MN-1)/2 (D) (N-1)\nQ. 22\n\nWhich one of the following fields of an IP header is NOT modified by a typical IP router?\n\n(A) Checksum (B) Source address\n(C) Time to Live (TTL) (D) Length\n\n\n--- PAGE 9 ---\n\nQ. 23\n\nWhat are the worst-case complexities of msertion and deletion of a key in a binary search tree?\n\n(A) @(logn) for both insertion and deletion\n\n(B) O(n) for both insertion and deletion\n\n(C) @(n) for insertion and @(logn) for deletion\n(D) @(logn) for insertion and O(n) for deletion\n\nQ. 24\n\nA file is organized so that the ordering of data records is the same as or close to the ordering of data\nentries in some index. Then that index is called\n\n(A) Dense (B) Sparse (C) Clustered (D) Unclustered\nQ. 25\n\nThe height of a tree is the length of the longest root-to-leaf path in it. The maximum and minimum\nnumber of nodes in a binary tree of height 5 are\n\n(A) 63 and 6, respectively (B) 64 and 5, respectively\n(C) 32 and 6, respectively (D) 31 and 5, respectively\nQ. 26\n99 1\n\n2 (<41) =\n\nx=] ¥\n\n\n--- PAGE 10 ---\n\nQ. 27\nConsider the following relations:\n\nStudent Performance\n\nConsider the following SQL query.\nSELECT S.Student Name, sum(P.Marks)\nFROM Student S, Performance P\n\nWHERE S. Roll No = £3 Roll No\nGROUP BY S. Student Name\n\nThe number of rows that will be returned by the SQL query is\n\nQ. 28\n\nThe binary operator + is defined by the following truth table.\n\nWhich one of the following is true about the binary operator +?\n\n(A) Both commutative and associative (B) Commutative but not associative\n(C) Not commutative but associative (D) Neither commutative nor associative\n\n\n--- PAGE 11 ---\n\nQ. 29\n\nConsider a LAN with four nodes 5,,53,S3 and S,. Time is divided into fixed-size slots, and a node\ncan begin its transmission only at the beginning of a slot. A collision is said to have occurred if\nmore than one node transmit in the same slot. The probabilities of generation of a frame in a time\n\nslot by S,,53,53 and S, are 0.1, 0.2, 0.3 and 0.4, respectively. The probability of sending a frame in\nthe first slot without any collision by any of these four stations is\n\nQ. 30\n\nSuppose the following disk request sequence (track numbers) for a disk with 100 tracks is given:\n45, 20, 90, 10, 50, 60, 80, 25, 70. Assume that the mitial position of the R/W head is on track 50.\nThe additional distance that will be traversed by the R/W head when the Shortest Seek Time First\n(SSTF) algorithm is used compared to the SCAN (Elevator) algonthm (assuming that SCAN\nalgorithm moves towards 100 when it starts execution) is tracks.\n\nQ. 31\nConsider the following C function.\n\nint funl(int n) {\nint i,j,k,p,q=0;\nfor (i=1; i<n; ++1) {\np=0;\nfor (j=n; j>1; j=3/2)\n++p;\nfor (k=1; k<p; k=k*2)\n++q;\n}\nreturn gq;\n\n}\n\nWhich one of the following most closely approximates the return value of the function fun1?\n\n(A) n° (B) n(logn)’ (C) nlogn (D) nlog(logn)\n\n\n--- PAGE 12 ---\n\nQ. 32\n\nConsider a max heap, represented by the array: 40, 30, 20, 10, 15, 16, 17, 8, 4.\n\n|ArrayIndex | 1 | 2 | 3 | 4 | 5 | 6 | 7/ 8 | 9 |\n\n[Value | 40 | 30 | 20 | 10 | 15 | 16 | 17 | 8 | 4\n\nNow consider that a value 35 is inserted into this heap. After insertion, the new heap is\n\n(A) 40, 30, 20, 10, 15, 16, 17, 8, 4, 35 (B) 40, 35, 20, 10, 30, 16, 17, 8, 4, 15\n(C) 40, 30, 20, 10, 35, 16, 17, 8, 4, 15 (D) 40, 35, 20, 10, 15, 16, 17, 8, 4, 30\nQ. 33\n\nConsider the following pseudo code, where x and y are positive integers.\n\nbegin\ngq :=0\nrsi=x\nwhile r 2y do\nbegin\nce ee =y\nGo c=e +1\nend\nend\n\nThe post condition that needs to be satisfied after the program termunates is\n\n(A) fr=qxt+yar<y} (B) {x=qyt+r ar<y}\n(C) {y=qxtra0d0<r<y} (D) {q+1i<r-y a y>0}\n\n\n--- PAGE 13 ---\n\nQ. 34\n\nSuppose £ = {p,q,r,s,t} 1s a lattice represented by the following Hasse diagram:\n\nt\n\nPp\n\nFor any x, y € £, not necessarily distinct, x V y and x A y are jom and meet of x, y, respectively.\nLet £3 = {(x, y,z): x,y,z € L} be the set of all ordered triplets of the elements of £. Let p, be the\nprobability that an element (x,y,z) € £3 chosen equiprobably satisfies x V (y Az) = (xVy)A\n(x V z). Then\n\n(A) p, = 0\n(B)p, = 1\n(C)0<p, <=\n\n(D)=<p, <1\n\nQ. 35\n\nWhat is the output of the following C code? Assume that the address of x 1s 2000 (in decimal) and\nan integer requires four bytes of memory.\n\nint main () {\nunsigned int x[4][3] =\n{{1,2,3},{4,5,6},{7,8,9}, {10,11,12}};\nprintf(“tu, tu, tu”, x+3, *(x+3), *(x+2)+3);\n\n(A) 2036, 2036, 2036 (B) 2012,4,2204  (C) 2036, 10, 10 (D) 2012, 4,6\n\n\n--- PAGE 14 ---\n\nQ. 36\n\nConsider the following 2 x 2 matrix 4 where two elements are unknown and are marked by a and\nb. The eigenvalues of this matrix are -1 and 7. What are the values of a and b?\n\nbe\nA= i\nba\n(A)a=6,b=4\n(B)a=4,b=6\n\n(C)a=3,b=5\n(D) a=5,b=3\n\nQ. 37\n\nA positive edge-triggered D flip-flop is connected to a positive edge-triggered JK flip-flop as\nfollows. The Q output of the D flip-flop is connected to both the J and K inputs of the JK flip-flop,\nwhile the Q output of the JK flip-flop is connected to the mput of the D flip-flop. Initially, the\noutput of the D flip-flop is set to logic one and the output of the JK flip-flop is cleared. Which one\nof the following is the bit sequence (including the initial state) generated at the O output of the JK\nflip-flop when the flip-flops are connected to a free-running common clock? Assume that J=K = 1\nis the toggle mode and J = K = 0 is the state-holding mode of the JK flip-flop. Both the flip-flops\nhave non-zero propagation delays.\n\n(A) 0110110... (B) 0100100...\n(C) 011101110... (D) 011001100...\nQ. 38\n\nConsider a non-pipelined processor with a clock rate of 2.5 gigahertz and average cycles per\ninstruction of four. The same processor is upgraded to a pipelined processor with five stages; but\ndue to the internal pipeline delay, the clock speed is reduced to 2 gigahertz. Assume that there are\nno stalls in the prpeline. The speed up achieved in this pipelined processor is :\n\n\n--- PAGE 15 ---\n\nQ. 39\nConsider the operations\nf(X,Y,Z) = XYZ+XY +Y'Z' and g(X,Y,Z)=XYZ+XYZ +XyY.\n\nWhich one of the following is correct?\n\n(A) Both {f} and {g} are functionally complete\n(B) Only {f} is functionally complete\n\n(C) Only {g} 1s functionally complete\n\n(D) Neither {f} nor {g} is functionally complete\n\nQ. 40\n\nAn algorithm performs (log N , find operations, N insert operations, (log N , delete\n\noperations, and (log N y decrease-key operations on a set of data items with keys drawn from a\n\nlinearly ordered set. For a delete operation, a pointer is provided to the record that must be deleted.\nFor the decrease-key operation, a pointer is provided to the record that has its key decreased. Which\none of the following data structures is the most suited for the algorithm to use, if the goal is to\nachieve the best total asymptotic complexity considering all the operations?\n\n(A) Unsorted array (B) Min-heap\n(C) Sorted array (D) Sorted doubly linked list\nQ. 41\n\nConsider an Entity-Relationship (ER) model in which entity sets Z} and £2 are connected by an\nm:n relationship R12. £; and £3 are connected by a 1 : 7 (1 on the side of E; and 7 on the side of\n£3) relationship Rj3.\n\nE, has two single-valued attributes a,; and aj) of which aj; is the key attribute. Z) has two single-\nvalued attributes a>; and a2) of which ap; is the key attribute. £; has two single-valued attributes a3;\nand a3 of which a3; is the key attribute. The relationships do not have any attributes.\n\nIf a relational model is derived from the above ER model, then the minimum number of relations\nthat would be generated if all the relations are in 3NF is\n\n\n--- PAGE 16 ---\n\nQ. 42\n\nConsider the following C program segment.\n\nwhile(first <= last)\n{\n\nif (array[middle] < search)\n\nfirst = middle + 1;\nelse if (array[middle] == search)\nfound = TRUE;\nelse last = middle - 1;\n\nmiddle = (first + last) /2;\n}\nif (first > last) notPresent = TRUE;\n\nThe cyclomatic complexity of the program segment is ‘\n\nQ. 43\n\nThe graph shown below has 8 edges with distinct integer edge weights. The minimum spanning tree\n(MST) is of weight 36 and contains the edges: {(A, C), (B, ©), (B, BE), (, F), (D, F)}. The edge\nweights of only those edges which are in the MST are given in the = shown below. The\nminimum possible sum of weights of all 8 edges of this graph is\n\nQ. 44\n\n{ cos(1/ x) d\n\n=\n\nx\n\nVa\n\n\n--- PAGE 17 ---\n\nQ. 45\n\nLet G = (V, E) be a simple undirected graph, and s be a particular vertex in it called the source.\nFor x €V , let d(x) denote the shortest distance in G from sto x . A breadth first search (BFS) 1s\n\nperformed starting at s . Let T be the resultant BFS tree. If (u,v) is an edge of G that is not in T ,\nthen which one of the following CANNOT be the value of d(u)—d(v)?\n\n(A) -1 (B) 0 (C) 1 (D) 2\n\nQ. 46\n\nConsider a uniprocessor system executing three tasks T,, T2 and T3, each of which is composed of\nan infinite sequence of jobs (or instances) which arrive periodically at intervals of 3, 7 and 20\nmilliseconds, respectively. The priority of each task is the inverse of its period, and the available\ntasks are scheduled in order of priority, with the highest priority task scheduled first. Each instance\nof T;, Tz and T3 requires an execution time of 1, 2 and 4 milliseconds, respectively. Given that all\ntasks initially arrive at the beginning of the 1* millisecond and task preemptions are allowed, the\nfirst instance of T; completes its execution at the end of milliseconds.\n\nQ. 47\n\nConsider a main memory with five page frames and the following sequence of page references: 3,\n8, 2, 3, 9, 1, 6, 3, 8, 9, 3, 6, 2, 1, 3. Which one of the following is true with respect to page\nreplacement policies First In First Out (FIFO) and Least Recently Used (LRU)?\n\n(A) Both incur the same number of page faults\n(B) FIFO incurs 2 more page faults than LRU\n(C) LRU incurs 2 more page faults than FIFO\n(D) FIFO incurs 1 more page faults than LRU\n\nQ. 48\n\nConsider a disk pack with a seek time of 4 milliseconds and rotational speed of 10000 rotations per\nmunute (RPM). It has 600 sectors per track and each sector can store 512 bytes of data. Consider a\nfile stored in the disk. The file contains 2000 sectors. Assume that every sector access necessitates a\nseek, and the average rotational latency for accessing each sector is half of the time for one\ncomplete rotation. The total time (in milliseconds) needed to read the entire file is :\n\n\n--- PAGE 18 ---\n\nQ. 49\n\nLet a, represent the number of bit strings of length 7 containing two consecutive 1s. What is the\n\nrecurrence relation for a, ?\n\ny] y]\n(A) a,_>+4,. +2\" (B) a,_,+2a,,+2\"~\n(C) 2a,_,+a,_,+2\"° (D) 2a,_, +2a,,+2\"”\nQ. 50\n\nA variable x is said to be live at a statement S; in a programif the following three conditions hold\nsimultaneously:\n\n1. There exists a statement 5; that uses x\n\nil. There is a path from S; to S; in the flow graph corresponding to the program\n\nill. The path has no intervening assignment to x including at S; and S;\n\nThe variables which are live both at the statement in basic block 2 and at the statement in basic\nblock 3 of the above control flow graph are\n\n(A) p, 5, u (B) 7, 5, u (C)r,u (D) qv\n\n\n--- PAGE 19 ---\n\nQ.51\n\nConsider the NPDA (Q = {q,,41,42}, © = {0,1}, T = {0,1,1}, 5, qo, 1, F = {q2}), where (as\nper usual convention) Q is the set of states, ¥ is the input alphabet, I is the stack alphabet, 5 is the\nstate transition function, go is the mutial state, 1 is the mutial stack symbol, and F is the set of\naccepting states. The state transition is as follows:\n\nLz31Z\n0.2 3 02\n\n0,12 4Z\n10Z 42\n\nWie ZZ ele\n\nWhich one of the following sequences must follow the string 101100 so that the overall string is\naccepted by the automaton?\n\n(A) 10110 (B) 10010 (C) 01010 (D) 01001\n\nQ. 52\n\nM: j N: cans .\n\nConsider the DFAs M and N given above. The number of states in a minimal DFA that accepts the\nlanguage L(M) N LAN) is\n\nQ. 53\n\nSuppose that the stop-and-wait protocol is used on a link with a bit rate of 64 kilobits per second\n\nand 20 milliseconds propagation delay. Assume that the transmission tume for the\nacknowledgement and the processing time at nodes are negligible. Then the minimum frame size in\nbytes to achieve a link utilization of at least 50% is\n\nQ. 54\n\nLet G be a connected planar graph with 10 vertices. If the number of edges on each face 1s three,\nthen the number of edges in G is\n\n\n--- PAGE 20 ---\n\nQ. 55\n\nThe least number of temporary variables required to create a three-address code in static single\nassignment form for the expression g+r/3+s—t*5+u*v/w is\n\n\n--- PAGE 21 ---\n\n"
}