{
    "source_pdf": "GATE_2018_CS.pdf",
    "extracted_text": "GATE 2018 General Aptitude (GA) Set-3\n\nQ. 1-—Q. 5 carry one mark each.\n\nQ.1\n\nQ.2\n\nQ.3\n\nQ.4\n\nQ.5\n\n“From where are they bringing their books? bringing ____ books from\n\nThe words that best fill the blanks in the above sentence are\n\n(A) Their, they’re, there\n(B) They’re, their, there\n(C) There, their, they’re\n(D) They’re, there, there\n\n“A investigation can sometimes yield new facts, but typically organized ones\nare more successful.”\n\nThe word that best fills the blank in the above sentence is\n\n(A) meandering (B) timely (C) consistent (D) systematic\n\nThe area of a square is d. What is the area of the circle which has the diagonal of the\nsquare as its diameter?\n\n(A) md (B) wd? (C) : nd2 (D) : ad\n\nWhat would be the smallest natural number which when divided either by 20 or by 42 or\nby 76 leaves a remainder of 7 in each case?\n\n(A) 3047 (B) 6047 (C) 7987 (D) 63847\nWhat is the missing number in the following sequence?\n2, 12, 60, 240, 720, 1440, , 0\n\n(A) 2880 (B) 1440 (C) 720 (D) 0\n\nGA\n\n1/3\n\n\n--- PAGE 1 ---\n\nGATE 2018 General Aptitude (GA) Set-3\n\nQ. 6 — Q. 10 carry two marks each.\n\nQ.6 In appreciation of the social improvements completed in a town, a wealthy philanthropist\ndecided to gift Rs 750 to each male senior citizen in the town and Rs 1000 to each female\nsenior citizen. Altogether, there were 300 senior citizens eligible for this gift. However,\nonly 8/9\" of the eligible men and 2/3\" of the eligible women claimed the gift. How much\nmoney (in Rupees) did the philanthropist give away in total?\n\n(A) 1,50,000 (B) 2,00,000\n(C) 1,75,000 (D) 1,51,000\nQ7 Ff -x ib oye l peed vai\npar # Oandp * = 7 q-= 7? re= D° what is the value of the product XyZ?\n(A) -1 (B) — (C)1 (D) par\n\npqr\n\nQ.8 Ina party, 60% of the invited guests are male and 40% are female. If 80% of the invited\nguests attended the party and if all the invited female guests attended, what would be the\nratio of males to females among the attendees in the party?\n\n(A) 2:3 (B) 1:1 (C) 3:2 (D) 2:1\n\nQ.9 Inthe figure below, 2DEC + ZBFC is equal to\n\nE\nD C\nF\nB\nA\n(A) ZBCD — ZBAD (B) ZBAD + ZBCF\n(C) ZBAD + ZBCD (D) ZCBA+ ZADC\n\nGA 2/3\n\n\n--- PAGE 2 ---\n\nGATE 2018 General Aptitude (GA) Set-3\n\nQ.10 A six sided unbiased die with four green faces and two red faces is rolled seven times.\n\nWhich of the following combinations is the most likely outcome of the experiment?\n\n(A) Three green faces and four red faces.\n(B) Four green faces and three red faces.\n(C) Five green faces and two red faces.\n(D) Six green faces and one red face.\n\nEND OF THE QUESTION PAPER\n\nGA\n\n3/3\n\n\n--- PAGE 3 ---\n\nGATE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ. 1 - Q. 25 carry one mark each.\n\nQ.1 Which one of the following is a closed form expression for the generating function of the\nsequence {d,}, where d, = 2n + 3 foralln = 0, J, 2,...?\n\n3 3x 2-x 3-x\nB Cc D\naaa (B) (©) (D)\n\nA\n“ (1—x)’ (1x) (1—x)’\n\nQ.2 Consider the following C program.\n\n#include<stdio.h>\nstruct Ournodef\nchar X,Yy,Z;\n\n};\n\nint main () {\n\nstruct Ournode p = {'1', 'O', 'a'+2};\nstruct Ournode *q = &p;\nprintf (\"Sc, Sc\", *((char*)gqtl), *((char*)qt2));\n\nreturn 0;\n\n}\n\nThe output of this program is:\n\n(A) 0, c (B) 0, a+2 (C) '0'\", 'a+2' (D) '0', 'c'\n\nQ.3 A queue is implemented using a non-circular singly linked list. The queue has a head pointer\nand a tail pointer, as shown in the figure. Let n denote the number of nodes in the queue. Let\nenqueue be implemented by inserting a new node at the head, and dequeue be\nimplemented by deletion of a node from the tail.\n\nhead tail\n\nWhich one of the following is the time complexity of the most time-efficient implementation\nof enqueue and dequeue, respectively, for this data structure?\n\n(A) 0(1), 8(1) (B) 0(1), (7) (C) O(n), OC) (D) 0(n), 8(7)\n\nCS 1/20\n\n\n--- PAGE 4 ---\n\nGATE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.4 Let ® and © denote the Exclusive OR and Exclusive NOR operations, respectively.\nWhich one of the following is NOT CORRECT?\n\n(AVPOBQ=POQ\nB)PBQ=POQ\n(C)PBQ=POQ\n\n(D) (PBP)BQ= (POP)O\n\nQ.5 Consider the following processor design characteristics.\n\nI. Register-to-register arithmetic operations only\nIl. Fixed-length instruction format\nII. Hardwired control unit\n\nWhich of the characteristics above are used in the design of a RISC processor?\n\n(A) Iand II only (B) I and III only (C) I and II only (D) I, Wand HI\n\nQ.6 Let N be an NFA with n states. Let k be the number of states of a minimal DFA which is\nequivalent to N. Which one of the following is necessarily true?\n\n(A) k > 2\" (B)k>n (C)k <n? (D) k < 2”\n\nQ.7 The set of all recursively enumerable languages is\n\n(A) closed under complementation.\n\n(B) closed under intersection.\n\n(C) a subset of the set of all recursive languages.\n(D) an uncountable set.\n\nQ.8 | Which one of the following statements is FALSE?\n\n(A) Context-free grammar can be used to specify both lexical and syntax rules.\n(B) Type checking is done before parsing.\n\n(C) High-level language programs can be translated to different Intermediate\nRepresentations.\n\n(D) Arguments to a function can be passed using the program stack.\n\nCS 2/20\n\n\n--- PAGE 5 ---\n\nGATE 2018\n\nQ.9\n\nQ.10\n\nQ.11\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nThe following are some events that occur after a device controller issues an interrupt while\nprocess L is under execution.\n\n(P) The processor pushes the process status of L onto the control stack.\n(Q) The processor finishes the execution of the current instruction.\n\n(R) The processor executes the interrupt service routine.\n\n(S) The processor pops the process status of L from the control stack.\n(T) The processor loads the new PC value based on the interrupt.\n\nWhich one of the following is the correct order in which the events above occur?\n\n(A) QPTRS (B) PTRSQ (C) TRPQS (D) QTPRS\n\nConsider a process executing on an operating system that uses demand paging. The average\ntime for a memory access in the system is M units if the corresponding memory page is\navailable in memory, and D units if the memory access causes a page fault. It has been\nexperimentally measured that the average time taken for a memory access in the process 1s\nX units.\n\nWhich one of the following is the correct expression for the page fault rate experienced by\nthe process?\n\n(A) (D- M)/ (X—M) (B) (X—-M)/(D-M)\n(C)(D-X)/(D-M) (D) (X— M)/(D-X)\n\nIn an Entity-Relationship (ER) model, suppose R is a many-to-one relationship from entity\nset El to entity set E2. Assume that El and E2 participate totally in R and that the cardinality\nof El is greater than the cardinality of E2.\n\nWhich one of the following is true about R?\n\n(A) Every entity in El is associated with exactly one entity in E2.\n(B) Some entity in El is associated with more than one entity in E2.\n(C) Every entity in E2 is associated with exactly one entity in El.\n(D) Every entity in E2 is associated with at most one entity in El.\n\nCS\n\n3/20\n\n\n--- PAGE 6 ---\n\nGATE 2018\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.12 Consider the following two tables and four queries in SQL.\n\nBook (isbn, bname), Stock (isbn, copies)\n\nQuery 1:\n\nQuery 2:\n\nQuery 3:\n\nQuery 4:\n\nSELECT B.isbn, S.copies\nFROM Book B INNER JOIN Stock S\nON B.isbn = S.isbn;\n\nSELECT B.isbn, S.copies\nFROM Book B LEFT OUTER JOIN Stock S\nON B.isbn = S.isbn;\n\nSELECT B.isbn, S.copies\nFROM Book B RIGHT OUTER JOIN Stock S\nON B.isbn = S.isbn;\n\nSELECT B.isbn, S.copies\nFROM Book B FULL OUTER JOIN Stock S\nON B.isbn = S.isbn;\n\nWhich one of the queries above is certain to have an output that is a superset of the outputs\nof the other three queries?\n\n(A) Query 1 (B) Query 2 (C) Query 3 (D) Query 4\nQ.13 Match the following:\nField Length in bits\n\nP. UDP Header’s Port Number I. 48\n\nQ. Ethernet MAC Address Il. 8\n\nR. IPv6 Next Header III. 32\n\nS. TCP Header’s Sequence Number IV. 16\n(A) P-III, Q-IV, R-II, S-I (B) P-I, Q-I, R-IV, S-ID\n(C) P-IV, Q-I, R-II, S-III (D) P-IV, Q-I,_ R-II, S-I\n\nCS\n\n4/20\n\n\n--- PAGE 7 ---\n\nGATE 2018\n\nQ.14\n\nQ.15\n\nQ.16\n\nQ.17\n\nQ.18\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nConsider the following statements regarding the slow start phase of the TCP congestion\ncontrol algorithm. Note that cwnd stands for the TCP congestion window and MSS denotes\nthe Maximum Segment Size.\n\n(i) The cwnd increases by 2 MSS on every successful acknowledgment.\n\n(ii) The cwnd approximately doubles on every successful acknowledgement.\n(iii) The cwnd increases by 1 MSS every round trip time.\n\n(iv) The cwnd approximately doubles every round trip time.\n\nWhich one of the following is correct?\n\n(A) Only (a1) and (iii) are true (B) Only (i) and (iii) are true\n(C) Only (iv) is true (D) Only (4) and (iv) are true\n\nTwo people, P and Q, decide to independently roll two identical dice, each with 6 faces,\nnumbered 1 to 6. The person with the lower number wins. In case of a tie, they roll the dice\nrepeatedly until there is no tie. Define a trial as a throw of the dice by P and Q. Assume that\nall 6 numbers on each dice are equi-probable and that all trials are independent. The\nprobability (rounded to 3 decimal places) that one of them wins on the third trial is\n\n4\nThe value of f m/ x cos(x?)dx correct to three decimal places\n(assuming that 72 = 3.14 ) is\n\n. . T ] 1 T\nConsider a matrix A=Uuv where u= 5}? v= 1] Note that V denotes the\n\ntranspose of v. The largest eigenvalue of A is\n\nThe chromatic number of the following graph is\n\nCS\n\n5/20\n\n\n--- PAGE 8 ---\n\nGATE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.19 Let G be a finite group on 84 elements. The size of a largest possible proper subgroup of G\niS .\n\nQ.20 The postorder traversal of a binary tree is 8,9,6,7,4,5,2,3,1. The inorder traversal of the same\ntree is 8,6,9,4,7,2,5,1,3. The height of a tree is the length of the longest path from the root to\nany leaf. The height of the binary tree above is\n\nQ.21 Consider the following C program:\n#include <stdio.h>\n\nint counter = 0;\n\nint calc (int a, int b) f\nint c;\n\ncountert++;\nif (b==3) return (a*a*a);\nelse {\nc = calc(a, b/3);\nreturn (c*c%*c);\n\nint main (){\ncalc(4, 81);\nprintf (\"Sd\", counter);\n\n}\n\nThe output of this program is\n\nQ.22 Consider the sequential circuit shown in the figure, where both flip-flops used are positive\nedge-triggered D flip-flops.\n\nThe number of states in the state transition diagram of this circuit that have a transition back\nto the same state on some value of “in” is\n\nCS 6/20\n\n\n--- PAGE 9 ---\n\nGATE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.23 A 32-bit wide main memory unit with a capacity of 1 GB is built using 256M x 4-bit DRAM\nchips. The number of rows of memory cells in the DRAM chip is 21*. The time taken to\nperform one refresh operation is 50 nanoseconds. The refresh period is 2 milliseconds. The\npercentage (rounded to the closest integer) of the time available for performing the memory\nread/write operations in the main memory unit is\n\nQ.24 Consider a system with 3 processes that share 4 instances of the same resource type. Each\nprocess can request a maximum of K instances. Resource instances can be requested and\nreleased only one at a time. The largest value of K that will always avoid deadlock is .\n\nQ.25 Consider a long-lived TCP session with an end-to-end bandwidth of 1 Gbps (= 10? bits-per-\nsecond). The session starts with a sequence number of 1234. The minimum time (in seconds,\nrounded to the closest integer) before this sequence number can be used again is\n\nQ. 26 — Q. 55 carry two marks each.\n\nQ.26 1\nConsider a matrix P whose only eigenvectors are the multiples of ay\n\nConsider the following statements.\n\n(I) P does not have an inverse\n(II) P has a repeated eigenvalue\n(III) P cannot be diagonalized\n\nWhich one of the following options is correct?\n\n(A) Only I and III are necessarily true (B) Only IT is necessarily true\n(C) Only I and I are necessarily true (D) Only II and II are necessarily true\n\nCS 7/20\n\n\n--- PAGE 10 ---\n\nGATE 2018\n\nQ.27\n\nQ.28\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nLet N be the set of natural numbers. Consider the following sets.\nP: Set of Rational numbers (positive and negative)\nQ: Set of functions from {0, 1} to N\nR: Set of functions from N to {0, 1}\nS: Set of finite subsets of N.\n\nWhich of the sets above are countable?\n\n(A) Q and S only (B) P and S only (C) P and R only (D) P, Q and S only\n\nConsider the first-order logic sentence\n@ = AsAtauVvVwVxVy W(s,t,u,Vv,W,X,y)\n\nwhere w(s, t,u, v, w, X, y) is a quantifier-free first-order logic formula using only predicate\nsymbols, and possibly equality, but no function symbols. Suppose @ has a model with a\nuniverse containing 7 elements.\n\nWhich one of the following statements is necessarily true?\n\n(A) There exists at least one model of g with universe of size less than or equal to 3.\n(B) There exists no model of ~ with universe of size less than or equal to 3.\n\n(C) There exists no model of ~ with universe of size greater than 7.\n\n(D) Every model of @ has a universe of size equal to 7.\n\nCS\n\n8/20\n\n\n--- PAGE 11 ---\n\nGATE 2018\n\nQ.29\n\nQ.30\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nConsider the following C program:\n\n#include<stdio.h>\n\nL£\n\nvoid funl(char *sl,\nchar *tmp;\n\nchar *s2) {\n\ntmp = sl;\nsl = s2;\ns2 = tmp;\n\nL£\n\nvoid fun2(char **sl, char **s2) {\n\nchar *tmp;\ntmp = *sl;\n*sl = *s2;\n*s2 = tmp;\n\n}\n\nint main() {\n\nchar *strl = \"Hi\", *str2 = \"Bye\";\n\nfunl(strl, str2); printf(\"Ss Ss \", strl, str2);\nfun2(&strl, &str2); printf(\"Ss Ss\", strl, str2);\nreturn 0;\n\n}\n\nThe output of the program above is\n\n(A) Hi Bye Bye Hi\n(C)Bye Hi Hi Bye\n\n(B) Hi Bye Hi Bye\n(D) Bye Hi Bye Hi\n\nLet G be a simple undirected graph. Let Tp be a depth first search tree of G. Let Tg be a\nbreadth first search tree of G. Consider the following statements.\n\n(1) No edge of G is a cross edge with respect to Tp. (A cross edge in G is between two\nnodes neither of which is an ancestor of the other in Tp.)\n(II) For every edge (u,v) of G, if wis at depth i and vis at depth j in Tp, then |i — j| = 1.\n\nWhich of the statements above must necessarily be true?\n\n(A) I only\n(C) Both I and II\n\n(B) II only\n(D) Neither I nor II\n\nCS\n\n9/20\n\n\n--- PAGE 12 ---\n\nGATE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.31 Assume that multiplying a matrix G; of dimension p X q with another matrix G2 of\ndimension q X r requires pqr scalar multiplications. Computing the product of n matrices\nGiG2G3...G, can be done by parenthesizing in different ways. Define G; G;+; as an explicitly\ncomputed pair for a given paranthesization if they are directly multiplied. For example, in\nthe matrix multiplication chain GjG2G3:G4GsGo using __ parenthesization\n(Gi(G2G3))(Ga(GsGo)), G2G3 and GsGe are the only explicitly computed pairs.\n\nConsider a matrix multiplication chain F)F2F3F'4Fs, where matrices F), F2, F3, F'4 and Fs are\nof dimensions 2x25, 25x3, 3x16, 16x1 and 1x1000, respectively. In the parenthesization of\nFi F2F3F4Fs that minimizes the total number of scalar multiplications, the explicitly\ncomputed pairs is/are\n\n(A) Fi F2 and F3F4 only (B) F2F3 only\n(C) F3F4 only (D) FiF2 and F4Fs only\n\nQ.32 Consider the following C code. Assume that unsigned long int type length is 64\nbits.\n\nunsigned long int fun(unsigned long int n) {\nunsigned long int i, j3 = 0, sum = 0;\n\nfor (1 =n; i > 1; 4 = 1/2) Jtt;\n\nfor (; 3 > 1; 3 = 3/2) sum++;\n\nreturn (sum) ;\n\n}\n\nThe value returned when we call fun with the input 24 is\n\n(A) 4 (B) 5 (C) 6 (D) 40\n\nQ.33 Consider the unsigned 8-bit fixed point binary number representation below,\nb7 be bs b4 b3. b2 bi bo\n\nwhere the position of the binary point is between b3 and b2. Assume b7 is the most significant\nbit. Some of the decimal numbers listed below cannot be represented exactly in the above\nrepresentation:\n\n(1) 31.500 i) 0.875 (iit) 12.100 (iv) 3.001\n\nWhich one of the following statements is true?\n\n(A) None of (1), (ii), (i11), (iv) can be exactly represented\n(B) Only (ii) cannot be exactly represented\n\n(C) Only (iit) and (iv) cannot be exactly represented\n\n(D) Only (i) and (ii) cannot be exactly represented\n\nCS 10/20\n\n\n--- PAGE 13 ---\n\nGATE 2018\n\nQ.34\n\nQ.35\n\nQ.36\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nThe size of the physical address space of a processor is 2? bytes. The word length is\n2 bytes. The capacity of cache memory is 2% bytes. The size of each cache block is\n2™ words. For a K-way set-associative cache memory, the length (in number of bits) of the\ntag field is\n\n(A) P—N — log, K (B)P —N + log, K\n(C)P-N—M—W -— log, K (D)P -N-—M—W + log, K\n\nConsider the following languages:\n\nL{a™b\"c?d?|m+p=n+q, wherem,n,p,q = 0}\n\nI. {a b\"c?d1|m = nand p = q, wherem,n, p,q = 0}\nll. {a™b\"c?d?4|m=n=pandp#q, wherem,n,p,q = 0}\nIv. {a™b\"c?d1| mn =p+q, wherem,n,p,q = 0}\n\nWhich of the languages above are context-free?\n\n(A) Iand IV only (B) I and I only\n(C) I and III only (D) II and IV only\n\nConsider the following problems. L(G) denotes the language generated by a grammar G.\nL(M) denotes the language accepted by a machine M.\n\n(1) For an unrestricted grammar G and a string w, whether w € L(G)\n\n(I) Given a Turing machine M, whether L(M) is regular\n\n(ID Given two grammars G, and G2, whether L(G,) = L(G)\n\n(IV) Given an NFA N, whether there is a deterministic PDA P such that N and P\naccept the same language.\n\nWhich one of the following statements is correct?\n\n(A) Only I and I are undecidable (B) Only III is undecidable\n(C) Only II and IV are undecidable (D) Only I, II and II are undecidable\n\nCS\n\n11/20\n\n\n--- PAGE 14 ---\n\nGATE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.37_ A lexical analyzer uses the following patterns to recognize three tokens 7|, 72, and 73 over\nthe alphabet {a,b,c}.\n\nT,: a?(blc)*a\nTz: b?(alc)*b\nT3: c?(bla)*c\n\nNote that ‘x?’ means 0 or 1 occurrence of the symbol x. Note also that the analyzer outputs\nthe token that matches the longest possible prefix.\n\nIf the string bbaacabc is processed by the analyzer, which one of the following is the\nsequence of tokens it outputs ?\n\n(A) 1) T,T3 (B) 7,1, Ts (C) T2T,T3 (D) T3T3\n\nQ.38 Consider the following parse tree for the expression a#b$c$d#e#f, involving two binary\noperators $ and #.\n\na\n\nWhich one of the following is correct for the given parse tree?\n\n(A) $ has higher precedence and is left associative; # is right associative\n(B) # has higher precedence and is left associative; $ is right associative\n(C) $ has higher precedence and is left associative; # is left associative\n\n(D) # has higher precedence and is right associative; $ is left associative\n\nCS 12/20\n\n\n--- PAGE 15 ---\n\nGA\n\nTE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.39 Inasystem, there are three types of resources: E, F and G. Four processes Po, P;, P2 and P3\nexecute concurrently. At the outset, the processes have declared their maximum resource\nrequirements using a matrix named Max as given below. For example, Max[P2,F] is the\nmaximum number of instances of F that P2 would require. The number of instances of the\nresources allocated to the various processes at any given state is given by a matrix named\n\nAllocation.\n\nConsider a state of the system with the Allocation matrix as shown below, and in which 3\ninstances of E and 3 instances of F are the only resources available.\n\nAllocation Max\nE|F/G E|\\|F\\G\nPo| 1/0} 1 Po|4|)3)]1\nP;\\ 1/142 P;|}2)1/4\nP2}1)0)]3 P22} 1|)31]3\nP3|2/)0)0 P3|}5|4/1\n\nFrom the perspective of deadlock avoidance, which one of the following is true?\n\n(A) The system is in safe state.\n\n(B) The system is not in safe state, but would be safe if one more instance of E were\n\navailable\n\n(C) The system is not in safe state, but would be safe if one more instance of F' were\n\navailable\n\n(D) The system is not in safe state, but would be safe if one more instance of G were\n\navailable\n\nCS\n\n13/20\n\n\n--- PAGE 16 ---\n\nGATE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.40 Consider the following solution to the producer-consumer synchronization problem. The\nshared buffer size is N. Three semaphores empty, full and mutex are defined with respective\ninitial values of 0, N and 1. Semaphore empty denotes the number of available slots in the\nbuffer, for the consumer to read from. Semaphore full denotes the number of available slots\nin the buffer, for the producer to write to. The placeholder variables, denoted by P, ©, R,\nand_ S, in the code below can be assigned either empty or full. The valid semaphore\noperations are: wait () and signal ().\n\nProducer: Consumer:\ndo { do {\nwalt (P); walt (R);\nwait (mutex) ; wait (mutex) ;\n//Add item to buffer //Consume item from buffer\nsignal (mutex) ; signal (mutex) ;\nsignal (Q); signal (S);\n}while(l1); }while(l1);\n\nWhich one of the following assignments to P, ©, Rand S will yield the correct solution?\n\n(A) P: full, Q: full, R: empty, S: empty\n(B) P: empty, Q: empty, R: full, — S: full\n(C) P: full, Q: empty, R: empty, S: full\n(D) P: empty, Q: full, R: full, S: empty\n\nQ.41 Consider the relations 7(A, B) and s(B, C), where s.B is a primary key and /.B is a foreign\n\nkey referencing s.B. Consider the query\n\nQ: 1 & (oB<5(S))\n\nLet LOJ denote the natural left outer-join operation. Assume that r and s contain no null\nvalues.\n\nWhich one of the following queries is NOT equivalent to Q?\n\n(A) Opes(T ™ S) (B) Oges(r LOJ s)\n(C) r LOJ (oges(s)) (D) dg<5(r) LOJ s\n\nCS\n\n14/20\n\n\n--- PAGE 17 ---\n\nGATE 2018\n\nQ.42\n\nQ.43\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nConsider the following four relational schemas. For each schema, all non-trivial functional\ndependencies are listed. The underlined attributes are the respective primary keys.\n\nSchema I: Registration (rollno, courses)\nField ‘courses’ is a set-valued attribute containing the set of courses a student has\nregistered for.\nNon-trivial functional dependency:\nrollno — courses\n\nSchema II: Registration (rollno, courseid, email)\nNon-trivial functional dependencies:\nrollno, courseid — email\nemail — rollno\n\nSchema III: Registration (rollno, courseid, marks, grade)\nNon-trivial functional dependencies:\nrollno, courseid —> marks, grade\nmarks —> grade\n\nSchema IV: Registration (rollno, courseid, credit)\nNon-trivial functional dependencies:\nrollno, courseid — credit\ncourseid —> credit\n\nWhich one of the relational schemas above is in 3NF but not in BCNF?\n\n(A) Schema I (B) Schema II (C) Schema III (D) Schema IV\n\nLet G be a graph with 100! vertices, with each vertex labelled by a distinct permutation of\nthe numbers 1,2,...,100. There is an edge between vertices u and v if and only if the label\nof u can be obtained by swapping two adjacent numbers in the label of v. Let y denote the\ndegree of a vertex in G, and z denote the number of connected components in G.\n\nThen, y + 10Z =\n\nCS\n\n15/20\n\n\n--- PAGE 18 ---\n\nGATE 2018\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.44 Consider Guwahati (G) and Delhi (D) whose temperatures can be classified as high (H),\n\nQ.45\n\nQ.46\n\nmedium (M) and low (L). Let P(Hg) denote the probability that Guwahati has high\ntemperature. Similarly, P(Mg) and P(Lg) denotes the probability of Guwahati having\nmedium and low temperatures respectively. Similarly, we use P(Hp), P(Mp) and P(Lp) for\nDelhi.\n\nThe following table gives the conditional probabilities for Delhi’s temperature given\nGuwahati’s temperature.\n\nHp Mp Lp\nHg | 040 0.48 0.12\nMg | 9.10 0.65 0.25\nLg | 0.01 0.50 0.49\n\nConsider the first row in the table above. The first entry denotes that if Guwahati has high\ntemperature (H;) then the probability of Delhi also having a high temperature (Hp) is 0.40;\ni.e., P(Hp|Hg) = 0.40. Similarly, the next two entries are P(Mp|H,) = 0.48 and\nP(Lp|Hg) = 0.12. Similarly for the other rows.\n\nIf it is known that P(Hg) = 0.2, P(M,) = 0.5, and P(L,¢) = 0.3, then the probability\n\n(correct to two decimal places) that Guwahati has high temperature given that Delhi has high\ntemperature is\n\nConsider the following program written in pseudo-code. Assume that x and y are integers.\n\nCount (x,y) {\n\nif (y != 1){\nif (x !=1) f{\nprint (\"*\")\nCount (x/2, y)?;\n}\nelse f{\n\nThe number of times that the print statement is executed by the call\nCount (1024,1024) is\n\nThe number of possible min-heaps containing each value from {1, 2, 3, 4,5, 6, 7} exactly once\nis\n\nCS\n\n16/20\n\n\n--- PAGE 19 ---\n\nGATE 2018 COMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nQ.47 Consider the following undirected graph G:\n\nChoose a value for x that will maximize the number of minimum weight spanning trees\n(MWSTs) of G. The number of MWSTs of G for this value of x is .\n\nQ.48 Consider the weights and values of items listed below. Note that there is only one unit of\n\neach item.\nItem number | Weight Value\n(in Kgs) (in Rupees)\n1 10 60\n2 7 28\n3 4 20\n4 2 24\n\nThe task is to pick a subset of these items such that their total weight is no more than 11 Kgs\nand their total value is maximized. Moreover, no item may be split. The total value of items\n\npicked by an optimal algorithm is denoted by Vopt: A greedy algorithm sorts the items by\n\ntheir value-to-weight ratios in descending order and packs them greedily, starting from the\nfirst item in the ordered list. The total value of items picked by the greedy algorithm is\n\ndenoted by Voreeay-\n\nThe value of Vont — Vereedy is\n\nQ.49 Consider the minterm list form of a Boolean function F given below.\nF(P,Q,R,S) = >, m(0, 2,5, 7,9, 11) + d(3, 8, 10, 12, 14)\n\nHere, m denotes a minterm and d denotes a don’t care term. The number of essential prime\nimplicants of the function F is\n\nCS 17/20\n\n\n--- PAGE 20 ---\n\nGATE 2018\n\nQ.50\n\nQ.51\n\nQ.52\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nThe instruction pipeline of a RISC processor has the following stages: Instruction Fetch (IF),\nInstruction Decode (ID), Operand Fetch (OF), Perform Operation (PO) and Writeback (WB).\nThe IF, ID, OF and WB stages take 1 clock cycle each for every instruction. Consider a\nsequence of 100 instructions. In the PO stage, 40 instructions take 3 clock cycles each, 35\ninstructions take 2 clock cycles each, and the remaining 25 instructions take | clock cycle\neach. Assume that there are no data hazards and no control hazards.\n\nThe number of clock cycles required for completion of execution of the sequence of\ninstructions 1s\n\nA processor has 16 integer registers (RO, RI, .. , R15) and 64 floating point registers (FO,\nFl,... , F63). It uses a 2-byte instruction format. There are four categories of instructions:\nType-1, Type-2, Type-3, and Type-4. Type-1 category consists of four instructions, each\nwith 3 integer register operands (3Rs). Type-2 category consists of eight instructions, each\nwith 2 floating point register operands (2Fs). Type-3 category consists of fourteen\ninstructions, each with one integer register operand and one floating point register operand\n(1R+1F). Type-4 category consists of N instructions, each with a floating point register\noperand (1F).\n\nThe maximum value of N is\n\nGiven a language L, define L' as follows:\nL° = {e}\nL=L'1-L foralli>0\n\nThe order of a language L is defined as the smallest k such that LE = Ltt,\n\nConsider the language L; (over alphabet 0) accepted by the following automaton.\n\n-O--O 10\n\nThe order of L is .\n\nCS\n\n18/20\n\n\n--- PAGE 21 ---\n\nGATE 2018\n\nQ.53\n\nQ.54\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nConsider a storage disk with 4 platters (numbered as 0, 1, 2 and 3), 200 cylinders (numbered\nas 0, 1, ... , 199), and 256 sectors per track (numbered as 0, 1, ... , 255). The following 6\ndisk requests of the form [sector number, cylinder number, platter number] are received by\nthe disk controller at the same time:\n\n[120, 72, 2] , [180, 134, 1] , [60, 20, 0] , [212, 86, 3] , [56, 116, 2] , [118, 16, 1]\n\nCurrently the head is positioned at sector number 100 of cylinder 80, and is moving towards\nhigher cylinder numbers. The average power dissipation in moving the head over 100\ncylinders is 20 milliwatts and for reversing the direction of the head movement once is 15\nmilliwatts. Power dissipation associated with rotational latency and switching of head\nbetween different platters is negligible.\n\nThe total power consumption in milliwatts to satisfy all of the above disk requests using the\nShortest Seek Time First disk scheduling algorithm is\n\nConsider an IP packet with a length of 4,500 bytes that includes a 20-byte IPv4 header and\na 40-byte TCP header. The packet is forwarded to an IPv4 router that supports a Maximum\nTransmission Unit (MTU) of 600 bytes. Assume that the length of the IP header in all the\noutgoing fragments of this packet is 20 bytes. Assume that the fragmentation offset value\nstored in the first fragment is 0.\n\nThe fragmentation offset value stored in the third fragment is\n\nCS\n\n19/20\n\n\n--- PAGE 22 ---\n\nGATE 2018\n\nQ.55\n\nCOMPUTER SCIENCE AND INFORMATION TECHNOLOGY\n\nConsider a simple communication system where multiple nodes are connected by a shared\nbroadcast medium (like Ethernet or wireless). The nodes in the system use the following\ncarrier-sense based medium access protocol. A node that receives a packet to transmit will\ncarrier-sense the medium for 5 units of time. If the node does not detect any other\ntransmission in this duration, it starts transmitting its packet in the next time unit. If the node\ndetects another transmission, it waits until this other transmission finishes, and then begins\nto carrier-sense for 5 time units again. Once they start to transmit, nodes do not perform any\ncollision detection and continue transmission even if a collision occurs. All transmissions\nlast for 20 units of time. Assume that the transmission signal travels at the speed of 10 meters\nper unit time in the medium.\n\nAssume that the system has two nodes P and Q, located at a distance d meters from each\nother. P starts transmitting a packet at time t=0 after successfully completing its carrier-sense\nphase. Node Q has a packet to transmit at time ¢=0 and begins to carrier-sense the medium.\n\nThe maximum distance d (in meters, rounded to the closest integer) that allows Q to\n\nsuccessfully avoid a collision between its proposed transmission and P’s ongoing\ntransmission is\n\nEND OF THE QUESTION PAPER\n\nCS\n\n20/20\n\n\n--- PAGE 23 ---\n\n"
}